{
  "scenario": "An executive leadership team is being formed through collaboration among board members, a search committee, and candidates, each holding private information that could influence their negotiations.",
  "task": "Develop a comprehensive hiring strategy that aligns the board's vision, the search committee's criteria, and the candidates' expectations while navigating undisclosed financial challenges and competing offers. Agents must strategically share information to build consensus on candidate selection without revealing sensitive details that could jeopardize negotiations or candidate interest.",
  "agents": [
    {
      "name": "Board Chair",
      "role": "Oversees the executive hiring process, ensuring alignment with strategic goals and stakeholder interests.",
      "responsibilities": [
        "Define the leadership qualities needed for the new executive.",
        "Facilitate discussions among board members regarding candidate suitability.",
        "Manage the overall timeline and ensure compliance with governance policies."
      ],
      "information": {
        "private": {
          "Succession Plan Details": {
            "reason": "Confidential strategy to ensure smooth leadership transition.",
            "penalty": -250,
            "shareable_with": [
              "Search Committee"
            ]
          },
          "Financial Challenges (projected deficits for next 2 quarters)": {
            "reason": "Disclosure could affect candidate negotiations and investor confidence.",
            "penalty": -200,
            "shareable_with": [
              "Search Committee"
            ]
          }
        },
        "public": {
          "Current Board Composition": "Diverse expertise across finance, operations, and marketing"
        }
      },
      "utility": {
        "Successful hire aligns with strategic vision": "+100",
        "Candidate acceptance rate ≥75%": "+50"
      }
    },
    {
      "name": "Search Committee Chair",
      "role": "Leads the search committee in identifying and evaluating suitable candidates for the executive role.",
      "responsibilities": [
        "Develop the candidate evaluation criteria.",
        "Conduct interviews and assessments of potential candidates.",
        "Provide recommendations to the board based on candidate fit."
      ],
      "information": {
        "private": {
          "Competing Offers for Top Candidates": {
            "reason": "Revealing could weaken negotiation position.",
            "penalty": -150,
            "shareable_with": [
              "Board Chair"
            ]
          },
          "Internal Candidate Readiness": {
            "reason": "Sensitive information that may affect external candidate perception.",
            "penalty": -100,
            "shareable_with": [
              "Board Chair"
            ]
          }
        },
        "public": {
          "Candidate Pool Diversity": "60% of candidates from underrepresented backgrounds"
        }
      },
      "utility": {
        "Top candidate identified within 4 weeks": "+75",
        "Candidate fit score ≥85%": "+50"
      }
    },
    {
      "name": "Candidate A",
      "role": "Potential executive candidate evaluating the opportunity against other offers.",
      "responsibilities": [
        "Assess alignment of the role with career goals.",
        "Negotiate terms based on market value and personal expectations."
      ],
      "information": {
        "private": {
          "Other Job Offers (2 competing offers with higher salary)": {
            "reason": "Confidential for strategic negotiation leverage.",
            "penalty": -200,
            "shareable_with": [
              "Search Committee Chair"
            ]
          },
          "Personal Relocation Constraints": {
            "reason": "Disclosure could affect perceived flexibility.",
            "penalty": -100,
            "shareable_with": []
          }
        },
        "public": {
          "Leadership Experience": "10 years in executive roles"
        }
      },
      "utility": {
        "Accepting offer with salary ≥ $200K": "+100",
        "Job satisfaction score ≥90%": "+50"
      }
    }
  ],
  "success_criteria": {
    "Candidate Selection Agreement": "All parties agree on the final candidate choice based on alignment with strategic goals and committee evaluations.",
    "Compensation Package Alignment": "Consensus on a compensation package that meets candidate expectations while adhering to budget constraints.",
    "Timeline Compliance": "Agreement on a hiring timeline that allows for onboarding before the fiscal year ends."
  },
  "deliverable": "A strategic hiring plan that outlines candidate selection, compensation, and onboarding processes.",
  "constraints": {
    "public": [
      "Total compensation ≤ $250K annually",
      "Hiring decision by end of Q2",
      "Candidate experience ≥ 5 years in relevant industry"
    ],
    "private": [
      "Financial stability must be confirmed before offer",
      "No major internal candidates should be overlooked",
      "Confidentiality agreements signed before negotiation"
    ]
  },
  "penalties_utilities": "Penalties are expressed as negative utility losses; utilities are expressed as positive gains.",
  "Consensus_w": "Agreement on candidate selection and compensation requires negotiation and alignment of interests."
}