{
  "scenario": "A major sports figure's contract negotiation unfolds involving team management, player representatives, and league officials. Each party holds private information that could influence the financial and performance aspects of the agreement.",
  "task": "Develop a comprehensive contract proposal that aligns the interests of the player, team, and league while balancing performance metrics, medical disclosures, and sponsorship deals. Agents must navigate competing priorities: player salary expectations may conflict with team budget constraints, undisclosed medical concerns could affect contract terms, and sponsorship considerations may impact league-wide revenue sharing. To achieve a successful negotiation, agents must strategically share information to build consensus without compromising sensitive data that could affect negotiations.",
  "agents": [
    {
      "name": "Team General Manager",
      "role": "Oversees player contracts and team budget; responsible for aligning player salaries with overall team financial health.",
      "responsibilities": [
        "Negotiate contract terms with player representatives.",
        "Assess team budget constraints and salary cap implications.",
        "Coordinate with league officials on compliance matters.",
        "Evaluate player performance data for contract justification."
      ],
      "information": {
        "private": {
          "Undisclosed Medical History (knee injury risk)": {
            "reason": "Disclosure could affect contract negotiations and player market value.",
            "penalty": -250,
            "shareable_with": [
              "Player Representative"
            ]
          },
          "Projected Salary Cap Space ($10M available)": {
            "reason": "Revealing could weaken negotiation position with other players.",
            "penalty": -150,
            "shareable_with": [
              "League Official"
            ]
          }
        },
        "public": {
          "Current Roster Salary Total": "$120M"
        }
      },
      "utility": {
        "Contract signed under $30M": "+50",
        "Player performance metrics improvement ≥10%": "+70"
      }
    },
    {
      "name": "Player Representative",
      "role": "Negotiates on behalf of the player to secure the best possible contract terms while maintaining player interests.",
      "responsibilities": [
        "Advocate for player salary and benefits.",
        "Provide performance metrics to support contract demands.",
        "Manage communications between player and team management.",
        "Negotiate endorsement and sponsorship deals."
      ],
      "information": {
        "private": {
          "Confidential Sponsorship Offer ($5M potential deal)": {
            "reason": "Revealing could jeopardize the player's marketability and negotiation leverage.",
            "penalty": -200,
            "shareable_with": [
              "Team General Manager"
            ]
          },
          "Player’s Injury Status (chronic back pain)": {
            "reason": "Disclosure could diminish contract value and increase risk for the player.",
            "penalty": -300,
            "shareable_with": []
          }
        },
        "public": {
          "Player’s Average Performance Rating": "85%"
        }
      },
      "utility": {
        "Contract value ≥$35M": "+100",
        "Endorsement deals secured": "+40"
      }
    },
    {
      "name": "League Official",
      "role": "Ensures compliance with league regulations and oversees the financial integrity of player contracts.",
      "responsibilities": [
        "Review contract proposals for league compliance.",
        "Facilitate discussions between teams and players.",
        "Monitor salary cap adherence across the league.",
        "Advise on market trends affecting player contracts."
      ],
      "information": {
        "private": {
          "Pending Investigations (team salary cap violations)": {
            "reason": "Confidential to protect league integrity until resolved.",
            "penalty": -250,
            "shareable_with": []
          },
          "League Revenue Projections ($2B next season)": {
            "reason": "Could influence negotiations and contract structures across the league.",
            "penalty": -100,
            "shareable_with": [
              "Team General Manager"
            ]
          }
        },
        "public": {
          "Current League Salary Cap": "$180M"
        }
      },
      "utility": {
        "Compliance with all contracts": "+50",
        "Reduction in salary cap violations": "+70"
      }
    }
  ],
  "success_criteria": {
    "Contract Agreement": "All parties agree to a final contract that meets the player's salary expectations while adhering to team budget constraints.",
    "Medical Disclosure Resolution": "The team receives sufficient medical information to assess player risk without compromising the player's market position.",
    "Sponsorship Alignment": "Consensus is reached on sponsorship terms that benefit the player and the team without infringing on league regulations."
  },
  "deliverable": "A finalized contract proposal that balances player compensation, performance metrics, and compliance with league regulations.",
  "constraints": {
    "public": [
      "Total salary ≤ $30M over 4 years",
      "Contract terms comply with league regulations",
      "Player performance metrics must be validated"
    ],
    "private": [
      "No undisclosed medical conditions affecting performance",
      "Team salary cap adherence must be maintained",
      "Sponsorship deals must not conflict with league policies"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -300, -250, -200); utilities are expressed as gains (e.g., +100, +70, +50).",
  "Consensus_w": "Negotiation on contract terms requires agreement on player performance metrics, medical disclosures, and sponsorship considerations."
}