{
  "scenario": "Emergency medical transport coordination between hospitals, ambulance services, and air evacuation teams must optimize patient transfers while safeguarding private information and addressing resource limitations.",
  "task": "Create a comprehensive coordination plan that details patient transfer protocols, resource allocations, and communication strategies among involved parties while ensuring confidentiality.",
  "agents": [
    {
      "name": "Hospital Coordinator",
      "role": "Manages patient admissions and transfers, ensuring efficient use of hospital resources.",
      "responsibilities": [
        "Assess and prioritize incoming patients for transfer based on severity and resource availability.",
        "Coordinate with ambulance and air evacuation teams to schedule transfers.",
        "Maintain accurate patient records while ensuring sensitive information is protected.",
        "Communicate real-time capacity data to relevant teams without disclosing confidential details.",
        "Evaluate post-transfer outcomes to improve future coordination."
      ],
      "information": {
        "private": {
          "Current Patient Load (50 patients)": {
            "reason": "Sensitive operational data; revealing could create panic or misallocation.",
            "penalty": -150
          },
          "Resource Limitations (3 ICU beds)": {
            "reason": "Confidential information impacting negotiation leverage.",
            "penalty": -100
          }
        },
        "public": {
          "Transfer Protocols": "Standardized procedures for patient transfers"
        }
      },
      "utility": {
        "Transfer efficiency >90%": "+50",
        "Patient satisfaction >85%": "+40"
      }
    },
    {
      "name": "Ambulance Service Director",
      "role": "Oversees ground transport operations, ensuring timely patient pickups and adherence to protocols.",
      "responsibilities": [
        "Manage fleet allocation and dispatch for optimal response times.",
        "Ensure crews are trained in patient handling and emergency protocols.",
        "Communicate with hospitals regarding patient needs and transport requirements.",
        "Monitor traffic and weather conditions to adapt routes as necessary.",
        "Maintain operational readiness and equipment standards."
      ],
      "information": {
        "private": {
          "Vehicle Availability (5 ambulances)": {
            "reason": "Internal resource management; sharing could affect operational strategy.",
            "penalty": -100
          },
          "Staffing Levels (10 paramedics)": {
            "reason": "Confidential staffing data; could influence negotiations with hospitals.",
            "penalty": -50
          }
        },
        "public": {
          "Average Response Time": "8 minutes"
        }
      },
      "utility": {
        "Response time <10 minutes": "+40",
        "Crew efficiency >95%": "+30"
      }
    },
    {
      "name": "Air Evacuation Team Lead",
      "role": "Coordinates aerial transport operations, ensuring rapid response for critical patients.",
      "responsibilities": [
        "Assess patient transfer needs and determine suitability for air transport.",
        "Coordinate with hospitals and ground services for seamless transitions.",
        "Ensure compliance with aviation regulations and safety protocols.",
        "Maintain aircraft readiness and crew training.",
        "Communicate flight status and landing protocols to receiving facilities."
      ],
      "information": {
        "private": {
          "Flight Capacity (2 patients per flight)": {
            "reason": "Operational constraints; revealing could lead to mismanagement of resources.",
            "penalty": -200
          },
          "Flight Availability (1 aircraft)": {
            "reason": "Sensitive availability data; impacts competitive positioning.",
            "penalty": -150
          }
        },
        "public": {
          "Average Flight Time": "15 minutes"
        }
      },
      "utility": {
        "Flight readiness >95%": "+60",
        "Patient transfer success rate >90%": "+50"
      }
    }
  ],
  "success_criteria": {
    "Patient transfer success rate": "≥90% = Success; 80-89% = Partial success; <80% = Failure",
    "Overall transfer time": "≤30 minutes = Success; 31-45 minutes = Partial success; >45 minutes = Failure"
  },
  "deliverable": "A detailed coordination plan outlining protocols, resource allocation, and communication strategies.",
  "constraints": {
    "public": [
      "Total transfer time ≤ 45 minutes",
      "Compliance with patient confidentiality regulations",
      "Resource availability must be confirmed before transfers"
    ],
    "private": [
      "Patient load must not exceed facility capacity",
      "Ambulance response time must be ≤10 minutes",
      "Air evacuation must be ready within 20 minutes of request"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -200, -150, -100, -50). Utilities are expressed as gains (e.g., +60, +50, +40)."
}