{
  "scenario": "Emergency medical transport coordination involves collaboration between hospitals, ambulance services, and air evacuation teams, each holding private information that could impact patient care and resource allocation.",
  "task": "Develop a comprehensive emergency transport plan that balances patient needs, resource availability, and response times. Agents must navigate competing priorities: timely patient transfers may conflict with resource limitations and facility capacities. They must strategically share information—enough to coordinate effectively while protecting sensitive patient data and operational constraints.",
  "agents": [
    {
      "name": "Hospital Coordinator",
      "role": "Manages patient intake and transfer logistics, ensuring swift access to necessary medical facilities.",
      "responsibilities": [
        "Assess incoming patient needs and prioritize transfers.",
        "Coordinate with ambulance services for timely dispatch.",
        "Maintain communication with receiving facilities for capacity updates."
      ],
      "information": {
        "private": {
          "Current Patient Load (95% capacity)": {
            "reason": "Disclosure may lead to overloading and patient safety risks.",
            "penalty": -150,
            "shareable_with": [
              "Ambulance Service Lead"
            ]
          },
          "Critical Equipment Availability (2 ventilators)": {
            "reason": "Sensitive information that could affect transfer decisions.",
            "penalty": -100,
            "shareable_with": [
              "Air Evacuation Team Lead"
            ]
          }
        },
        "public": {
          "Average Response Time": "10 minutes"
        }
      },
      "utility": {
        "Transfer success rate ≥90%": "+100",
        "Response time ≤8 minutes": "+50"
      }
    },
    {
      "name": "Ambulance Service Lead",
      "role": "Oversees ground transport logistics, ensuring timely arrivals and efficient patient transfers.",
      "responsibilities": [
        "Dispatch ambulances based on priority and location.",
        "Communicate with hospitals regarding transport readiness.",
        "Monitor traffic and route conditions to optimize response times."
      ],
      "information": {
        "private": {
          "Resource Limitations (only 5 ambulances available)": {
            "reason": "Disclosure could impact public perception and trust.",
            "penalty": -200,
            "shareable_with": [
              "Hospital Coordinator"
            ]
          },
          "Staffing Shortages (2 EMTs unavailable)": {
            "reason": "Sensitive operational detail that could affect service delivery.",
            "penalty": -150,
            "shareable_with": [
              "Air Evacuation Team Lead"
            ]
          }
        },
        "public": {
          "Average Transport Time": "15 minutes"
        }
      },
      "utility": {
        "Transport success rate ≥85%": "+75",
        "Average response time ≤12 minutes": "+40"
      }
    },
    {
      "name": "Air Evacuation Team Lead",
      "role": "Coordinates air transport logistics, ensuring rapid response for critical patients needing specialized care.",
      "responsibilities": [
        "Evaluate patient transfer requests for air transport eligibility.",
        "Coordinate with hospitals and ambulance services for seamless transitions.",
        "Manage air traffic and landing permissions for timely evacuations."
      ],
      "information": {
        "private": {
          "Flight Capacity (1 helicopter available)": {
            "reason": "Operational capacity detail that could lead to resource misallocation.",
            "penalty": -200,
            "shareable_with": [
              "Hospital Coordinator"
            ]
          },
          "Pending Weather Conditions (storm expected)": {
            "reason": "Disclosure could lead to unnecessary panic and miscommunication.",
            "penalty": -100,
            "shareable_with": [
              "Ambulance Service Lead"
            ]
          }
        },
        "public": {
          "Average Evacuation Time": "30 minutes"
        }
      },
      "utility": {
        "Evacuation success rate ≥90%": "+100",
        "Average evacuation time ≤25 minutes": "+50"
      }
    }
  ],
  "success_criteria": {
    "Transfer Coordination": "All agents agree on a transfer protocol that optimally utilizes available resources while prioritizing patient safety.",
    "Response Time Agreement": "Consensus on response times that meet or exceed the operational targets set by each agency.",
    "Capacity Management": "Agreement on how to manage patient loads and resource allocations effectively without compromising care."
  },
  "deliverable": "An emergency transport coordination plan detailing patient transfer protocols, resource allocations, and response strategies.",
  "constraints": {
    "public": [
      "Total average response time ≤20 minutes",
      "No patient left waiting ≥30 minutes",
      "Compliance with emergency medical regulations"
    ],
    "private": [
      "Hospital capacity must not exceed 90% during peak transfers",
      "Ambulance service must maintain at least 80% operational readiness",
      "Air evacuation must have a backup plan for adverse weather conditions"
    ]
  },
  "penalties_utilities": "Penalties are expressed as negative utility losses (e.g., -200, -150, -100). Utilities are expressed as gains (e.g., +100, +75, +50).",
  "Consensus_w": "Agreement on resource management and patient prioritization is necessary for effective coordination."
}