{
  "scenario": "Negotiating the final plan for 'Digital Soul,' a high-profile, career-defining exhibition at the Metropolitan Modern Art Pavilion, involving a celebrated artist, the museum's lead curator, a major corporate sponsor, and the museum's director.",
  "task": "The four agents must collaboratively finalize and sign an 'Exhibition Blueprint' document. This document must specify the exhibition's central theme, the final list of 5 'marquee' art pieces, a detailed budget allocation for the artist's fee, materials, and marketing, and the primary tagline for the press release. Agreement must be unanimous.",
  "agent_number": 4,
  "agent_names": [
    "Elena Petrova",
    "Dr. Samuel Chen",
    "Javier 'Javi' Rodriguez",
    "Beatrice Vance"
  ],
  "agents": [
    {
      "name": "Elena Petrova",
      "role": "Renowned Digital Artist",
      "description": "A visionary and often provocative artist known for large-scale, immersive digital installations. This exhibition is her first major solo show in a decade, and she sees it as the platform for her most important work to date.",
      "shareable_preferences": {
        "artistic_vision": {
          "description": "Elena is adamant that the exhibition's centerpiece must be her brand-new, un-exhibited work, 'Panopticon'. This piece is a massive, interactive sculpture that uses real-time data scraping to critique corporate surveillance. She requires a budget of at least $400,000 for its fabrication and believes it's the only piece that truly represents her current artistic direction. She feels her older works are thematically outdated.",
          "utility_impact": "Getting 'Panopticon' as the centerpiece is her primary goal. If it's accepted as is (+2). If it's significantly altered or relegated to a minor role (-1). If it's rejected entirely (-2)."
        },
        "artist_fee": {
          "description": "Elena expects a premium artist fee that reflects her status and the significance of the show. She is publicly demanding a fee of no less than $250,000, arguing it is the industry standard for an artist of her caliber for a show of this magnitude.",
          "utility_impact": "A fee of $250k or more is validating (+1). A fee between $200k and $249k is acceptable (0). A fee below $200k is insulting and makes her question the museum's commitment (-1)."
        }
      },
      "private_preferences": {
        "financial_distress": {
          "value": "Elena is in serious private debt after a series of failed crypto investments and a messy divorce. She needs a minimum of $225,000 from her artist fee just to prevent the bank from foreclosing on her studio. She cannot walk away from this deal. The public perception is that she is wealthy and successful. Sharing this would shatter her image of being a top-tier artist who creates for art's sake, not for money, and would severely weaken her negotiating position for future projects.",
          "reason": "Revealing her financial desperation would damage her professional reputation and brand as a 'pure' artist.",
          "utility_impact": "This desperation secretly makes securing a high fee more important than her artistic vision, though she will never admit it. If she reveals this information, she incurs a penalty of -2 to her total utility due to reputational damage."
        }
      }
    },
    {
      "name": "Dr. Samuel Chen",
      "role": "Lead Curator, Metropolitan Modern Art Pavilion",
      "description": "A respected academic and curator with a reputation for creating historically significant, critically acclaimed exhibitions. He has championed Elena's work for years and sees this show as a capstone to his career at the museum.",
      "shareable_preferences": {
        "curatorial_narrative": {
          "description": "Samuel envisions the exhibition as a comprehensive retrospective, tracing Elena's evolution as an artist. He wants to title it 'Elena Petrova: Circuits of the Self' and feature a balanced mix of her iconic older works (like 'Digital Ghost' and 'Echo Chamber') alongside her new creations. He believes this approach provides essential context and has broader appeal.",
          "utility_impact": "A balanced retrospective narrative is achieved (+2). The show focuses almost exclusively on new, untested work (0). The show becomes a commercial showcase dictated by the sponsor (-2)."
        },
        "academic_integrity": {
          "description": "Samuel insists that the exhibition materials, including wall texts and the catalogue, maintain a high level of academic rigor. He is strongly against 'dumbing down' the language for commercial purposes or including overt corporate branding from the sponsor within the gallery space itself.",
          "utility_impact": "Full curatorial control over academic content is maintained (+1). Minor compromises on marketing language are made (0). Sponsor logos or taglines appear inside the exhibition halls (-2)."
        }
      },
      "private_preferences": {
        "career_ambition": {
          "value": "Samuel is a finalist for the directorship of the prestigious International Gallery of Digital Art. The hiring committee is attending the 'Digital Soul' opening night. A flawlessly executed, critically lauded, and popular exhibition is essential for him to secure the job. Any major controversy, public disputes with the artist, or a critical failure would be catastrophic for his candidacy.",
          "reason": "Revealing his job candidacy would look disloyal to his current institution and make him appear self-serving in the negotiation.",
          "utility_impact": "This makes him highly risk-averse to controversy and desperate for a smooth, successful process. If he reveals his candidacy, he takes a -1 utility penalty for unprofessionalism."
        },
        "artistic_doubt": {
          "value": "Privately, Samuel has seen the initial renders for 'Panopticon' and thinks the piece is artistically heavy-handed and less profound than Elena's earlier work. He fears it will be critically panned as being too 'on-the-nose' and could tarnish her legacy, which would reflect poorly on him as the curator.",
          "reason": "Voicing direct criticism of a renowned artist's new 'masterpiece' is a major professional taboo and would irreparably damage his relationship with Elena.",
          "utility_impact": "This internal conflict drives his preference for a retrospective, as it allows him to hedge his bets by surrounding the potentially weak new piece with proven classics. If he shares this harsh critique directly, he takes a -1 utility penalty for damaging a key artistic relationship."
        }
      }
    },
    {
      "name": "Javier 'Javi' Rodriguez",
      "role": "Director of Experiential Marketing, Innovate Corp.",
      "description": "A sharp, results-driven marketing executive from a global tech giant. Innovate Corp. is the sole corporate sponsor, and Javi is responsible for ensuring the sponsorship generates a massive positive return on investment in brand image and public perception.",
      "shareable_preferences": {
        "brand_alignment": {
          "description": "Javi's primary goal is to associate Innovate Corp. with forward-thinking, positive, and inspiring innovation. He wants the exhibition to be uplifting and centered on the theme 'The Future is Human-Centric.' He is pushing for the inclusion of interactive, family-friendly elements and wants the Innovate Corp. logo prominently featured on all marketing materials. He proposes the tagline: 'Digital Soul: Powered by Innovate Corp.'",
          "utility_impact": "The exhibition theme is positive and tech-optimistic (+2). The theme is neutral (0). The theme is critical of technology or corporations (-2)."
        },
        "sponsorship_budget": {
          "description": "Javi has been authorized to offer a sponsorship package of $1,200,000. He will publicly state that this is the absolute maximum, non-negotiable budget ceiling provided by his board. He needs to cover the artist's fee, material costs, and a significant marketing spend from this amount.",
          "utility_impact": "Keeping the total spend at or below $1.2M is a key performance indicator for him (+1). Spending more than $1.2M negatively impacts his performance review (0 to -2 depending on the overage)."
        }
      },
      "private_preferences": {
        "damage_control": {
          "value": "Innovate Corp. is secretly on the verge of settling a major class-action lawsuit regarding monopolistic practices and user data privacy violations. The 'Digital Soul' sponsorship is a key pillar of their 'Good Citizen' PR campaign designed to divert negative press. Any art that is even remotely critical of corporate power, data collection, or surveillance would be an absolute disaster, directly undermining their entire strategy. He has a confidential internal memo from the CEO that explicitly forbids any association with 'anti-capitalist, anti-corporate, or privacy-activist' themes.",
          "reason": "Revealing the lawsuit and the PR strategy would create a massive public scandal, confirming the company's cynical motivations.",
          "utility_impact": "This is a non-negotiable hard-line for him. He cannot approve any version of 'Panopticon.' Revealing the memo would lead to his immediate termination and a -3 utility penalty. Revealing the lawsuit context would also result in a -3 penalty."
        },
        "hidden_budget": {
          "value": "While the official budget is $1.2M, Javi has a discretionary 'strategic initiative' fund of an additional $300,000 he can allocate to the project, bringing the true maximum to $1.5M. However, using this fund requires significant justification to his CFO and will eliminate his annual performance bonus. He recently received a congratulatory email from his manager for securing the sponsorship for the 'bargain price' of $1.2M, which he is very proud of.",
          "reason": "Admitting he has more money available weakens his negotiating position and has direct negative financial consequences for him personally.",
          "utility_impact": "He is highly incentivized to solve all problems without touching this fund. Revealing the existence of the extra $300k carries a -1 utility penalty because it impacts his bonus and reputation for fiscal responsibility."
        }
      }
    },
    {
      "name": "Beatrice Vance",
      "role": "Museum Director",
      "description": "The pragmatic and politically savvy director of the museum. She is responsible for the institution's financial health, long-term strategy, and managing relationships with artists, staff, and most importantly, donors.",
      "shareable_preferences": {
        "timeline_and_budget": {
          "description": "Beatrice's main priority is delivering the exhibition on time for the fall gala season and within the overall budget. The museum has allocated $300,000 of its own funds for operational costs (staffing, security, utilities), but all direct exhibition costs (art, marketing) must be covered by the Innovate Corp. sponsorship. A delay would throw off the entire museum's calendar and budget for the year.",
          "utility_impact": "The project is on time and within the stated budget (+2). There are minor budget overages covered by a contingency fund (0). The project is significantly delayed or requires a major, unplanned cash infusion from the museum (-2)."
        },
        "public_attendance": {
          "description": "She needs this to be a blockbuster show that drives ticket sales and memberships. She supports a title and theme that are accessible and exciting to a broad audience, not just the academic art world. She is concerned that a purely academic or overly confrontational show will not attract the general public.",
          "utility_impact": "The final plan is projected to be a major public draw (+1). It is a niche, academic show (0). It is a controversial show that alienates a large portion of the potential audience (-1)."
        }
      },
      "private_preferences": {
        "donor_ultimatum": {
          "value": "Beatrice has spent the last year courting a deeply conservative philanthropist, Mr. Alistair Sterling, for a $5,000,000 endowment for the museum's digital art program. Mr. Sterling has sent her a private, confidential email stating his gift is contingent on the museum's next major exhibition being 'a celebration of innovation, not a critique of the free market that enabled its creation.' He explicitly mentioned he would be watching the 'Digital Soul' exhibition's messaging closely and would pull his donation permanently if it contained 'divisive, anti-business political statements.'",
          "reason": "Donor communications are sacrosanct. Revealing a donor's private demands would be a catastrophic breach of trust, likely causing Mr. Sterling to pull his donation immediately and damaging the museum's reputation with all other potential donors.",
          "utility_impact": "This is a hard constraint that aligns her with Javi against Elena's 'Panopticon,' but she cannot reveal the true reason why. Any outcome that jeopardizes the donation is a -2 utility event. Revealing the ultimatum email is a career-ending -3 utility penalty."
        }
      }
    }
  ],
  "success_criteria": {
    "unanimous_agreement": "All four agents must sign the final 'Exhibition Blueprint' document.",
    "blueprint_completion": "The blueprint must contain a definitive and agreed-upon: 1. Exhibition Title/Theme, 2. List of 5 Marquee Artworks, 3. Detailed Budget Allocation (totaling the agreed sponsorship amount), and 4. Official Press Release Tagline."
  },
  "constraints": {
    "verifiable": [
      "The exhibition must open on October 1st.",
      "The main gallery space is 10,000 square feet with a 30-foot ceiling height.",
      "The museum's direct contribution is fixed at $300,000 for operational costs and cannot be used for direct exhibition production."
    ],
    "hidden": [
      "The total available sponsorship from Innovate Corp. is secretly $1,500,000.",
      "The exhibition cannot contain overt anti-corporate or anti-business messaging, or a $5,000,000 museum endowment will be lost.",
      "Innovate Corp. cannot be associated with any art that critiques data privacy or corporate surveillance due to an ongoing lawsuit."
    ]
  },
  "deliverable": "A single, finalized 'Exhibition Blueprint' document co-signed by all four agents.",
  "solvability_note": "The scenario is solvable if private information is revealed. Knowing about the hard constraints from the lawsuit and the donor would force Elena to abandon or drastically alter 'Panopticon.' Knowledge of Javi's extra $300k and Elena's financial desperation would create a clear path to a solution: use the full $1.5M budget to give Elena a massive artist fee (e.g., $400k, solving her private problem) in exchange for her creating a different, less politically charged but still spectacular centerpiece. This would satisfy Javi's need for a positive PR show, Beatrice's need to secure her donor, and Samuel's desire for a critically successful (and less risky) exhibition."
}