{
  "scenario": "Metropolis Emergency Pandemic Response - Critical Resource Allocation",
  "task": "A state-level emergency task force has been convened to decide the allocation of a single, limited shipment of critical medical supplies for the next 4 weeks. The city is facing an imminent, but poorly understood, surge of a new COVID-19 variant. The task force must produce a unanimous, detailed distribution plan for these resources. Failure to agree will result in the activation of a default, outdated, and highly inefficient distribution protocol that all parties consider a worst-case scenario.",
  "agent_number": 4,
  "agent_names": [
    "Dr. Alistair Finch",
    "Marcus Thorne",
    "Dr. Evelyn Ramirez",
    "Maria Flores"
  ],
  "agents": [
    {
      "name": "Dr. Alistair Finch",
      "role": "Chief Epidemiologist, State Department of Health",
      "description": "A data-driven scientist in his late 50s, Dr. Finch is respected for his unemotional, evidence-based approach. His sole focus is minimizing overall mortality and preventing the complete collapse of the regional healthcare system. He trusts his models above all else and can be dismissive of political or financial concerns.",
      "shareable_preferences": {
        "Data-Driven Pre-allocation": {
          "description": "Dr. Finch insists that at least 60% of all resources (120 ventilators, 30 ICU beds, 6,000 PPE kits) must be pre-allocated to a centralized state-controlled 'float pool'. This pool would be deployed dynamically to emerging hotspots based on real-time data. He argues that fixed allocations to hospitals are inefficient and will lead to resources sitting unused in one location while another is overwhelmed. He believes this is the only way to stay agile in the face of an unpredictable surge.",
          "utility_impact": {
            "Allocation to float pool >= 60%": "+2",
            "Allocation to float pool 40%-59%": "+1",
            "Allocation to float pool 20%-39%": "-1",
            "Allocation to float pool < 20%": "-2"
          }
        },
        "Prioritize Ventilators for the Float Pool": {
          "description": "He believes ventilators are the most critical and least mobile asset. Therefore, he wants the highest possible percentage of the ventilators (ideally over 75%, or 150 units) to be placed in the float pool, even if it means other resources are distributed more widely. He argues that ICU beds and PPE are easier for individual hospitals to manage, but ventilators require specialized deployment.",
          "utility_impact": {
            "Ventilators in float pool >= 150": "+2",
            "Ventilators in float pool 100-149": "+1",
            "Ventilators in float pool 50-99": "0",
            "Ventilators in float pool < 50": "-1"
          }
        }
      },
      "private_preferences": {
        "Confidential Surge Model Projection": {
          "value": "Dr. Finch's team has just completed a new epidemiological model using wastewater and mobility data. It predicts with 85% confidence that a massive, explosive surge will begin in the low-income, high-density 'East Bank' district in exactly 18-22 days. This area is served almost exclusively by Maria Flores' Metro General Hospital. The model, codenamed 'Crimson Tide', is not yet peer-reviewed. Releasing this specific, alarming prediction prematurely would cause mass panic, hoarding, and political chaos if it's wrong, potentially ending his career. He can only hint at 'concerning signals' in certain areas.",
          "reason": "Risk of public panic and catastrophic career damage if the unverified model is wrong.",
          "utility_impact": {
            "Revealing the 'Crimson Tide' model by name or its specific location/timeline prediction": "-2",
            "Hinting strongly at a 'single, massive surge in a vulnerable, urban area' without naming it": "-1",
            "Keeping it completely confidential": "0"
          }
        }
      }
    },
    {
      "name": "Marcus Thorne",
      "role": "Governor's Deputy Chief of Staff",
      "description": "A sharp, pragmatic political operative in his early 40s. Marcus's job is to protect the Governor. His priorities are maintaining public order, ensuring the administration appears competent and fair, and managing key political relationships. He views the problem through a lens of public relations and political stability.",
      "shareable_preferences": {
        "Visibly Equitable Distribution": {
          "description": "Marcus demands that no single entity (including the state float pool) receive more than 40% of any single resource type. He wants a plan that can be presented to the public as 'fair and balanced,' ensuring every major hospital gets 'a piece of the pie.' He is terrified of headlines like 'Governor Favors Private Hospitals' or 'Governor Abandons Metro General.' He proposes a baseline allocation to each hospital before any strategic reserves are considered.",
          "utility_impact": {
            "No entity receives >40% of any resource": "+2",
            "One entity receives 41%-50%": "0",
            "One entity receives 51%-60%": "-1",
            "One entity receives >60%": "-2"
          }
        },
        "Immediate and Final Decision": {
          "description": "The Governor wants this crisis handled 'today'. Marcus is pushing for a simple, clear-cut allocation plan that can be finalized and signed in this meeting. He will resist any proposal that involves complex, ongoing management (like Dr. Finch's float pool) as it creates more opportunities for failure and negative press. He wants a 'fire and forget' solution.",
          "utility_impact": {
            "Plan is fixed and final today": "+2",
            "Plan has minor review clauses": "+1",
            "Plan requires active daily management (like a float pool)": "-2"
          }
        }
      },
      "private_preferences": {
        "Critical Supply Chain Collapse": {
          "value": "Marcus is the only person in the room who knows the truth about the supply chain. He has a classified memo from the federal liaison stating that the manufacturer of the ventilators has had a catastrophic factory failure. The 200 ventilators they have now are the *only* ones the state will receive for at least six months. The promised 'next wave' does not exist. Admitting this would trigger statewide panic, hoarding, and make the Governor's administration look weak and unprepared.",
          "reason": "Preventing statewide panic and protecting the Governor's political reputation.",
          "utility_impact": {
            "Revealing the full, six-month supply disruption": "-2",
            "Vaguely mentioning 'significant, long-term supply chain uncertainty'": "-1",
            "Saying nothing": "0"
          }
        },
        "Pressure from a Major Donor": {
          "value": "The CEO of the parent corporation for St. Jude's Medical Center (Dr. Ramirez's hospital) is one of the Governor's largest campaign donors. Marcus has a saved email from his boss that reads: 'Marcus, we need to make sure St. Jude's feels supported. They are pillars of the community and crucial friends of this administration. No surprises.' He cannot allow Dr. Ramirez to leave the negotiation feeling slighted, which means she needs to get a significant portion of her request met.",
          "reason": "Maintaining a critical political and financial alliance for the Governor.",
          "utility_impact": {
            "Dr. Ramirez's hospital receives less than 25% of the ventilators (under 50)": "-2",
            "Revealing the donor relationship": "-2"
          }
        }
      }
    },
    {
      "name": "Dr. Evelyn Ramirez",
      "role": "Chief Operating Officer, St. Jude's Medical Center",
      "description": "Impeccably dressed and fiercely intelligent, Dr. Ramirez runs the state's most prestigious and profitable private hospital. She is focused on maintaining St. Jude's reputation for elite care, protecting her highly specialized staff, and ensuring the hospital remains financially viable through the crisis by continuing lucrative elective procedures.",
      "shareable_preferences": {
        "Capability-Based Allocation": {
          "description": "Dr. Ramirez argues that resources should be allocated based on a hospital's proven ability to use them. St. Jude's has 80 state-of-the-art ICU suites and the most highly trained respiratory therapists in the state. She proposes that at least 50% of the ventilators (100 units) and ICU beds (25 units) go to her hospital, as they have the infrastructure and staff to maximize lives saved per machine. 'A ventilator is useless without a trained specialist,' she often repeats.",
          "utility_impact": {
            "St. Jude's receives >= 100 ventilators AND >= 25 ICU beds": "+2",
            "St. Jude's receives >= 80 ventilators": "+1",
            "St. Jude's receives 50-79 ventilators": "0",
            "St. Jude's receives < 50 ventilators": "-2"
          }
        },
        "Staff Protection Priority": {
          "description": "She insists that protecting her elite, hard-to-replace medical staff is the top priority. She demands 40% (4,000 kits) of the specialized PPE, arguing that a single outbreak among her staff would cripple the region's capacity for complex care (transplants, cardiac surgery, etc.), leading to non-COVID deaths. She is unwilling to compromise on receiving fewer than 3,000 kits.",
          "utility_impact": {
            "St. Jude's receives >= 4,000 PPE kits": "+2",
            "St. Jude's receives 3,000-3,999 PPE kits": "+1",
            "St. Jude's receives < 3,000 PPE kits": "-2"
          }
        }
      },
      "private_preferences": {
        "Undisclosed Staffing Crisis": {
          "value": "Dr. Ramirez is hiding a critical shortage of respiratory therapists. A recent internal HR report on her laptop shows that five of her top twenty therapists have quit in the last month due to burnout. She can only effectively staff about 60 additional ventilators, not the 100 she is demanding. Admitting this would shatter her 'capability' argument, damage the hospital's pristine reputation, and likely lead to her receiving a smaller allocation.",
          "reason": "Protecting hospital reputation and negotiation leverage.",
          "utility_impact": {
            "Admitting the specific number of staff who have quit": "-2",
            "Hinting at 'staffing challenges' or 'burnout concerns'": "-1",
            "Keeping it secret": "0"
          }
        },
        "Secret 'Executive' COVID Wing": {
          "value": "To protect the hospital's main revenue stream (high-cost elective surgeries for wealthy clients), St. Jude's has secretly converted its isolated 'North Wing' into a premium, private-pay COVID-19 treatment center for board members and VIPs. This wing is already using a substantial amount of their internal PPE reserves and is nearing capacity. Revealing this would create a PR firestorm, with accusations of catering to the rich while the city suffers. Her official hospital census numbers do not include these patients.",
          "reason": "Avoiding a massive public relations scandal and protecting a key revenue source.",
          "utility_impact": {
            "Revealing the existence of the VIP wing": "-2",
            "Alluding to 'special patient populations with unique needs'": "-0.5"
          }
        }
      }
    },
    {
      "name": "Maria Flores",
      "role": "Hospital Director, Metro General Hospital",
      "description": "A tireless and passionate advocate for her community, Maria has been the director of the city's main public hospital for 15 years. She is accustomed to fighting for scraps. Her hospital serves the city's most vulnerable populations and is chronically underfunded and over capacity.",
      "shareable_preferences": {
        "Vulnerability-Weighted Allocation": {
          "description": "Maria argues fiercely that resources must be allocated based on community need, not hospital size or wealth. Her hospital serves a population with higher rates of comorbidities, crowded living situations, and less access to healthcare, making them more susceptible to severe outcomes. She demands that Metro General receive at least 40% of the ventilators (80 units) and 50% of the ICU beds (25 units) to prepare for the inevitable surge in her community.",
          "utility_impact": {
            "Metro General receives >= 80 ventilators AND >= 25 ICU beds": "+2",
            "Metro General receives >= 60 ventilators": "+1",
            "Metro General receives 40-59 ventilators": "0",
            "Metro General receives < 40 ventilators": "-2"
          }
        },
        "Immediate Resource Transfer": {
          "description": "Unlike other hospitals, Metro General is already at a crisis point. Maria needs resources delivered immediately. She wants a clause in the agreement that guarantees delivery to her hospital within 24 hours of the signing. Any plan that involves holding resources in a central pool for weeks is unacceptable to her, as her patients are dying now. She will use emotive, powerful language about her overflowing ER to make her point.",
          "utility_impact": {
            "Guaranteed 24-hour delivery of her full allocation": "+2",
            "Delivery within 72 hours": "+1",
            "Allocation is part of a float pool with no guaranteed delivery time": "-2"
          }
        }
      },
      "private_preferences": {
        "Imminent Oxygen System Failure": {
          "value": "Maria has a terrifying secret. A confidential engineering report, delivered two days ago, states that Metro General's aging central oxygen delivery system is dangerously overloaded. The report concludes with 'a high probability of catastrophic failure' if more than 70 ventilators are operated simultaneously campus-wide. They currently have 30 running. She can only safely accept 40 new ventilators. Admitting this would cause her staff to panic, lead to her hospital being deemed unsafe, and result in patients being diverted, effectively shutting her down. She must get the maximum number of ventilators possible to force an emergency state-funded repair, but she can't actually use them all right away.",
          "reason": "Avoiding staff panic, public outcry, and the potential closure of her hospital.",
          "utility_impact": {
            "Revealing the specific 'catastrophic failure' risk from the report": "-2",
            "Stating that her hospital has 'some infrastructure limitations' on new equipment": "-1",
            "Keeping it secret": "0"
          }
        }
      }
    }
  ],
  "success_criteria": {
    "Unanimous Agreement": "All four agents must sign a single, final document.",
    "Complete Allocation": "The document must detail the distribution of 100% of the 200 ventilators, 50 mobile ICU beds, and 10,000 specialized PPE kits.",
    "No Default Protocol": "If no agreement is reached within the allotted time, the default protocol is enacted, which all agents consider a massive failure (-2 utility for all)."
  },
  "constraints": {
    "verifiable": [
      "Total available resources: 200 advanced ventilators, 50 mobile ICU bed units, 10,000 specialized PPE kits.",
      "The allocation plan must be for the next 4-week operational period.",
      "The decision must be finalized within a single 3-hour meeting."
    ],
    "hidden": [
      "The total supply of ventilators is fixed at 200 for the next six months.",
      "Metro General's oxygen system cannot support more than 40 new ventilators.",
      "St. Jude's can only effectively staff approximately 60 new ventilators.",
      "A massive infection surge is projected to hit Metro General's service area in ~3 weeks."
    ]
  },
  "deliverable": "A one-page signed PDF document titled 'Metropolis Emergency Resource Allocation Plan' that specifies the exact number of ventilators, ICU beds, and PPE kits allocated to St. Jude's Medical Center, Metro General Hospital, and the State-Controlled Float Pool.",
  "solvability_note": "The scenario is solvable if private information is revealed. Dr. Finch's surge data proves Metro General is the highest priority. However, Maria's oxygen system limitation means she can't take all the resources immediately. Dr. Ramirez's staffing shortage means she also cannot take the huge number she demands. This frees up a large number of ventilators. The logical solution is to give Metro General the 40 ventilators it can handle immediately, plus a large share of PPE and ICU beds. A significant number of the remaining ventilators (e.g., 100+) are placed in Dr. Finch's float pool, with the explicit goal of deploying them to support Metro General as soon as its oxygen system can be upgraded (a new priority for Marcus). St. Jude's receives the remaining ~60 ventilators it can actually staff. Marcus's knowledge of the supply collapse makes the creation of a robust float pool a critical long-term strategy, overriding his desire for a simple plan."
}