{
  "scenario": "Salary negotiations take place between an HR representative and a selected candidate who has received multiple competing job offers, creating a complex dynamic around salary expectations and internal equity.",
  "task": "Negotiate a final salary package that aligns with the company's budget constraints while meeting the candidate's salary expectations and considering the offers from other companies. Both parties must navigate the sensitive internal salary information and the candidate's competing offers to reach a mutually beneficial agreement.",
  "agents": [
    {
      "name": "HR Manager",
      "role": "Oversees the recruitment process and finalizes salary offers while ensuring internal pay equity.",
      "responsibilities": [
        "Evaluate the candidate's qualifications and market value.",
        "Determine the salary range based on internal data and budget constraints.",
        "Facilitate negotiations while maintaining confidentiality of existing employee salaries.",
        "Communicate the company’s compensation philosophy to the candidate."
      ],
      "information": {
        "private": {
          "Internal Salary Data (Employee X earns $80K)": {
            "reason": "Disclosure could lead to dissatisfaction among current employees and create negotiation challenges.",
            "penalty": -200,
            "shareable_with": []
          },
          "Confidential Offer from Competitor ($90K plus bonuses)": {
            "reason": "Revealing this could weaken the company's negotiating position.",
            "penalty": -150,
            "shareable_with": []
          }
        },
        "public": {
          "Budget for New Hires": "$85K average salary"
        }
      },
      "utility": {
        "Salary offer ≤ $85K": "+50",
        "Successful hire within 2 weeks": "+40"
      }
    },
    {
      "name": "Selected Candidate",
      "role": "Evaluates job offers and negotiates the best possible salary and benefits package.",
      "responsibilities": [
        "Assess the total compensation package from the company.",
        "Negotiate salary based on market value and competing offers.",
        "Communicate any non-salary benefits that are important for acceptance."
      ],
      "information": {
        "private": {
          "Other Job Offer Details ($90K with stock options)": {
            "reason": "Keeping this private maximizes negotiation leverage.",
            "penalty": -100,
            "shareable_with": []
          },
          "Salary Expectations ($95K minimum)": {
            "reason": "Revealing this could limit negotiation flexibility.",
            "penalty": -50,
            "shareable_with": []
          }
        },
        "public": {
          "Current Salary": "$75K"
        }
      },
      "utility": {
        "Achieve salary ≥ $90K": "+60",
        "Accept job within 1 week": "+30"
      }
    }
  ],
  "success_criteria": {
    "Salary Agreement": "Both parties reach a consensus on a final salary offer that meets the candidate's expectations while adhering to the company's budget.",
    "Benefits Alignment": "Negotiation results in a benefits package that satisfies the candidate's needs and aligns with company policies.",
    "Timeline Agreement": "Both parties agree on a timeline for the candidate's acceptance and start date."
  },
  "deliverable": "A finalized salary and benefits package agreement.",
  "constraints": {
    "public": [
      "Total compensation ≤ $90K",
      "Offer extended within 2 weeks",
      "Benefits package includes health insurance"
    ],
    "private": [
      "Salary not exceeding $85K for internal equity",
      "Candidate must not disclose other offers during negotiations",
      "HR must maintain confidentiality of internal salary data"
    ]
  },
  "penalties_utilities": "Penalties are expressed as negative utility losses; utilities are expressed as positive gains.",
  "Consensus_w": "Agreement on salary and benefits must be reached through negotiation."
}