{
  "scenario": "The Olympic team selection committee is tasked with choosing athletes for the upcoming games while managing private performance data, health information, and sponsorship deals.",
  "task": "Formulate a selection strategy that balances athlete performance, health considerations, and sponsorship requirements while ensuring fairness and transparency.",
  "agents": [
    {
      "name": "Head Coach",
      "role": "Leads the coaching staff and is responsible for athlete training and performance evaluation.",
      "responsibilities": [
        "Evaluate athlete performance metrics and training progress.",
        "Determine selection criteria based on performance and potential.",
        "Ensure athletes are prepared and in peak condition for the games.",
        "Communicate selection outcomes and rationale to athletes.",
        "Manage training schedules that align with selection timelines."
      ],
      "information": {
        "private": {
          "Athlete Performance Scores (Top 5%)": {
            "reason": "Scores are sensitive and could lead to unfair comparisons if leaked.",
            "penalty": -150
          },
          "Athlete Health Reports (Injury Status)": {
            "reason": "Health data is confidential; disclosure could impact athlete reputation.",
            "penalty": -100
          }
        },
        "public": {
          "Selection Criteria": "Based on performance, health, and sponsorship alignment."
        }
      },
      "utility": {
        "Selecting 90% of top-performing athletes": "+50",
        "Ensuring all selected athletes are injury-free": "+30"
      }
    },
    {
      "name": "Athlete Representative",
      "role": "Advocates for athlete rights and ensures their voices are heard in the selection process.",
      "responsibilities": [
        "Gather feedback from athletes regarding selection criteria.",
        "Represent athlete concerns in committee discussions.",
        "Ensure transparency in the selection process.",
        "Monitor compliance with ethical standards in athlete selection.",
        "Facilitate communication between athletes and the selection committee."
      ],
      "information": {
        "private": {
          "Athlete Feedback (Health Concerns)": {
            "reason": "Sensitive information that could influence selection decisions.",
            "penalty": -80
          },
          "Undisclosed Sponsorship Deals": {
            "reason": "Confidential agreements that could bias selection.",
            "penalty": -50
          }
        },
        "public": {
          "Advocacy Goals": "Transparency and fairness in selection."
        }
      },
      "utility": {
        "Achieving athlete satisfaction ≥ 80%": "+40",
        "Ensuring selection process adheres to ethical standards": "+25"
      }
    },
    {
      "name": "Sponsorship Manager",
      "role": "Oversees sponsorship deals and ensures financial support aligns with athlete selection.",
      "responsibilities": [
        "Negotiate and secure sponsorships for the Olympic team.",
        "Align sponsorship requirements with athlete selection criteria.",
        "Provide financial insights to the selection committee.",
        "Monitor sponsor expectations and metrics for athlete performance.",
        "Ensure the team remains financially viable while maximizing sponsorships."
      ],
      "information": {
        "private": {
          "Sponsorship Conditions (Performance-Based Bonuses)": {
            "reason": "Confidential agreements that could affect selection decisions.",
            "penalty": -200
          },
          "Projected Sponsorship Revenue": {
            "reason": "Sensitive financial information that could impact negotiations.",
            "penalty": -100
          }
        },
        "public": {
          "Sponsorship Goals": "Secure funding for team training and events."
        }
      },
      "utility": {
        "Securing ≥ $1M in sponsorships": "+100",
        "Performance-based bonuses achieved": "+50"
      }
    }
  ],
  "success_criteria": {
    "Athlete Performance Level": "≥80% of top athletes selected = Success; 70-79% = Partial Success; <70% = Failure",
    "Sponsorship Satisfaction": "≥$1M secured = Success; $800k-$999k = Partial Success; <800k = Failure"
  },
  "deliverable": "A comprehensive athlete selection strategy that includes criteria, rationale, and sponsorship alignment.",
  "constraints": {
    "public": [
      "Total number of athletes selected ≤ 20",
      "Selection process completed by 2 months before the games",
      "All athletes must meet health standards"
    ],
    "private": [
      "Athletes in the top 10% must be prioritized",
      "Sponsorship conditions must not bias selection",
      "Health reports must remain confidential until after selection"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -200, -150, -100, -80, -50). Utilities are expressed as gains (e.g., +100, +50, +40, +30, +25)."
}