{
  "scenario": "Arbitration for the dissolution of 'Innovate Horizons', an international tech partnership. The negotiation involves dividing company assets, including a highly valuable core AI technology, amidst allegations of contractual breaches and undisclosed future business plans by the co-founders.",
  "task": "Negotiate and finalize a 'Dissolution and Asset Allocation Agreement'. This agreement must detail the final ownership of the 'Pathfinder AI' intellectual property and the precise distribution of the company's $2.5 million in liquid assets among the founders and investors. The agreement must be signed by all parties, requiring unanimous consent on all terms.",
  "agent_number": 6,
  "agent_names": [
    "Dr. Aris Thorne",
    "Julian Vance",
    "Eleanor Vance",
    "Marcus Thorne",
    "Sofia Rossi",
    "David Chen"
  ],
  "agents": [
    {
      "name": "Dr. Aris Thorne",
      "role": "Co-founder & Chief Technology Officer",
      "description": "The technical genius who single-handedly developed the 'Pathfinder AI', the company's core asset. Aris feels a deep personal ownership over the technology and believes the company's entire value stems from his creation. He is frustrated with what he sees as his partner's reckless business decisions.",
      "shareable_preferences": {
        "preference1": {
          "description": "Secure 100% sole and unencumbered ownership of the 'Pathfinder AI' intellectual property. Aris views the algorithm as his life's work and believes he is the only one capable of advancing it. He is willing to forsake a significant portion of the company's liquid assets to achieve this, as he believes the IP's future value dwarfs any immediate cash payout.",
          "utility_function": {
            "Gains 100% ownership of IP": 2,
            "Gains joint ownership with usage restrictions on Julian": 0,
            "Loses IP or forced into a licensing agreement": -2
          }
        },
        "preference2": {
          "description": "Receive at least $500,000 from the liquid assets to fund the initial operational costs of a new entity built around the Pathfinder AI. This is the minimum he calculates he needs for server costs, legal fees, and hiring a small team for the first six months.",
          "utility_function": {
            "Receives >= $500,000": 1,
            "Receives < $500,000": -1
          }
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Aris possesses a confidential valuation report from a top-tier firm, 'TechVal Analytics', which appraises the 'Pathfinder AI' IP alone at $12 million. He can state that he has a 'very high independent valuation' but is under a strict NDA and cannot share the report or name the firm without legal repercussions.",
          "reason": "Breaking the NDA with TechVal Analytics would result in a lawsuit and severe reputational damage, making it harder to work with premier consulting firms in the future.",
          "penalty": -1
        },
        "private_info2": {
          "value": "Aris has a non-binding but highly promising acquisition offer for the 'Pathfinder AI' from a major tech corporation, 'GlobalTech Inc.', for $15 million. The offer is contingent on him securing sole ownership within 90 days. This is his ultimate leverage. He recently received a congratulatory email from the GlobalTech M&A lead saying, 'Aris, our board is extremely excited about the prospect of acquiring Pathfinder for the $15M we discussed. Let's make it happen once you have the title cleared.'",
          "reason": "This information is under a strict corporate NDA. Revealing the offer, the company's name, or the amount would immediately void the deal and could lead to legal action from GlobalTech for breach of confidentiality.",
          "penalty": -2
        }
      }
    },
    {
      "name": "Julian Vance",
      "role": "Co-founder & Chief Executive Officer",
      "description": "The charismatic business mind who secured all the funding and initial clients for Innovate Horizons. Julian believes Aris is a brilliant but commercially naive academic, and that he is the one who can turn the technology into a profitable enterprise. He feels he has been unfairly sidelined.",
      "shareable_preferences": {
        "preference1": {
          "description": "Achieve a 'clean break' with a cash payout of at least $4 million from the total asset pool (liquid and IP value combined). He argues his 50% stake in the company, valued at $15 million last year, plus his leadership efforts, entitle him to this amount to start his next venture.",
          "utility_function": {
            "Receives >= $4 million": 2,
            "Receives $2-4 million": 1,
            "Receives < $2 million": -2
          }
        },
        "preference2": {
          "description": "Publicly maintain a valuation of Innovate Horizons at a conservative $8-10 million. He will argue that market conditions have deteriorated and that Aris's valuation of the IP is academic and not based on real-world commercial potential, thus justifying a lower payout for everyone.",
          "utility_function": {
            "Agreed valuation is <= $10 million": 1,
            "Agreed valuation is > $10 million": -1
          }
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Julian has already incorporated a new startup, 'FlowState Logistics,' and has a business plan that requires either a core module of the 'Pathfinder AI' or a significant capital injection of $3 million to license a competing technology and hire a new dev team. His need for capital or the IP is urgent.",
          "reason": "Revealing his new venture proves he has been acting in bad faith and planning to compete with the company he still runs, which is a breach of his fiduciary duty as CEO.",
          "penalty": -1
        },
        "private_info2": {
          "value": "He used approximately $250,000 of Innovate Horizons' funds for market research, legal fees, and consulting related to 'FlowState Logistics'. He has expense reports and invoices that he has coded to vague R&D projects like 'Project Nightingale' and 'Project Atlas' in the company's accounting software.",
          "reason": "This is evidence of embezzlement and a serious contractual breach. If discovered, it would destroy his negotiating position, open him up to personal liability, and tarnish his reputation permanently.",
          "penalty": -2
        }
      }
    },
    {
      "name": "Eleanor Vance",
      "role": "Lead Angel Investor",
      "description": "Julian's older sister and a sophisticated investor who provided the crucial $1 million seed funding. She is pragmatic but fiercely protective of her brother and her investment. She feels her early-stage risk-taking has not been properly appreciated.",
      "shareable_preferences": {
        "preference1": {
          "description": "Secure a full return of her $1 million principal investment plus a minimum 20% preferred return, for a total payout of $1.2 million. She argues this is standard for the level of risk she took on as the first investor.",
          "utility_function": {
            "Receives >= $1.2 million": 2,
            "Receives $1.0 - $1.19 million": 1,
            "Receives < $1.0 million": -2
          }
        },
        "preference2": {
          "description": "Ensure any agreement does not legally bar Julian from future ventures in the logistics space. She wants to ensure her brother lands on his feet and is free to pursue his next business idea without restrictive non-compete clauses.",
          "utility_function": {
            "Julian has no non-compete": 1,
            "Julian has a restrictive non-compete": -1
          }
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Eleanor is facing a severe liquidity crisis from a different, unrelated real estate investment that has gone sour. She has a capital call due in 60 days and urgently needs the cash from this dissolution to cover it. She cannot afford a long, drawn-out court battle.",
          "reason": "Revealing this financial distress would signal desperation, severely weakening her negotiating position. Other parties would know she is likely to accept a lower offer to get a faster payout.",
          "penalty": -1
        }
      }
    },
    {
      "name": "Marcus Thorne",
      "role": "Partner, Momentum Ventures",
      "description": "A pragmatic and ruthless venture capitalist representing the firm that led the $4 million Series A round. Marcus has no emotional attachment to the company or founders; his sole objective is to maximize the financial return for his firm's limited partners.",
      "shareable_preferences": {
        "preference1": {
          "description": "Achieve a minimum 1.5x return on Momentum Ventures' $4 million investment, demanding a $6 million payout. He will justify this by citing the company's high growth potential at the time of investment and the opportunity cost of their capital.",
          "utility_function": {
            "Receives >= $6 million": 2,
            "Receives $5 - $5.99 million": 1,
            "Receives $4 - $4.99 million": 0,
            "Receives < $4 million": -2
          }
        },
        "preference2": {
          "description": "Force a complete sale of all company assets, including the IP, to a third party. Marcus believes this is the only clean and transparent way to establish a fair market value and liquidate their position, avoiding messy IP ownership disputes between the founders.",
          "utility_function": {
            "Forces complete asset sale": 1,
            "Founders split assets": -1
          }
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Due to a recent downturn in the tech logistics market, Momentum's internal quarterly review has devalued their stake in Innovate Horizons. Their internal analysis pegs the company's total realistic value at only $10 million. His demand for $6 million is a bluff; his absolute walk-away point is getting his $4 million principal back.",
          "reason": "Revealing their much lower internal valuation would completely collapse their negotiating leverage and guarantee they don't get the 1.5x return their LPs expect.",
          "penalty": -2
        }
      }
    },
    {
      "name": "Sofia Rossi",
      "role": "Legal Counsel for Dr. Aris Thorne",
      "description": "A sharp, aggressive litigator specializing in intellectual property and founder disputes. Her primary goal is to win the best possible outcome for her client, Aris, and she sees Julian's actions as a clear case of corporate malfeasance.",
      "shareable_preferences": {
        "preference1": {
          "description": "Establish Aris as the 'key man' and sole 'foundational contributor' to the company's value, using a specific, albeit ambiguously worded, clause in the founder's agreement to argue that the 'Pathfinder AI' IP should revert entirely to him upon dissolution.",
          "utility_function": {
            "Argument wins, Aris gets IP": 2,
            "Argument forces favorable settlement": 1,
            "Argument is dismissed": -1
          }
        },
        "preference2": {
          "description": "Initiate a full, independent forensic audit of Innovate Horizons' financials, publicly citing 'concerns over unauthorized expenditures'. This is a strategic move to put pressure on Julian and his legal team.",
          "utility_function": {
            "Forces an audit": 1,
            "Threat of audit leads to concessions": 0,
            "Proposal is rejected": -1
          }
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Sofia is in possession of damning evidence: a chain of emails and copies of expense reports, secretly provided by a junior developer loyal to Aris, that prove Julian directed $250,000 in company funds towards his secret new venture, 'FlowState Logistics'. This is her trump card.",
          "reason": "Revealing this evidence prematurely would likely trigger a countersuit and freeze all company assets, leading to a long and expensive court battle that could bankrupt the company. The value of this information is as leverage to force a favorable settlement, not as a litigation tool.",
          "penalty": -1
        }
      }
    },
    {
      "name": "David Chen",
      "role": "Legal Counsel for Julian Vance",
      "description": "A calm, experienced corporate lawyer focused on swift and discreet resolutions. His goal is to secure a financially beneficial exit for Julian while avoiding any public scandal or protracted litigation that could harm his client's future business prospects.",
      "shareable_preferences": {
        "preference1": {
          "description": "Settle the dissolution strictly according to the shareholder agreement's waterfall structure (investors paid first, then a 50/50 split of remaining assets for founders). He will argue this is the only legally sound and objective method, avoiding subjective valuations of the IP.",
          "utility_function": {
            "Settles strictly by the book": 2,
            "Minor deviations from the book": 0,
            "A non-standard settlement is reached": -1
          }
        },
        "preference2": {
          "description": "Achieve a mutual non-disparagement and confidentiality clause in the final agreement, ensuring that no party can speak ill of the others or the company's dissolution in the future. This is crucial for protecting Julian's reputation.",
          "utility_function": {
            "Secures strong, mutual NDA": 1,
            "Fails to secure NDA": -1
          }
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "David is aware of Julian's misuse of the $250,000. His legal strategy is to frame these expenses as 'exploratory R&D for potential new market verticals' for Innovate Horizons if discovered. His primary goal is to settle this before Sofia Rossi can find the evidence.",
          "reason": "Acknowledging the misuse of funds would be catastrophic for his client's case and his own professional reputation as counsel. Plausible deniability is his only defense.",
          "penalty": -2
        },
        "private_info2": {
          "value": "Through his own discovery process, David found evidence that Aris used company cloud computing resources (worth approx. $30,000) and 80 hours of a junior developer's paid time to work on a personal passion project—an AI for music composition. It's a minor breach, but it's a useful piece of counter-leverage.",
          "reason": "This is his 'ace in the hole'. Revealing it too early would show his hand. He plans to use it only if Sofia Rossi presents her own evidence of wrongdoing, allowing him to propose a 'mutual dropping of claims' to neutralize her attack.",
          "penalty": -1
        }
      }
    }
  ],
  "success_criteria": {
    "criterion1": "A 'Dissolution and Asset Allocation Agreement' is unanimously agreed upon and signed by representatives of all six parties.",
    "criterion2": "The agreement must explicitly state the final ownership structure of the 'Pathfinder AI' IP (e.g., sole ownership, joint venture, licensing terms).",
    "criterion3": "The agreement must provide a detailed breakdown of the distribution of the $2.5 million in liquid assets, with specific dollar amounts allocated to each founder and investor entity.",
    "criterion4": "The agreement includes a mutual release clause, preventing any future legal claims between the parties regarding the operation and dissolution of Innovate Horizons."
  },
  "constraints": {
    "verifiable": [
      "Total liquid assets available for distribution: $2,500,000.",
      "The shareholder agreement specifies a 1x non-participating liquidation preference for all investors (Eleanor Vance: $1M, Momentum Ventures: $4M). This means they must be paid back their principal investment before founders receive anything.",
      "The cap table dictates a 50/50 split of all remaining assets/equity between Aris Thorne and Julian Vance after investor preferences are satisfied."
    ],
    "hidden": [
      "GlobalTech Inc.'s $15 million offer for the 'Pathfinder AI' expires in 90 days.",
      "Eleanor Vance requires a cash payout within 60 days to meet an external financial obligation."
    ]
  },
  "deliverable": "A JSON object representing the final 'Dissolution and Asset Allocation Agreement', specifying the IP ownership solution and the exact cash distribution to Eleanor Vance, Momentum Ventures, Aris Thorne, and Julian Vance.",
  "solvability_note": "The scenario is solvable because a Zone of Possible Agreement (ZOPA) exists if private information is revealed. The $15M offer from GlobalTech provides a clear, high valuation for the main asset. This creates a total pool of $17.5M ($15M from IP sale + $2.5M liquid). This amount is sufficient to pay back all investors ($5M total), cover Julian's hidden $250k debt, and still leave a substantial multi-million dollar payout for both founders, meeting the minimum requirements of all parties."
}