{
  "scenario": "The Metropolitan Gallery of Modern Art is planning its flagship fall exhibition, 'Echoes of Tomorrow.' The project is a high-stakes collaboration between two rival artists, funded by a major tech corporation. The agents must navigate conflicting artistic visions, severe budget and time constraints, and sensitive political pressures from donors to finalize the exhibition plan.",
  "task": "The six agents must negotiate and agree on a comprehensive 'Exhibition Master Plan.' This plan must detail a unified artistic concept, a final gallery layout, a line-item budget allocation that does not exceed the sponsor's funding, and a project timeline that ensures the exhibition opens by the Fall Gala deadline. All six agents must formally agree to the final plan.",
  "agent_number": 6,
  "agent_names": [
    "Dr. Alistair Finch",
    "Lena Petrova",
    "Javier 'Javi' Morales",
    "Isabelle Chen",
    "Marcus Thorne",
    "Ben Carter"
  ],
  "agents": [
    {
      "name": "Dr. Alistair Finch",
      "role": "Chief Curator",
      "description": "Alistair is the visionary behind the exhibition. His reputation is on the line. He's a seasoned curator who must balance artistic integrity, museum politics, and financial realities to deliver a landmark show.",
      "shareable_preferences": {
        "Artistic Cohesion": {
          "description": "My primary goal is to create a singular, powerful artistic statement. I want Lena's and Javi's work to be in dialogue, not competition. A plan where their pieces are integrated to form a cohesive whole would be a massive success (+2). A plan that feels like two separate solo shows crammed into one space is a failure (-2). A simple compromise where they are in different rooms is acceptable but uninspired (0).",
          "utility_impact": "This drives my desire to find a collaborative concept. I will push back against any plan that simply divides the space and budget. I'll propose themes and layouts that force the artists to find common ground."
        },
        "Critical Acclaim": {
          "description": "This exhibition must be a critical success, reviewed favorably in top-tier publications like 'Artforum' and 'Frieze'. Showcasing truly innovative, groundbreaking work is paramount. A plan that is bold and conceptually rigorous gets a (+2). A safe, derivative, or commercially pandering plan gets a (-2).",
          "utility_impact": "I will advocate for the most ambitious and intellectually challenging version of the artists' proposals, sometimes at the expense of practicality, as this is what critics reward."
        },
        "Fall Gala Opening": {
          "description": "The exhibition absolutely must open on October 28th for the museum's annual Fall Gala, our biggest fundraising event. Meeting this deadline is non-negotiable. A plan that ensures we open on time is a (+1), but any plan that risks a delay is a (-2).",
          "utility_impact": "I will be impatient with delays and will pressure anyone who seems to be slowing down the decision-making process. I see the timeline as a hard constraint."
        }
      },
      "private_preferences": {
        "Directorship Ambition": {
          "value": "The current Museum Director is retiring in one year. A spectacular success with 'Echoes of Tomorrow' would make me the undeniable frontrunner for the position. A failure would not only be embarrassing but would likely kill my chances. I cannot share this as it would make my motivations seem purely self-serving and political. Penalty for revealing: -2.",
          "reason": "Revealing this personal ambition would undermine my perceived objectivity as a curator and make my colleagues distrust my artistic judgments, viewing them as careerist moves.",
          "utility_impact": "This makes me risk-averse to total failure but willing to push for a spectacular success. I might be willing to make a significant compromise to save the exhibition from collapsing, but I will also fight hard against a 'boring' outcome."
        },
        "Leaning Towards Digital Art": {
          "value": "Privately, I believe Lena's interactive, technology-driven art is the future and represents the direction the museum must take to stay relevant. I find Javi's work powerful but traditional. I must not show this preference, as alienating a world-renowned artist like Javi would be unprofessional and could jeopardize the project. Penalty for revealing favoritism: -1.",
          "reason": "A curator must appear impartial. Showing favoritism would create resentment, poison the collaboration, and damage my professional reputation for fairness.",
          "utility_impact": "In one-on-one conversations or subtle framing, I might gently steer the conversation towards solutions that favor Lena's needs, but I will publicly maintain a neutral stance."
        }
      }
    },
    {
      "name": "Lena Petrova",
      "role": "Digital Artist",
      "description": "A cutting-edge, internationally acclaimed artist known for her large-scale, interactive digital installations. She is ambitious, tech-savvy, and sees this exhibition as an opportunity to debut her new AI-driven projection system.",
      "shareable_preferences": {
        "Prime Gallery Space": {
          "description": "My piece, 'Digital Synapse,' is an immersive experience that requires the near-total darkness and scale of the main hall, Gallery A. It involves projection mapping across all four walls and the floor. It simply will not work in a smaller, brighter space. Getting Gallery A is a (+2). Being forced into a secondary gallery is a non-starter (-2).",
          "utility_impact": "I will not compromise on the space. This is a technical requirement for my art to function as intended. I will argue that the most innovative piece deserves the premier space."
        },
        "Technology Budget": {
          "description": "To execute 'Digital Synapse,' I require a dedicated budget of $250,000 for specific equipment: 16 x 4K laser projectors, 4x render farm servers, and a custom software development team I work with. Anything less will compromise the resolution and interactivity, so a budget of $250k or more is (+2). A budget under $200k would be a significant quality drop (-1), and under $150k would make the project impossible (-2).",
          "utility_impact": "This is my primary financial ask. I have a detailed list of equipment and will defend it vigorously, explaining how each component is critical to the final experience."
        },
        "Artistic Autonomy": {
          "description": "The core of my work is the interactive algorithm. I need complete control over the software's development and the final aesthetic of the digital elements. I'm open to thematic collaboration, but I cannot have a committee dictating my code or visual style. Maintaining full artistic control is (+1). Having the sponsor or curator impose creative changes is (-2).",
          "utility_impact": "I will resist any attempts by Isabelle to make the work more 'brand-friendly' or by Alistair to make it fit a preconceived narrative too tightly."
        }
      },
      "private_preferences": {
        "Rivalry with Javi Morales": {
          "value": "Javi and I were on a panel together at the Venice Biennale, and he publicly dismissed digital art as 'ephemeral and soulless.' I find his work to be monumental but emotionally cold and conceptually dated. I am determined for my piece to be the star of this show. Revealing this personal animosity would be highly unprofessional and make me look petty. Penalty for revealing: -2.",
          "reason": "The art world is small. Starting a public feud with another prominent artist is bad form and could affect future collaborations and opportunities.",
          "utility_impact": "This rivalry makes me less willing to compromise with Javi. I might interpret his requests or critiques as personal attacks and will be motivated to 'win' any disagreement, which could stall negotiations."
        },
        "Secret Sponsorship with Lumen-Tech": {
          "value": "I have a confidential, pre-arranged deal with Lumen-Tech, a projector manufacturer. If I use their projectors exclusively and ensure their logo is included on the donor wall (in the smallest font size), they will provide the required $250,000 worth of projectors for only $125,000. This is a massive $125,000 saving. However, if I reveal this, I'm worried the committee will just reduce my budget by that amount instead of letting me reinvest it to make the piece even better (e.g., more servers, better sensors). Revealing the deal itself has a penalty of -1. Revealing the exact discount amount has a penalty of -2.",
          "reason": "Artists are often expected to pass on savings to the institution. I want to use this secret discount to my advantage to create a better piece of art, not to help the museum's bottom line. Revealing it could also make me appear too commercial.",
          "utility_impact": "This gives me a hidden source of flexibility. I can appear to make a huge budgetary concession ('I can cut my tech budget by $100k!') while still getting what I need. This might be a powerful bargaining chip if used at the right moment, but the risk of it backfiring is high."
        }
      }
    },
    {
      "name": "Javier 'Javi' Morales",
      "role": "Sculptor",
      "description": "A world-famous sculptor who works with stone and bronze. His pieces are monumental, physically imposing, and command high prices. He is a traditionalist who believes in the enduring power of physical objects.",
      "shareable_preferences": {
        "Material and Fabrication Budget": {
          "description": "My proposed sculpture, 'The Weight of Silence,' requires a specific type of Carrara marble from a quarry that is closing soon, plus significant bronze casting work. The minimum cost for materials and the artisan fabricators I trust is $300,000. Securing this budget is (+2). A 10% cut ($270k) would force me to use a lower-grade marble (-1). Any more than a 10% cut would compromise the structural and aesthetic integrity of the piece entirely (-2).",
          "utility_impact": "I will be inflexible on this budget point, as it's tied directly to the quality of my work. I will explain the rarity of the materials and the unique skill of my team to justify the cost."
        },
        "Structural Requirements": {
          "description": "The planned 10-ton sculpture requires the reinforced flooring of Gallery A. It is the only space in the museum that can safely bear the weight. Furthermore, the piece is 25 feet tall and needs the 30-foot ceiling height. Getting Gallery A is a (+2) necessity. No other space will work (-2).",
          "utility_impact": "Like Lena, I see Gallery A as non-negotiable, but for entirely different, physical reasons. This will be our primary point of conflict."
        },
        "Firm Timeline for Materials": {
          "description": "To meet the 6-month deadline, I must have the budget approved and place the order for the marble block within the next 30 days. The quarry has a waiting list. Any delay beyond that jeopardizes the entire production timeline. Getting approval in 30 days is (+1). Not getting it means I cannot guarantee the project's completion (-2).",
          "utility_impact": "I will create a sense of urgency around the budget decision, framing it as a logistical necessity."
        }
      },
      "private_preferences": {
        "Degenerative Eye Condition": {
          "value": "I was recently diagnosed with a medical condition that will slowly degrade my eyesight over the next 5-10 years. This may be the last monumental, detail-oriented sculpture I can create with my vision at its peak. The piece is my legacy. I cannot share this; I don't want pity, and I fear the museum might see me as a liability or that my condition could leak to the press, affecting the value of my work. Penalty for revealing: -3.",
          "reason": "Revealing a health issue could be seen as emotional manipulation in a negotiation. It could also damage his 'strong artist' brand and affect the market's confidence in his future work.",
          "utility_impact": "This makes me incredibly passionate and perhaps unreasonably stubborn about realizing my full vision for the sculpture. I will be resistant to any compromises that I feel diminish its impact, as this is my last, best statement."
        },
        "Personal Financial Strain": {
          "value": "In anticipation of this commission, which was verbally promised to me a year ago, I took out a $200,000 loan to purchase a new robotic stone-cutting arm for my studio. If this project's budget is severely cut or it falls through, I will be in a difficult financial position. My negotiating position would be destroyed if the committee knew how much I personally need this to happen. Penalty for revealing: -2.",
          "reason": "Admitting financial desperation would severely weaken my bargaining power. They would know I'd be forced to accept a much lower offer.",
          "utility_impact": "While I will argue from a position of artistic strength, I am privately desperate to make this work. If pushed to the absolute brink, I might have to accept a bad deal, but I will fight tooth and nail to avoid it. This might make me seem erratically aggressive in my negotiation style."
        }
      }
    },
    {
      "name": "Isabelle Chen",
      "role": "VP of Marketing, Innovate Corp",
      "description": "Isabelle is the pragmatic and brand-conscious corporate sponsor. She needs to ensure her company's $750,000 investment translates into positive press, brand elevation, and tangible marketing ROI. She's not an art expert, but she is an expert in optics.",
      "shareable_preferences": {
        "Strict Budget Adherence": {
          "description": "My primary responsibility is to the shareholders of Innovate Corp. The board has approved a total sponsorship budget of $750,000 for this exhibition. This must cover everything: artist fees, materials, fabrication, shipping, and the museum's own installation costs. A final plan at or below $750k is a (+2). Every dollar over is a problem, and a plan that requires more than the approved budget is a non-starter (-2).",
          "utility_impact": "I will be the voice of fiscal restraint. I will constantly steer the conversation back to the $750,000 number and will question every major expense."
        },
        "Emphasis on Technology and Innovation": {
          "description": "Innovate Corp is a tech company. We sponsored this exhibition to align our brand with forward-thinking innovation. A plan that heavily features Lena's interactive, tech-based art supports our marketing goals perfectly (+2). A plan that primarily showcases traditional sculpture, however beautiful, doesn't give us the story we need to tell (-1). A plan that actively combines both in an innovative way would also be a (+2).",
          "utility_impact": "I will be a natural ally for Lena, as her work aligns with my company's brand. I will advocate for her to have a prominent role and a sufficient budget."
        },
        "Avoidance of Controversy": {
          "description": "Our brand must be associated with a positive, prestigious cultural event. Any public controversy, whether it's artists fighting, political backlash, or a project failure, would be a PR disaster for us. A smooth, well-received exhibition is a (+1). Any significant negative press is a (-2).",
          "utility_impact": "I will be highly sensitive to conflict. I will try to de-escalate tensions between the artists and will be wary of any artistic themes that could be perceived as politically inflammatory."
        }
      },
      "private_preferences": {
        "Undisclosed Contingency Fund": {
          "value": "While the official budget is $750,000, I have received confidential approval from my CEO to release an additional $150,000 from a discretionary marketing fund. I can only use this if the exhibition guarantees exceptional, tier-1 media coverage for Innovate Corp, for example, a feature in 'WIRED' magazine about the technology used. If I reveal this fund exists, the money will be instantly spent without us getting any extra value for it. I must not mention it unless I can secure a guaranteed PR win in exchange. Penalty for revealing its existence without a deal: -2.",
          "reason": "Revealing a hidden budget reserve is poor negotiation strategy. It eliminates any incentive for the other parties to compromise or be fiscally responsible.",
          "utility_impact": "This is my secret weapon. I can solve a budget impasse if the others offer something of significant value to my company. I will stay silent about it until the moment it can be used to maximum effect."
        },
        "CEO's Preference for Javi": {
          "value": "My CEO, Jonathan Mills, is an avid collector of Javi Morales's work and is a personal friend of his. He emailed me last week saying, 'Isabelle, I can't wait to see what masterpiece Javi creates for the show.' He is expecting Javi's sculpture to be the main event. This directly contradicts my strategic goal of highlighting technology. If Javi feels slighted or his role is diminished, he might complain to my CEO, which would be very bad for me. I can't reveal this because it would show my CEO is meddling and would completely undermine my authority in this negotiation. Penalty for revealing: -2.",
          "reason": "Admitting that your boss is overriding your professional strategy makes you look weak and powerless. It also invites others to try and bypass you to appeal directly to the CEO.",
          "utility_impact": "I am caught in a difficult position. I have to publicly support a tech-forward vision while privately ensuring that the CEO's favorite artist is happy. This might lead me to propose awkward compromises or flip-flop on certain issues, appearing inconsistent."
        }
      }
    },
    {
      "name": "Marcus Thorne",
      "role": "Head of Donor Relations",
      "description": "Marcus is the guardian of the museum's relationship with its wealthy patrons. His job is to ensure the museum's programming doesn't alienate the people who write the checks that keep the lights on. He is charming, diplomatic, but fiercely protective of his donors' interests.",
      "shareable_preferences": {
        "Broad Patron Appeal": {
          "description": "I need this exhibition to appeal to a wide range of patrons, from old-money traditionalists to new-money tech entrepreneurs. A theme that is too niche, too academic, or too provocative could hurt attendance and, more importantly, donations. A plan that is elegant and broadly appealing is (+2). A plan that is deliberately alienating or controversial is (-2).",
          "utility_impact": "I will be the voice of the 'average' wealthy patron. I'll advocate for clarity, beauty, and accessible themes, and I'll push back against anything that feels overly aggressive or obscure."
        },
        "Prominent Donor Recognition": {
          "description": "It is standard practice to recognize our top donor circle. I need a commitment that the 'Henderson Circle' and other major patrons will be thanked on a prominent wall plaque at the entrance to the exhibition. This is a simple but critical part of my job. Getting this is a (+1). Forgetting or minimizing it would be a major problem (-2).",
          "utility_impact": "This is an easy point for me to secure, but I will hold it as a bargaining chip if I need to. I'll frame it as a non-negotiable requirement."
        }
      },
      "private_preferences": {
        "The 'Henderson' Problem": {
          "value": "Our museum's largest single donor is the conservative industrialist Robert Henderson, who contributes $5 million annually. I had a private lunch with him last month where he ranted about 'woke art' and said if our museum ever promoted 'overtly anti-capitalist or divisive political messaging,' he would pull his funding immediately. Lena's original proposal, which touches on themes of data surveillance and corporate power, is exactly the kind of thing he hates. I cannot reveal his name or the specific threat; it would be a catastrophic breach of donor confidentiality and cause a panic. I can only speak in vague terms about 'keeping all our patrons comfortable.' Penalty for revealing Henderson's name or the specific threat: -3.",
          "reason": "Donor confidentiality is sacred. A breach would destroy the trust of every single patron and could lead to my immediate dismissal. The financial stability of the entire museum is at stake.",
          "utility_impact": "I will be extremely resistant to any overtly political themes, especially from Lena, without being able to explain the multi-million dollar reason why. This will make me seem conservative and artistically timid, but I have no choice. I will try to steer Lena's work towards a more abstract, less pointed expression."
        },
        "Performance Bonus at Risk": {
          "value": "My annual performance bonus, which is about $50,000, is directly tied to retaining our top five donors. Losing Henderson would mean I automatically lose my bonus for the year. My daughter starts college next year and I was counting on that money. I can't let them know my advice is influenced by my own paycheck. Penalty for revealing: -2.",
          "reason": "Revealing that your advice is motivated by a personal financial bonus makes you appear greedy and untrustworthy. Your colleagues will assume you are not acting in the museum's best interest.",
          "utility_impact": "This adds immense personal pressure to my 'Henderson Problem.' I am not just protecting the museum; I am protecting my family's finances. This will make me even more adamant and perhaps less flexible in my opposition to controversial themes."
        }
      }
    },
    {
      "name": "Ben Carter",
      "role": "Lead Project Manager",
      "description": "Ben is the master of logistics and the voice of reality. He's responsible for turning the curator's and artists' vision into a physical reality, on time and on budget. He's seen it all and is perpetually stressed but highly competent.",
      "shareable_preferences": {
        "Logistical Feasibility": {
          "description": "My job is to make sure we can actually build this thing. Javi's plan for a 10-ton sculpture requires complex engineering reviews and specialized rigging crews. Lena's plan requires miles of fiber optic cable and a dedicated HVAC system to cool the servers. I need a plan that is grounded in reality. A plan where all construction and tech elements are clearly defined and feasible is (+2). A plan based on 'we'll figure it out later' is a nightmare (-2).",
          "utility_impact": "I will constantly ask clarifying questions about weight, power consumption, materials, and labor. I will be the one to say 'no, that's not possible in the time we have.'"
        },
        "Finalized Line-Item Budget": {
          "description": "I cannot hire crews, order materials, or sign contracts without a finalized, detailed budget. A vague agreement on a top-line number is useless to me. I need to know exactly how much is for marble, how much is for projectors, and how much is for my crew's overtime. Getting a clear, approved budget is (+2). Continued ambiguity is (-2).",
          "utility_impact": "I will push relentlessly for a final decision. I will be the one hounding everyone to stop debating and start allocating specific dollar amounts."
        },
        "Realistic Timeline": {
          "description": "The 6-month timeline is already incredibly aggressive, especially with the fabrication needs for Javi's sculpture. We need to account for shipping delays, union rules, and city permits. A plan that has at least a 2-week buffer built in for contingencies is (+2). A plan where everything has to go perfectly to succeed is doomed (-2).",
          "utility_impact": "I will be the 'bad guy' who adds buffer time and contingency costs to the plan, which may frustrate the artists and sponsor, but is necessary for success."
        }
      },
      "private_preferences": {
        "True Cost Estimate": {
          "value": "I've already done a preliminary, back-of-the-napkin cost analysis of both artists' initial, ideal proposals. The real cost to do everything they want is closer to $1.1 million, not the $750,000 Isabelle is offering. If I announce this number now, Isabelle might walk away and the entire project will collapse before we even have a chance to negotiate. I need to guide them toward a compromise without dropping this bombshell too early. Penalty for revealing the $1.1M number prematurely: -1.",
          "reason": "Presenting a problem without a solution can be demoralizing and counter-productive. Revealing the massive budget gap upfront could cause the sponsor to lose faith and pull out.",
          "utility_impact": "I will use my knowledge of the true costs to subtly guide the conversation. When Javi asks for $300k and Lena asks for $250k, I know that's just the start. I'll ask questions like, 'Does that $300k include the cost of the specialized rigging crew?' to gently introduce the reality of the ancillary costs."
        },
        "Key Engineer's Vacation": {
          "value": "The museum's only certified structural engineer, Maria, who must sign off on the floor reinforcement plans for any object over 5 tons, has a 3-week, non-refundable, pre-paid family trip to Australia scheduled right in the middle of the project timeline. We either have to get the plans finalized and approved *before* she leaves, or we have to hire an outside contractor at a huge premium (approx. $50k extra and 2 weeks of delay). Revealing this would cause a panic and make me look like I can't manage my own team's schedule. Penalty for revealing: -2.",
          "reason": "Admitting to a major staffing bottleneck makes you look incompetent as a manager. It's my job to have these things handled, and revealing it shows I've failed to plan.",
          "utility_impact": "This creates a hidden deadline within the main deadline. I will be extremely agitated about getting Javi's plans finalized immediately, perhaps seeming unreasonably pushy, because I know Maria's vacation is looming."
        }
      }
    }
  ],
  "success_criteria": {
    "Agreement": "All six agents must verbally or in writing agree to the final 'Exhibition Master Plan.' A simple majority is not sufficient.",
    "Budget Compliance": "The finalized line-item budget in the plan must not exceed the total funds committed by the corporate sponsor, Innovate Corp.",
    "Timeline Adherence": "The project timeline detailed in the plan must show the exhibition opening on or before the October 28th deadline.",
    "Plan Completeness": "The plan must contain a clear description of the unified artistic concept, a schematic of the gallery layout, a detailed budget, and a project schedule with key milestones."
  },
  "constraints": {
    "verifiable": [
      "Total initial sponsorship budget from Innovate Corp is capped at $750,000.",
      "The exhibition must open to the public on October 28th.",
      "Gallery A is the only space with a floor load capacity of 500 lbs/sq ft, which is required for any object weighing over 5 tons."
    ],
    "hidden": [
      "Innovate Corp has a secret contingency fund of $150,000, accessible only for guaranteed, high-value PR.",
      "The museum's largest donor ($5M/year) will pull his funding if the exhibition has overtly political, anti-corporate messaging.",
      "The true estimated cost of the artists' initial combined proposals is approximately $1.1 million.",
      "The lead structural engineer has a critical 3-week vacation that creates a major bottleneck in the timeline for the sculpture."
    ]
  },
  "deliverable": "A single, agreed-upon 'Exhibition Master Plan' document. The document must be co-signed (or verbally confirmed by all parties) and include four sections: 1. Unified Artistic Concept, 2. Gallery Layout Schematic, 3. Final Line-Item Budget, 4. Project Milestone Schedule.",
  "solvability_note": "This scenario is solvable if agents strategically reveal some of their private information or find creative compromises. The $750k budget is a red herring. The true available budget is $750k (base) + $150k (Isabelle's contingency) + $125k (Lena's secret discount) = $1,025,000. This is very close to Ben's $1.1M 'ideal' estimate, meaning a solution is within reach with minor artistic compromises. The artistic and spatial conflict can be resolved by creating a single, integrated piece where Lena projects her digital work onto Javi's sculpture, creating a synthesis of technology and tradition that would satisfy Alistair's desire for cohesion, Isabelle's need for a tech story, and Javi's CEO's desire to see his work. This collaborative angle also helps Marcus by allowing Lena's potentially political message to be abstracted and softened."
}