{
  "scenario": "Annual Residency Program Development and Budget Allocation at Grandview Medical Center",
  "task": "A committee of five key stakeholders must decide on the allocation of a $500,000 discretionary budget for residency program development for the upcoming academic year. The key agenda items are: a capital request for new surgical equipment, a funding request for internal medicine curriculum reform, a new policy proposal for resident research time, and a proposal to create a new, specialized fellowship. The final plan must be formalized in a signed memorandum of understanding.",
  "agent_number": 5,
  "agent_names": [
    "Dr. Evelyn Reed",
    "Dr. Marcus Thorne",
    "Dr. Lena Petrova",
    "Dr. Ben Carter",
    "Dr. Anya Sharma"
  ],
  "agents": [
    {
      "name": "Dr. Evelyn Reed",
      "role": "Chief Financial Officer (CFO)",
      "description": "A seasoned hospital administrator with 20 years of experience, Dr. Reed's primary responsibility is the long-term financial stability of Grandview Medical Center. She is pragmatic, data-driven, and answers directly to the hospital's Board of Directors. She views all requests through the lens of return on investment and risk mitigation.",
      "shareable_preferences": {
        "Fiscal Conservatism": {
          "description": "Wishes to allocate no more than $250,000 of the $500,000 discretionary fund. She wants to preserve the remaining $250,000 for a critical, hospital-wide Electronic Medical Record (EMR) system upgrade scheduled for Q4, which she believes will improve efficiency and patient safety far more than any single department's initiative. She requires any approved funding to have a projected positive ROI within three years.",
          "utility_impact": "Keeping the allocation under $250k (+2). Allocation between $251k-$400k (0). Allocation over $400k (-1). Spending the entire $500k (-2)."
        },
        "Standardized Investment": {
          "description": "Prefers to fund broad, hospital-wide initiatives over niche, single-person, or hyper-specialized departmental projects. She believes creating one-off programs is inefficient and sets a difficult precedent for future requests. She would much rather fund something like a new simulation lab that all residents can use, rather than a fellowship for one person.",
          "utility_impact": "Funding a hospital-wide project (+1). Funding a large departmental project (0). Funding a small, specialized fellowship for a single resident (-1)."
        }
      },
      "private_preferences": {
        "Secret Strategic Fund": {
          "value": "Dr. Reed has control over a separate, off-budget 'Strategic Opportunity Fund' containing $300,000, known only to herself and the CEO. This fund is reserved for emergencies or unique opportunities to advance the hospital's market position. She can share that 'alternative funding streams may be explored for truly exceptional circumstances' (penalty: 0), but revealing the existence or exact amount of the fund would open a floodgate of requests from every department, undermining her control. Penalty for revealing the fund's name or specific amount: -1.5.",
          "reason": "Maintaining fiscal control and strategic flexibility. Revealing the fund would lead to endless political battles for the money.",
          "utility_impact": "This fund is her ace in the hole. She can solve a critical problem without compromising her stated goal of preserving the main discretionary budget. Using it demonstrates her strategic value to the CEO."
        },
        "Board Pressure": {
          "value": "She just received an email from the Chairman of the Board congratulating her on the hospital's strong Q2 performance, but ending with a clear directive: 'Given the uncertain economic outlook, we expect you to reduce discretionary spending by at least 20% compared to last year's approved budget.' Last year's budget was $625,000, so a 20% cut means she is under pressure to spend no more than $500,000 in total, making her extremely reluctant to tap into her secret fund unless absolutely necessary. Revealing this directive would make her appear weak and unable to advocate for the hospital's needs. Penalty: -1.",
          "reason": "Protecting her reputation and authority with her peers. She cannot appear to be a simple mouthpiece for the board.",
          "utility_impact": "This pressure is the primary driver for her 'Fiscal Conservatism' preference. It forces her to be the 'bad guy' in the negotiation, as approving a large budget would be a direct violation of the board's directive."
        }
      }
    },
    {
      "name": "Dr. Marcus Thorne",
      "role": "Chair of the Department of Surgery",
      "description": "Ambitious, charismatic, and highly competitive, Dr. Thorne has transformed the surgery department into a major revenue generator for the hospital. He believes that 'the best defense is a good offense' and is constantly pushing for the latest technology to attract top-tier talent and high-margin clinical cases.",
      "shareable_preferences": {
        "Acquire New Surgical Robot": {
          "description": "He is requesting $350,000 from the discretionary fund to purchase the new 'Artemis' robotic surgery system. He argues this will enable a 15% increase in complex surgical cases, attract nationally-recognized surgical residents, and generate an estimated $1.2M in new revenue in its first two years. He has a detailed proposal with financial projections.",
          "utility_impact": "Securing the full $350k (+2). Securing over $250k (+1). Securing less than $250k (-1). Getting no funding for the robot (-2)."
        },
        "Maintain Departmental Autonomy": {
          "description": "He strongly opposes any hospital-wide mandates on how his department's residents spend their time, including protected research time. He believes surgical training is paramount and that research should be an elective pursuit for those who are truly interested, not a mandatory requirement that pulls residents away from valuable, revenue-generating clinical work in the OR.",
          "utility_impact": "Defeating the mandatory research time proposal (+1). Accepting a flexible, opt-in research policy (0). Being forced to implement a mandatory research policy (-2)."
        }
      },
      "private_preferences": {
        "Professional Rivalry": {
          "value": "The real motivation behind the 'Artemis' robot is that his chief rival, Dr. Alistair Finch at the competing University Hospital, just acquired one and issued a glowing press release about it last week. Dr. Thorne feels he is falling behind and is driven by a deep-seated personal need to one-up Dr. Finch and maintain his reputation as the city's preeminent surgeon. He cannot admit this, as it would make his massive request seem petty and ego-driven rather than strategic. Penalty for revealing this: -2.",
          "reason": "Preserving his reputation as a dispassionate, data-driven leader rather than a vain competitor.",
          "utility_impact": "This private motivation makes his desire for the robot almost non-negotiable in his own mind. He is willing to sacrifice other potential gains to secure this symbolic victory."
        }
      }
    },
    {
      "name": "Dr. Lena Petrova",
      "role": "Chair of the Department of Internal Medicine",
      "description": "A highly respected clinician and educator, Dr. Petrova is deeply committed to the quality of medical education and resident well-being. She is known for her meticulous, thoughtful approach but is currently under immense, hidden pressure. She appears outwardly calm but is privately desperate.",
      "shareable_preferences": {
        "Educational Quality Enhancement": {
          "description": "She is requesting $300,000 for a comprehensive 'Educational Quality and Faculty Support Initiative.' She describes this as funding for hiring more teaching faculty to improve resident supervision ratios, implementing a new digital curriculum platform, and expanding resident wellness and mental health resources. She frames it as a necessary investment to combat burnout and maintain the department's excellent reputation.",
          "utility_impact": "Securing the full $300k (+2). Securing $200k-$299k (+1). Securing less than $200k (-1). Securing less than $100k (-2)."
        },
        "Support for Specialized Training": {
          "description": "She is a strong advocate for creating the new Cardio-Oncology fellowship for Dr. Sharma, whom she considers a once-in-a-generation talent. She argues that retaining Dr. Sharma and building this niche program will elevate the entire department's academic profile and attract better residents in the future.",
          "utility_impact": "Successfully creating the fellowship for Dr. Sharma (+1). Failing to create the fellowship (-1)."
        }
      },
      "private_preferences": {
        "Provisional Accreditation Status": {
          "value": "Her department has been placed on 'Provisional Accreditation' by the ACGME following a recent site visit. The confidential report cited 'critical deficiencies in faculty supervision and curriculum documentation.' She has exactly 12 months to demonstrate significant improvement, or the department will lose its accreditation entirely. This would be a catastrophic failure, preventing them from training residents and potentially triggering a hospital-wide review. The $300k she is requesting is not for 'enhancement,' it is the bare minimum required to hire the necessary faculty and consultants to fix these deficiencies and save the program. Revealing this would cause mass panic among current residents and faculty, and would be a devastating blow to her and the hospital's reputation. Penalty for revealing: -2.",
          "reason": "Preventing widespread panic, reputational collapse, and a potential exodus of residents and faculty.",
          "utility_impact": "This makes her funding request an existential necessity. She cannot compromise on the amount. This information, if revealed, would instantly change the priorities of the entire negotiation."
        }
      }
    },
    {
      "name": "Dr. Ben Carter",
      "role": "Chief Resident, PGY-4",
      "description": "Elected by his peers, Ben is a natural leader who is passionate about advocating for his fellow residents. He is frustrated with the increasing clinical demands that leave little time for academic development, a sentiment shared by nearly all residents.",
      "shareable_preferences": {
        "Protected Research Time": {
          "description": "He is formally proposing a new hospital-wide policy mandating a half-day (4 hours) of protected, non-clinical time each week for all residents (PGY-2 and up) to pursue research and academic projects. This time must be free from all clinical duties. He argues this will improve board scores, increase the hospital's academic output, and make the residency programs more competitive.",
          "utility_impact": "Getting the mandatory 4-hour weekly policy approved (+2). Getting a mandatory 2-hour policy approved (+1). Getting an optional/opt-in policy approved (-1). The proposal being rejected entirely (-2)."
        },
        "Resident Academic Fund": {
          "description": "To support the research time, he is requesting a recurring budget of $100,000 to be allocated to a resident-managed fund. This money would be used for residents to apply for grants to cover costs for research materials, statistical support, and travel to present at national conferences.",
          "utility_impact": "Securing the full $100k fund (+2). Securing $50k-$99k (+1). Securing less than $50k (0). Getting no funding (-1)."
        }
      },
      "private_preferences": {
        "Unionization Efforts": {
          "value": "Ben is one of the lead organizers of a secret resident unionization drive at Grandview. The residents are feeling overworked and undervalued. The administration's response to this 'Protected Research Time' proposal is being viewed by the residents as a final test of good faith. If the proposal is dismissed or watered down, he has the support to move forward with a formal union vote within the month. He cannot, under any circumstances, reveal the unionization plan. The hint he can give is 'resident morale is at an all-time low, and we are exploring all options to have our voices heard.' Penalty for revealing the union plan: -2 (would result in his immediate dismissal and being blacklisted from other residency programs).",
          "reason": "Protecting himself and the collective action of his peers from retribution by the administration.",
          "utility_impact": "This makes his proposal a high-stakes issue. For him, it's not just about research; it's about securing a major concession for residents that could stave off a much larger labor dispute."
        }
      }
    },
    {
      "name": "Dr. Anya Sharma",
      "role": "Internal Medicine Resident, PGY-3",
      "description": "A brilliant and highly motivated resident, Dr. Sharma has already published two papers in high-impact journals. She has identified a passion for the emerging field of Cardio-Oncology and is a key player in this negotiation, representing the 'star talent' the hospital wants to retain.",
      "shareable_preferences": {
        "Create Cardio-Oncology Fellowship": {
          "description": "She is formally requesting that the hospital create and fund a new, one-year, non-accredited fellowship in Cardio-Oncology specifically for her, to begin next year. She has a detailed curriculum plan and has already identified mentors in both Cardiology and Oncology who are willing to participate. The estimated cost for her salary, benefits, and research support is $150,000 for the year.",
          "utility_impact": "The hospital agrees to create and fully fund the fellowship (+2). The hospital agrees to a fellowship with partial funding (<$150k) (0). The hospital rejects the fellowship proposal but offers a generic research year (-1). The proposal is rejected entirely (-2)."
        }
      },
      "private_preferences": {
        "Exploding Job Offer": {
          "value": "Dr. Sharma has a firm offer for a fully-funded position in the highly prestigious, established Cardio-Oncology fellowship at Johns Hopkins. She received the congratulatory email yesterday, and it states, 'We are thrilled to offer you this position. Please inform us of your decision within 72 hours, as we have an extensive waitlist.' She would genuinely prefer to stay at Grandview because her partner has a non-transferable job in the city, but she will not sacrifice her career. The Hopkins offer is her backup and her leverage. Revealing it too early or in a threatening way could backfire, making her seem disloyal. Penalty for using it as a blunt ultimatum: -1.",
          "reason": "Maintaining a good relationship with her current mentors and not burning bridges. She wants them to create the fellowship because they value her, not because she forced their hand.",
          "utility_impact": "The 72-hour deadline creates extreme time pressure. She must secure a firm commitment in this single meeting, or she will be forced to accept the other offer. This makes her goal time-sensitive and critical."
        }
      }
    }
  ],
  "success_criteria": {
    "Budget Allocation": "A finalized, line-item allocation of the $500,000 discretionary fund must be agreed upon and documented.",
    "Fellowship Decision": "A definitive 'yes' or 'no' decision on the creation and funding of the Cardio-Oncology fellowship must be made.",
    "Research Policy": "A new, clearly defined hospital-wide policy on resident research time must be established.",
    "Majority Agreement": "At least four of the five agents must formally agree to the final comprehensive plan."
  },
  "constraints": {
    "verifiable": [
      "The total available discretionary budget for this allocation is exactly $500,000.",
      "Any new mandatory policy for residents must comply with ACGME work-hour regulations, which cap total work hours at 80 per week.",
      "Capital equipment purchases over $100,000 require a formal ROI projection report."
    ],
    "hidden": [
      "The Internal Medicine residency program will lose accreditation in 12 months if significant, costly changes are not made.",
      "A secret 'Strategic Opportunity Fund' of $300,000 exists and is controlled by the CFO.",
      "A resident unionization vote is imminent if their demands for protected time are not met.",
      "Dr. Sharma has a 72-hour deadline on a competing job offer from a top-tier institution."
    ]
  },
  "deliverable": "A one-page Memorandum of Understanding (MOU) detailing the final budget allocation for the $500,000 fund, the decision on the fellowship, and the specifics of the new research time policy. The MOU must be signed by all consenting parties.",
  "solvability_note": "The scenario is solvable because the agents' requests, while exceeding the public budget, can be met by revealing and strategically deploying private information. Dr. Petrova's accreditation crisis is an existential threat that, once revealed, will force the group to prioritize her $300k request. This will make Dr. Reed's secret $300k fund a necessary and justifiable resource to solve the remaining critical issues: retaining a star resident (Dr. Sharma) and averting a labor crisis (Dr. Carter's request), which are both strategically vital for the hospital's long-term health."
}