{
  "scenario": "SafeRide Forward: Reforming the Campus Rideshare Program",
  "task": "A series of undisclosed safety incidents involving the student-run ridesharing app, 'CampusCar,' has been anonymously leaked to the university administration. The university is now threatening a complete shutdown of the service, which has become vital for many students. This committee of seven stakeholders has been convened for a final, high-stakes negotiation to create a new 'SafeRide Forward Protocol.' Failure to reach a unanimous agreement on all key points by the end of the meeting will result in the immediate and permanent termination of CampusCar.",
  "agent_number": 7,
  "agent_names": [
    "Alex Chen",
    "Dr. Evelyn Reed",
    "Officer Ben Carter",
    "Maria Garcia",
    "Liam O'Connell",
    "Dr. Kenji Tanaka",
    "Chloe Davis"
  ],
  "agents": [
    {
      "name": "Alex Chen",
      "role": "Student Founder & CEO of CampusCar",
      "description": "A savvy and ambitious computer science senior who developed and runs CampusCar. He sees it as both a valuable campus utility and a viable business venture. He is fiercely protective of his creation's autonomy and financial model, viewing administrative oversight as bureaucratic bloat that will stifle innovation and increase costs for students.",
      "shareable_preferences": {
        "preference1": {
          "description": "Limit the total annual operating budget, including any university subsidy, to a maximum of $50,000. Alex argues that his lean operational model is the key to CampusCar's low fares. He believes any budget above this amount is unnecessary and will be consumed by administrative overhead, forcing a price hike for students. He will strongly resist any budget proposal over $60,000.",
          "utility_impact": "Keeping costs low is central to his business philosophy and profitability. A budget under $50k gets a +2 utility. A budget between $50k-$65k is a 0. A budget between $65k-$75k is a -1. A budget over $75k is a -2, as it would likely wipe out his profit margin."
        },
        "preference2": {
          "description": "Maintain the current background check system, which is a basic, third-party county-level criminal record check for new drivers. He argues that more extensive checks, like state or FBI-level fingerprinting, are prohibitively expensive (costing up to $100 per driver) and can unfairly penalize students for minor, sealed, or irrelevant past offenses, shrinking the driver pool.",
          "utility_impact": "This preference is about cost-control and maintaining a large pool of eligible drivers. Sticking with the basic check is a +2. Moving to a state-level check is a -1. Mandating an FBI-level check is a -2."
        },
        "preference3": {
          "description": "Resist any real-time data sharing with university entities, especially Campus Security. He proposes a system where ride data (GPS logs, passenger/driver info) is only provided upon formal request with a valid case number. He will frame this as a critical issue of student privacy and data security, arguing that constant tracking creates a chilling effect.",
          "utility_impact": "Protecting his platform's data is paramount for user trust and his own control. No real-time sharing is a +2. On-request sharing is a 0. Any form of real-time GPS dashboard access is a -2."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "CampusCar is significantly more profitable than anyone knows. Last year, the service cleared $45,000 in net profit after all expenses (server costs, payment processing fees, driver commissions). Alex personally took home $30,000 as a 'founder's stipend.' He can vaguely state that the service is 'financially self-sustaining' but is forbidden from revealing the actual profit figures. If he reveals the company's net profit, he incurs a -1 penalty. If he reveals his personal stipend, he incurs a -2 penalty.",
          "reason": "Revealing this would make him appear greedy and completely undermine his arguments that the service cannot afford enhanced safety measures or higher driver pay.",
          "utility_impact": "This hidden profit margin is the entire basis for his low-budget stance. It's his money he's protecting. This knowledge makes him fight tooth and nail against any cost increases that he knows he *could* technically afford."
        },
        "private_info2": {
          "value": "He is in late-stage talks with a venture capital firm, 'InnovateU Ventures,' to secure funding to expand CampusCar to two other universities next year. The deal is contingent on the continued, successful, and independent operation of the flagship program at this university. A shutdown, or a protocol that cedes significant control to the university, would instantly kill the deal. He cannot mention the VC firm or the expansion plans. Penalty for revealing this is -2.",
          "reason": "This is a confidential business negotiation. Premature disclosure would violate his NDA with the VC firm and jeopardize the entire opportunity.",
          "utility_impact": "This makes the negotiation existential for him. He isn't just trying to save a campus job; he's trying to protect the foundation of his future company. He will be far more resistant to ceding control than anyone expects."
        }
      }
    },
    {
      "name": "Dr. Evelyn Reed",
      "role": "Dean of Student Affairs",
      "description": "A seasoned administrator whose primary concern is the welfare and safety of the student body. She is deeply troubled by the undisclosed incidents and sees the current, unregulated state of CampusCar as a massive liability and a tragedy waiting to happen. She represents the university's duty of care.",
      "shareable_preferences": {
        "preference1": {
          "description": "Implement a mandatory, comprehensive background check for all drivers, conducted by the university. This would be an FBI-level fingerprint check, cross-referenced with the university's own non-academic disciplinary records. She believes this is the only way to ensure that drivers are trustworthy and to exercise due diligence.",
          "utility_impact": "This is her top priority for student safety. FBI check with disciplinary review is +2. FBI check alone is +1. State-level check is -1. A basic county check is a non-starter and gets a -2."
        },
        "preference2": {
          "description": "Establish a University Oversight Committee with the authority to review and approve all CampusCar policies, access incident reports, and unilaterally deactivate drivers based on safety concerns. Her office would have full, direct access to all ride data and incident reports generated by the platform.",
          "utility_impact": "Control and oversight are key to her feeling the university is meeting its responsibilities. Full oversight and data access is +2. Limited, advisory access is -1. No direct oversight is -2."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "One of the recent, hidden incidents involved a female student being verbally harassed and intimidated by a driver who was on university disciplinary probation for similar behavior. A second incident involved a driver with two on-campus alcohol violations driving erratically. She knows the specific names and case files. Revealing these specific student disciplinary details would be a severe violation of the Family Educational Rights and Privacy Act (FERPA). She can only speak in generalities about 'past incidents.' Penalty for revealing specifics is -2.",
          "reason": "Sharing protected student records is illegal and grounds for termination. It would also cause a massive panic among students and parents.",
          "utility_impact": "This direct knowledge fuels her uncompromising stance on cross-referencing disciplinary records. She feels she has seen the direct failure of the current system and is morally obligated to fix it, even if she can't use her most powerful evidence."
        },
        "private_info2": {
          "value": "The University President gave her a direct, private ultimatum: 'Evelyn, this CampusCar mess blew up on your watch. You either get it under lock-tight university control or I will shut it down myself and publicly state it was a failure of Student Affairs' oversight.' Her professional reputation and potentially her job are on the line. Penalty for revealing this is -2.",
          "reason": "Admitting this would severely weaken her negotiating position, making her look desperate rather than principled. It would expose her to political maneuvering from others in the administration.",
          "utility_impact": "This pressure means she has very little room to compromise on her core demand for university control. For her, a 'failed negotiation' is almost as bad as a 'bad deal,' but a bad deal that leads to another incident would be catastrophic."
        }
      }
    },
    {
      "name": "Officer Ben Carter",
      "role": "Campus Security Liaison",
      "description": "A 15-year veteran of the campus police force. He is pragmatic and focused on operational effectiveness. He sees CampusCar as a 'black box' operating on his turf, making it impossible for his officers to respond effectively to emergencies. He is frustrated with the lack of cooperation from Alex in the past.",
      "shareable_preferences": {
        "preference1": {
          "description": "Mandatory integration of a real-time 'Security Dashboard' into the Campus Security dispatch center. This dashboard must show the live GPS location of all active CampusCar vehicles, along with driver and passenger names. He argues this is a non-negotiable requirement for emergency response, citing the 'golden hour' for finding missing persons or responding to assault calls.",
          "utility_impact": "For him, this is a matter of life and death. Real-time dashboard is +2. A system where data is provided only on request after an incident is a -2, as he considers that 'response data, not prevention data.'"
        },
        "preference2": {
          "description": "A mandatory, in-app 'Panic Button' for both drivers and riders that sends an immediate, high-priority alert directly to the Campus Security dispatch, including the vehicle's live location and user details. He is not interested in a button that alerts a CampusCar employee who then calls security; the alert must be instantaneous and direct.",
          "utility_impact": "Direct communication is critical for response time. A direct panic button is +2. An indirect button is 0. No panic button is -2."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Last month, his department was criticized internally for a 25-minute response time to a student in distress just off-campus. The student had used CampusCar, but by the time friends called security and security contacted a non-responsive Alex Chen for information, the critical window was lost. The student was thankfully unharmed but shaken. He cannot share the details of this specific operational failure. He can say 'response times are critical,' but mentioning the 25-minute delay is a -1 penalty, and mentioning the specific case is a -2 penalty.",
          "reason": "Admitting to such a slow response time would reflect poorly on his department and could be used against them in budget meetings. It would cause public distrust.",
          "utility_impact": "This failure haunts him and is the direct motivation for his 'non-negotiable' demand for the real-time dashboard. He is unwilling to compromise because he has seen the alternative firsthand."
        }
      }
    },
    {
      "name": "Maria Garcia",
      "role": "Student Government President",
      "description": "A popular and politically astute student leader. She is caught in a difficult position. She must advocate for the safety of her constituents, but also protect a service that is overwhelmingly popular for its convenience and affordability. She is trying to find a middle ground that doesn't alienate students or the administration.",
      "shareable_preferences": {
        "preference1": {
          "description": "Cap any increase in the average per-ride fare at 10%. Students are on tight budgets, and a key appeal of CampusCar is that it's cheaper than Uber or Lyft. She has data suggesting that significant price hikes would disproportionately affect lower-income and international students who rely on the service.",
          "utility_impact": "Affordability is her primary mandate from her constituents. A fare increase of <=10% is +2. An increase of 10-20% is -1. An increase over 20% is -2, as she would view it as a betrayal of her promise to students."
        },
        "preference2": {
          "description": "Mandate student representation on any new oversight committee. She argues that students, as the primary users and operators of the service, must have a voice in its governance. She also wants a transparent, quarterly, anonymized report of all safety-related incidents to be published publicly.",
          "utility_impact": "Ensuring student voice and transparency is key to her political platform. Getting both a student seat and public reports is +2. Getting only one is +1. Getting neither is -1."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Her office conducted a confidential online poll of 500 student users last week. The results are explosive: 65% said they would stop using CampusCar if fares increased by more than 20%. However, 75% said they would immediately stop using it if they knew the (currently hidden) details about the recent safety incidents. She can allude to 'student sentiment' but cannot cite the specific poll numbers. Penalty for sharing the poll data is -1.",
          "reason": "This was an internal Student Government strategy poll. Releasing the data would betray the trust of the students who took it and show her hand completely.",
          "utility_impact": "This data puts her in a terrible bind. She knows that the service is simultaneously on the verge of being too expensive and perceived as too dangerous. It forces her to try and thread an almost impossible needle: get meaningful security improvements without raising costs significantly."
        }
      }
    },
    {
      "name": "Liam O'Connell",
      "role": "Student Driver Representative",
      "description": "A part-time driver for CampusCar and an informal representative for a group of over 30 other drivers. He is concerned with fair treatment, compensation, and protecting drivers from arbitrary or unfair decisions by both CampusCar management and the university.",
      "shareable_preferences": {
        "preference1": {
          "description": "Increase the driver commission rate on all fares from the current 70% to a minimum of 80%. He argues that with rising gas prices and vehicle maintenance costs, the current rate is not sustainable. He also wants a guaranteed minimum payment for short trips.",
          "utility_impact": "Fair pay is his members' top concern. An 80% commission is +2. 75% is +1. Staying at 70% is -1. Any decrease is -2."
        },
        "preference2": {
          "description": "Establish a formal, transparent appeals process for driver deactivations. Currently, Alex can deactivate a driver with no explanation based on a single rider complaint. Liam wants a multi-step process involving a review board that includes at least one other driver.",
          "utility_impact": "Job security and due process are crucial. A formal appeals process is +2. No process is -2."
        },
        "preference3": {
          "description": "Strictly prohibit the use of university non-academic disciplinary records in determining driver eligibility. He argues that a student's standing with the university for a minor offense like a noise complaint in a dorm should have no bearing on their ability to drive a car, and using it is an invasion of privacy.",
          "utility_impact": "This is a red line for his members who fear unfair disqualification. Prohibiting use of disciplinary records is +2. Any use of these records is -2."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "He was personally almost deactivated by Alex two months ago after a rider gave him a 1-star review with a false complaint of 'reckless driving.' In reality, Liam had refused to take the student and their friends, who were carrying open containers of alcohol, to an off-campus party. He fought it and Alex eventually relented, but the experience showed him how flawed and arbitrary the system is. He cannot share this personal story. Penalty for sharing is -1.",
          "reason": "It's personally embarrassing and makes him sound like he's arguing from personal grievance rather than on behalf of all drivers.",
          "utility_impact": "This personal experience is the source of his passion for an appeals process. He knows the current system allows riders to weaponize complaints and that drivers have no recourse."
        }
      }
    },
    {
      "name": "Dr. Kenji Tanaka",
      "role": "University Legal Counsel",
      "description": "The university's chief lawyer. He is methodical, risk-averse, and his sole focus is on protecting the university from legal and financial liability. He is not concerned with the service's convenience or popularity, only its potential to result in a lawsuit.",
      "shareable_preferences": {
        "preference1": {
          "description": "CampusCar must secure a new commercial auto insurance policy that explicitly lists the university as an additional insured party. This policy must have a liability coverage limit of no less than $5 million. He has a quote for such a policy and knows it will be expensive.",
          "utility_impact": "This is a non-negotiable legal protection for the university. $5M coverage is +2. $2M coverage is -1. The current $1M coverage is -2 and legally unacceptable."
        },
        "preference2": {
          "description": "All data sharing protocols must be rigorously designed to comply with FERPA and other data privacy laws. Any access to student data by any party (including Campus Security) must be logged, audited, and have a clear, legally-defensible justification. He prefers systems that use anonymized or tokenized data wherever possible.",
          "utility_impact": "Compliance is his job. A fully compliant and audited system is +2. A system with potential compliance holes is -2."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "The university's current insurance carrier, 'Ed-Sure Insurance,' sent the university a formal 'Notice of Non-Renewal' 30 days ago, citing the unmanaged risk of the CampusCar program. The policy expires in 60 days. If this committee does not produce a new, robust safety protocol that can be used to secure a new policy, the university will be uninsured for this activity, forcing an instant shutdown. He cannot reveal the non-renewal notice. Penalty for revealing this is -2.",
          "reason": "Revealing that the university is on the verge of being uninsurable would create a massive panic and completely destroy the university's negotiating leverage. It signals desperation.",
          "utility_impact": "This creates an iron-clad deadline that no one else is aware of. He knows that 'no deal' is not an option and that a deal must include the elements required by a new underwriter (like better background checks and oversight), making him an unlikely, but powerful, ally for Dean Reed on certain issues."
        }
      }
    },
    {
      "name": "Chloe Davis",
      "role": "Campus Tech Services Director",
      "description": "The head of the university's IT department. She is overworked, under-budgeted, and wary of any new project that will add to her team's workload. She is concerned with data security, system integration, and the technical feasibility of the proposed solutions.",
      "shareable_preferences": {
        "preference1": {
          "description": "Any new technical systems, such as a security dashboard or a new reporting module, must be developed, hosted, and maintained entirely by CampusCar. University IT does not have the budget or developer hours to take on a new project of this scope. She will refuse to accept any solution that requires her staff to maintain custom code.",
          "utility_impact": "Protecting her team's limited resources is her main goal. CampusCar building and maintaining the system is +2. A solution requiring any University IT development work is -2."
        },
        "preference2": {
          "description": "If any integration with university systems is required (e.g., for checking disciplinary records), a budget of $15,000 must be allocated for a mandatory, third-party code audit and security penetration test of the entire CampusCar application. She will not allow an insecure app to connect to university infrastructure.",
          "utility_impact": "Security is a critical professional concern. A funded, mandatory audit is +2. No audit is -2."
        },
        "preference3": {
          "description": "All data sharing must occur via a secure, rate-limited, and fully-documented API (Application Programming Interface), not through direct database access, which she considers reckless and insecure.",
          "utility_impact": "This is a technical best practice. An API-based solution is +2. Direct database access is -2."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Her team ran an informal, unauthorized vulnerability scan on the CampusCar app two weeks ago and found several critical security flaws, including the storage of user passwords in plain text and unencrypted GPS logs. Her boss, the VP of Technology, sent her a congratulatory email for being proactive ('Great catch, Chloe! Let's keep this quiet for now to manage liability. We can't be officially aware of it until we have a plan.') but forbade her from creating an official report or disclosing the findings. She can vaguely mention 'potential security concerns' (-1 penalty), but revealing the specific flaws like plain-text passwords or showing the email would be direct insubordination (-2 penalty).",
          "reason": "Revealing the specific findings would be an admission of institutional knowledge of a major data breach risk, creating a paper trail and exposing the university to massive liability if an incident were to occur before it's fixed.",
          "utility_impact": "This knowledge makes her demand for a security audit non-negotiable. She knows the app is a ticking time bomb and cannot, in good conscience, allow it to be integrated with university systems without a full, formal, third-party review that will 'officially' discover what she already knows."
        }
      }
    }
  ],
  "success_criteria": {
    "criterion1": "Unanimous agreement by all 7 agents on all five points of the 'SafeRide Forward Protocol.' A simple majority is not sufficient; any single agent can veto the entire plan.",
    "criterion2": "The agreed-upon protocol must be internally consistent and not violate any of the hard constraints (e.g., the final budget must be sufficient to pay for the agreed-upon measures).",
    "criterion3": "The final agreement must be signed off by all parties, creating a formal record of the new operating policy for CampusCar."
  },
  "constraints": {
    "verifiable": [
      "The university has allocated a maximum possible subsidy of $75,000 for the program's total annual budget. The final agreed-upon budget cannot exceed this amount.",
      "Any new protocol must be fully implemented within 90 days.",
      "The final agreement must be compliant with state and federal laws, including FERPA and local vehicle-for-hire regulations."
    ],
    "hidden": [
      "The university's current insurance policy is being cancelled in 60 days, creating a hard deadline that most participants are unaware of.",
      "The CampusCar application has known, critical security vulnerabilities that have not been formally disclosed."
    ]
  },
  "deliverable": "A single, agreed-upon document, formatted as a JSON object, titled the 'SafeRide Forward Protocol,' which contains the final, unanimously-agreed-upon values for the following five keys: 'annual_budget' (integer), 'background_check_level' (string: 'Basic', 'State', or 'FBI'), 'data_sharing_policy' (string: 'None', 'On-Request', or 'Real-Time_Dashboard'), 'driver_commission_rate' (integer, percentage), and 'oversight_model' (string: 'Independent', 'Advisory_Committee', or 'University_Controlled').",
  "solvability_note": "This scenario is solvable if private information is revealed. Alex's hidden profit ($45k) proves that a larger budget for safety is feasible without raising student fares excessively. The Dean's and Security Officer's specific, hidden incidents provide the undeniable justification for stronger background checks and real-time tracking. The Legal Counsel's hidden insurance deadline creates the urgency to force a compromise. The Tech Director's hidden security flaws make the security audit and API non-negotiable. With all cards on the table, a compromise becomes logical: Alex sacrifices some profit for a larger budget (e.g., $65k), which funds a State-level check (a compromise between Basic and FBI), a secure API for a real-time dashboard, a 75% driver commission, and the mandatory security audit. This plan would be safe enough to get insured, affordable enough to survive, and secure enough to pass technical muster."
}