{
  "scenario": "Final Negotiation of the Global Tech & Sustainability Accord (GTSA)",
  "task": "The six agents are in the final, closed-door session to ratify the GTSA. They must agree on the final quantitative values for four key articles: Article 5 (E-Waste Management Fund), Article 7 (Agricultural Tariffs), Article 9 (Intellectual Property Licensing), and Article 12 (Data Localization). Failure to reach a majority agreement (at least 4 out of 6 agents must approve the final package) will cause the entire accord to collapse, reverting all trade relations to a state of uncertainty and potential tariff wars.",
  "agent_number": 6,
  "agent_names": [
    "Arthur Vance",
    "Dr. Lena Petrova",
    "Marcus Thorne",
    "Beatrice Dubois",
    "Kenji Tanaka",
    "Sofia Rossi"
  ],
  "agents": [
    {
      "name": "Arthur Vance",
      "role": "Minister for International Trade, United Kingdom",
      "description": "A seasoned diplomat from a major developed nation, Arthur's public mandate is to champion 'Green Growth'—promoting the UK's high-tech and financial sectors while pushing for strong global environmental standards. He is under immense pressure to secure a landmark deal that showcases the UK's post-Brexit global leadership.",
      "shareable_preferences": {
        "Strong Environmental Standards": {
          "description": "Establish a mandatory 'Producer Responsibility Fund' for e-waste (Article 5). He is publicly advocating for a fund capitalized at a minimum of $20 billion, paid for by tech corporations, to process electronic waste globally. He argues this creates a level playing field and rewards sustainable design.",
          "utility_impact": {
            "Fund >= $25B": "+2 (Seen as a global leader)",
            "$15B <= Fund < $25B": "+1 (A respectable compromise)",
            "$5B <= Fund < $15B": "-1 (Politically embarrassing)",
            "Fund < $5B or voluntary": "-2 (A complete failure of his 'Green Growth' agenda)"
          }
        },
        "Open Digital Markets": {
          "description": "He strongly opposes 'Data Localization' requirements (Article 12), which would require companies to store data within the country where it is generated. He advocates for a policy of 'Free and Open Data Flow,' arguing it is essential for the 21st-century digital economy and his nation's powerful fintech and AI sectors.",
          "utility_impact": {
            "No data localization rules": "+2 (Major win for his key industries)",
            "Localization required for only 'sensitive' data (e.g., health, finance)": "0 (A tolerable, but annoying, compromise)",
            "Broad data localization required for all personal data": "-2 (Devastating for his country's tech sector)"
          }
        }
      },
      "private_preferences": {
        "Secret US-UK Tech Corridor Deal": {
          "value": "Arthur has a signed Memorandum of Understanding with the US government and OmniCorp (Marcus Thorne's company) for a 'Trans-Atlantic Tech Corridor' worth an estimated $50 billion to the UK economy. A key, non-negotiable clause in this secret deal is that the GTSA must place *zero* restrictions on data flow between the UK and US. He can mention the importance of the US-UK relationship, but if he reveals the existence of this secret pre-negotiated deal, the US will walk, and his career will be over. Penalty for revealing the deal's existence: -4.",
          "reason": "Revealing this would cause a massive political scandal, accusing him of selling out national interests to a foreign corporation before the global treaty was even negotiated.",
          "utility_impact": "This private deal makes his public stance on 'Open Digital Markets' an absolute necessity for him. He cannot compromise on Article 12, forcing him to be more flexible on other issues like agricultural tariffs to win allies for his core objective."
        },
        "Fragile Domestic Agriculture": {
          "value": "Contrary to his public statements about a 'robust farming sector,' a confidential Treasury report on his desk shows that UK agriculture is on the brink of collapse and will face 60,000 job losses within 18 months without new export markets. The GTSA is its only lifeline. He can talk about the importance of exports, but if he reveals the sheer desperation and the specific job loss numbers, his negotiating position would be fatally weakened. Penalty for revealing the report's figures: -2.",
          "reason": "This information would create a panic in his country's rural communities and give other negotiators, especially Beatrice Dubois, immense leverage over him.",
          "utility_impact": "This makes him privately desperate to pass the GTSA in *any* form. He is willing to sacrifice the interests of UK farmers by agreeing to low agricultural tariffs if it means the overall deal gets signed."
        }
      }
    },
    {
      "name": "Dr. Lena Petrova",
      "role": "Minister of Economic Development, Republic of Esonia",
      "description": "Lena represents a rapidly developing nation eager to climb the economic ladder. Her primary goal is to secure foreign investment and technology to build her country's industrial base. She is viewed as a pragmatic and ambitious leader for the developing world.",
      "shareable_preferences": {
        "Access to Technology": {
          "description": "She advocates for a 'Fair Use' clause in the Intellectual Property rules (Article 9), demanding compulsory, low-cost licensing for 'green' technologies for developing nations. She argues this is essential for global sustainability and to prevent 'eco-colonialism.' She wants the licensing fee cap to be no more than 1% of the patent-holder's manufacturing cost.",
          "utility_impact": {
            "Compulsory licensing with fee cap <= 1%": "+2 (A huge win for Esonia's industrial goals)",
            "Compulsory licensing with fee cap <= 5%": "+1 (Acceptable)",
            "Voluntary licensing or fee cap > 5%": "-1 (Status quo, no real gain)",
            "Strong IP protection with no special clauses": "-2 (A major barrier to development)"
          }
        },
        "Development Funding": {
          "description": "She supports the E-Waste Management Fund (Article 5) but insists that at least 70% of the funds must be allocated to developing nations to build recycling infrastructure. This, she argues, would create jobs and solve a problem largely created by developed nations' consumption.",
          "utility_impact": {
            "Fund exists and >=70% is allocated to developing nations": "+2 (Transforms her nation's infrastructure)",
            "Fund exists and 40-70% is allocated": "+1 (A good outcome)",
            "Fund exists and <40% is allocated": "0 (Negligible impact)",
            "No fund is created": "-1 (A lost opportunity)"
          }
        }
      },
      "private_preferences": {
        "The 'Cerium Mountain' Discovery": {
          "value": "Esonia has secretly discovered one of the world's largest deposits of cerium and other rare earth minerals essential for all modern electronics. A geological survey estimates its value at over $200 billion. However, Esonia completely lacks the proprietary technology for environmentally-safe extraction. Her 'secret' primary mission at this summit is to acquire this clean extraction technology. She has a competing offer from a state-owned Chinese firm that is technologically inferior and environmentally disastrous. Revealing the discovery would trigger a geopolitical scramble and inflate the price of the technology she needs. Penalty for revealing the existence of the mineral deposit: -5.",
          "reason": "This is a state secret of the highest level. Its leak would destabilize her government and expose Esonia to predatory foreign interests.",
          "utility_impact": "This private need makes her public stance on IP licensing (Article 9) her most critical issue. She is willing to concede almost anything else—data localization, agricultural tariffs—if she can secure a deal that gives her access to the clean mining patents held by companies like OmniCorp."
        }
      }
    },
    {
      "name": "Marcus Thorne",
      "role": "Chief Lobbyist & VP of Global Strategy, OmniCorp",
      "description": "Smooth, powerful, and representing one of the world's largest tech conglomerates, Marcus is here to ensure the GTSA promotes corporate interests. His company is a leader in consumer electronics and cloud computing. He frames his arguments in the language of innovation, job creation, and free-market principles.",
      "shareable_preferences": {
        "Ironclad Intellectual Property Rights": {
          "description": "He is vehemently opposed to any form of compulsory licensing (Article 9). He argues that strong, non-negotiable patent protection is the only way to incentivize the massive R&D investments his company makes. He wants the GTSA to affirm existing international patent law with no exceptions.",
          "utility_impact": {
            "No compulsory licensing, affirmation of status-quo IP law": "+2 (Perfect outcome)",
            "Voluntary tech transfer programs": "0 (PR win, no real cost)",
            "Compulsory licensing for non-essential tech": "-1 (A dangerous precedent)",
            "Compulsory licensing for 'green' or core tech": "-2 (A direct threat to his business model)"
          }
        },
        "Corporate-Led Environmental Solutions": {
          "description": "He opposes a mandatory, government-run E-Waste Fund (Article 5), calling it inefficient bureaucracy. He proposes a voluntary, industry-led 'Tech Sustainability Pledge' with a commitment of $2 billion from OmniCorp and its partners. He claims this is more agile and market-driven.",
          "utility_impact": {
            "Voluntary pledge is adopted": "+2 (Avoids billions in liability)",
            "Mandatory fund is created but is < $5B": "+1 (A small, manageable cost)",
            "Mandatory fund is $5B - $15B": "-1 (A significant hit to the bottom line)",
            "Mandatory fund is > $15B": "-2 (A disaster for his sector's profitability)"
          }
        }
      },
      "private_preferences": {
        "The 'E-Waste Scandal' Lawsuit": {
          "value": "OmniCorp is secretly the defendant in a massive, sealed class-action lawsuit for illegal e-waste dumping in several developing nations, including Esonia. Their legal department's confidential assessment is that if they lose, the liability could exceed $8 billion. A mandatory Producer Responsibility Fund (Article 5) established by this treaty would be cited in court as an admission of industry-wide guilt and would make losing the lawsuit a certainty. He can say the costs of the fund are 'prohibitive,' but he cannot mention the lawsuit. Penalty for revealing the lawsuit's existence: -5.",
          "reason": "Revealing an active, sealed lawsuit would violate a court order, trigger a stock price collapse, and lead to his immediate termination and potential prosecution.",
          "utility_impact": "He must defeat or neuter Article 5 at all costs. This is his single most important issue, far more so than even IP. He is privately authorized to offer 'creative solutions' on IP (like a special license for Esonia) if it means killing the mandatory e-waste fund."
        },
        "The CEO's Bonus Email": {
          "value": "He has a printed email in his briefcase from the CEO of OmniCorp. It reads: 'Marcus, kill Article 5. Make it voluntary or a fund under $5B. If you do, your $2M bonus is confirmed. If the fund is over $15B, you will be in charge of overseeing our new 'Waste Management' division in Antarctica. Don't fail.' Spilling this would be humiliating and career-ending. Penalty for revealing his personal financial stake: -3.",
          "reason": "It would expose him as a mercenary acting on personal greed rather than a principled corporate representative, destroying his credibility.",
          "utility_impact": "This adds immense personal pressure to his negotiation on Article 5, making him potentially more aggressive or, conversely, more willing to make a desperate deal on other articles to secure his primary goal."
        }
      }
    },
    {
      "name": "Beatrice Dubois",
      "role": "President, European Farmers Union",
      "description": "A fierce and charismatic advocate, Beatrice represents millions of farmers across Europe. Her public mission is to protect their livelihoods from what she calls 'predatory, unregulated global competition.' She is known for her hardline, uncompromising negotiation style.",
      "shareable_preferences": {
        "Strong Agricultural Protectionism": {
          "description": "She demands the inclusion of a 'Food Security' clause in Article 7, establishing a minimum 20% tariff on all agricultural imports from outside the signatory nations. She claims this is vital to preserve rural lifestyles, ensure food safety, and maintain national sovereignty.",
          "utility_impact": {
            "Tariffs >= 20%": "+2 (A major victory, ensures her re-election)",
            "10% <= Tariffs < 20%": "+1 (An acceptable compromise she can sell to her members)",
            "5% <= Tariffs < 10%": "-1 (Seen as a weak deal)",
            "Tariffs < 5%": "-2 (A total betrayal of her members; her career is over)"
          }
        }
      },
      "private_preferences": {
        "The 'Efficiency Miracle' Audit": {
          "value": "Beatrice is the sole possessor of a confidential audit conducted by her own union. The report, titled 'Project Harvest Gold,' shows that due to advances in ag-tech, European farm productivity has surged by 30% in the last five years. The audit concludes the union's farms could remain profitable with tariffs as low as 5%. Her entire public platform is a calculated bluff to maximize gains. Revealing this would expose her as a fraud to the very members who elected her. Penalty for revealing the audit's findings: -4.",
          "reason": "This would shatter her credibility and political power within the union, leading to her immediate removal and branding her a traitor.",
          "utility_impact": "She has far more room to negotiate than she lets on. She can afford to make a major concession on tariffs in exchange for a side-deal or favor, but she must make it look like she was forced into it after a heroic fight."
        }
      }
    },
    {
      "name": "Kenji Tanaka",
      "role": "Lead Delegate, Global Climate Foundation",
      "description": "An idealistic and data-driven environmental scientist, Kenji is the moral conscience of the summit. He represents a highly respected NGO and is armed with reams of data on climate change and pollution. He is pushing for the most stringent and legally-binding environmental clauses possible.",
      "shareable_preferences": {
        "Legally Binding Emissions Standards": {
          "description": "He insists that the GTSA must include mandatory, legally binding caps on carbon emissions for all manufacturing related to products in the treaty, aiming for a 40% reduction from current levels by 2030. He argues that voluntary pledges have consistently failed.",
          "utility_impact": {
            "Mandatory caps >= 40% reduction": "+2 (A historic achievement)",
            "Mandatory caps of 20-40% reduction": "+1 (Meaningful progress)",
            "Voluntary caps or reduction < 20%": "-1 (A greenwashed failure)",
            "No emissions clause": "-2 (An environmental catastrophe)"
          }
        },
        "Maximum E-Waste Fund": {
          "description": "He is a strong ally of Arthur Vance on the E-Waste Fund (Article 5), but pushes for an even higher number. Citing his foundation's research, he demands a fund of at least $30 billion, calling anything less an insult to the planet and the communities poisoned by tech waste.",
          "utility_impact": {
            "Fund >= $30B": "+2 (Truly transformative)",
            "$15B <= Fund < $30B": "+1 (A good start)",
            "Fund < $15B": "-1 (Inadequate)",
            "Voluntary or no fund": "-2 (Completely unacceptable)"
          }
        }
      },
      "private_preferences": {
        "The Rival Donor's Agenda": {
          "value": "The Global Climate Foundation's largest single donor (providing 40% of its annual budget) is 'Solara Innovations,' a direct and aggressive competitor to OmniCorp in the renewable energy and battery storage market. Kenji has a confidential memo from Solara's CEO that 'strongly suggests' he should push for e-waste regulations that specifically target OmniCorp's cobalt-based battery chemistry, while conveniently exempting Solara's patented silicon-based alternative. Sharing this would expose his foundation as a tool for corporate warfare. Penalty for revealing the donor's influence: -5.",
          "reason": "This would destroy his and his organization's reputation for impartiality and scientific integrity, effectively ending their ability to influence policy.",
          "utility_impact": "His seemingly pure environmental motives are compromised. He is privately incentivized to be completely inflexible on the specifics of Article 5 in a way that hurts OmniCorp, even if an alternative, more broadly effective compromise is available. This makes him an unwitting pawn and a potential deal-breaker."
        }
      }
    },
    {
      "name": "Sofia Rossi",
      "role": "Ambassador, Swiss Confederation",
      "description": "Poised, professional, and officially neutral, Sofia's role is to act as a mediator. She represents a nation whose prosperity is built on global stability, finance, and trade. She speaks of compromise and finding a 'sensible middle ground' for the good of the world economy.",
      "shareable_preferences": {
        "Treaty Stability and Ratification": {
          "description": "Her primary stated goal is to ensure the GTSA is successfully ratified. She frequently intervenes to de-escalate conflicts and suggests bridging proposals. She argues that the cost of failure—a chaotic global trade environment—is too high for anyone to bear.",
          "utility_impact": {
            "A deal is signed by at least 4 parties": "+2 (Mission accomplished)",
            "Negotiations are extended": "0 (Not ideal, but better than failure)",
            "The talks collapse entirely": "-2 (A failure of her mediation)"
          }
        }
      },
      "private_preferences": {
        "Protecting Banking Secrecy": {
          "value": "The Swiss government's only 'red line' issue is a seemingly minor sub-clause in Article 12, currently labeled 12.4b, on 'Automatic Exchange of Financial Information for Digital Asset Transactions.' This clause would effectively end Swiss banking secrecy for the lucrative crypto and digital asset markets, a multi-trillion dollar industry for Swiss banks. Her secret mandate from the Swiss Federal Council is to have this sub-clause removed at any cost. She is authorized to concede on any other point—agreeing to high agricultural tariffs, a massive e-waste fund, anything—as long as 12.4b is struck from the final text. Penalty for revealing her government's true priority: -4.",
          "reason": "Revealing that Switzerland's 'neutral mediation' is a front to protect its controversial banking industry would make them a pariah in future international negotiations and trigger immense diplomatic pressure from major economic blocs.",
          "utility_impact": "This makes her a 'wild card.' She appears to be the most flexible negotiator, willing to make surprising concessions. In reality, she is trading away things she doesn't care about to achieve her one, hidden, all-important objective. She might suddenly support Beatrice's high tariffs to get her vote against 12.4b, or back Marcus's low e-waste fund to gain his support."
        }
      }
    }
  ],
  "success_criteria": {
    "agreement": "A final agreement on the GTSA is reached. This requires at least 4 of the 6 agents to vote 'YES' on the complete package.",
    "quantification": "The final package must contain specific, agreed-upon numerical values for the following four items: 1) The total size of the E-Waste Management Fund in billions of USD (Article 5), 2) The percentage of the E-Waste fund allocated to developing nations (Article 5), 3) The uniform tariff percentage for agricultural goods (Article 7), and 4) The fee cap percentage for compulsory IP licensing (Article 9)."
  },
  "constraints": {
    "verifiable": [
      "Voting Rule: Any final proposal requires a super-majority of at least 4 out of 6 votes to pass.",
      "Time Limit: The negotiation session will end in 24 simulated hours. If no deal is reached, the summit fails.",
      "Scope: No new articles can be introduced. The negotiation is limited to setting the values for Articles 5, 7, 9, and 12."
    ],
    "hidden": [
      "Political Capital: Each agent starts with a finite amount of political capital. Agreeing to a proposal that results in a negative utility for them visibly reduces their standing and makes them less likely to compromise further.",
      "Undisclosed Alliances: Agents can form temporary alliances based on their private information, which may not be obvious to others."
    ]
  },
  "deliverable": "A single JSON object representing the final, agreed-upon GTSA package, for example: {'Article_5_Fund_Size_Billions': 15, 'Article_5_Allocation_Percent': 60, 'Article_7_Tariff_Percent': 8, 'Article_9_Licensing_Fee_Cap': 4}. This deliverable is only produced if the success criteria are met.",
  "solvability_note": "The scenario is solvable because the agents' private information creates hidden flexibilities and potential trades. For example, Marcus's desperation to avoid the E-Waste Fund (due to the lawsuit) makes him willing to offer Lena the clean mining tech IP she desperately needs. Beatrice's tariff demands are a bluff, so those funds can be reallocated to the E-Waste Fund, satisfying Arthur and Kenji. Arthur's need for a deal of any kind (due to his failing agriculture) means he will accept compromises. Sofia can act as the final 'kingmaker,' trading her vote on a contentious issue like tariffs in exchange for the removal of the financial transparency clause that only she truly cares about. A grand bargain is possible, but only if agents can deduce or reveal enough of the underlying interests to build a winning coalition."
}