{
  "scenario": "Negotiation of a 10-Year Management Plan for the Mariposa Grove Protected Forest, a 50,000-hectare area of significant ecological, cultural, and economic value. The negotiation involves balancing national conservation goals, indigenous rights, and commercial interests.",
  "task": "The three agents must collaboratively create and agree upon a single, comprehensive 10-Year Management Plan for the Mariposa Grove. This plan must be finalized as a single document/agreement that specifies: 1) The precise allocation of the 50,000 hectares into distinct zones (e.g., Strict Conservation, Sustainable Logging, Indigenous Protected and Conserved Area), with exact hectare counts for each. 2) A definitive annual logging quota in cubic meters. 3) The exact percentage of gross logging revenue to be allocated to the Arawan Community Development Fund. All three agents must formally agree on all points for the negotiation to be considered successful.",
  "agent_number": 3,
  "agent_names": [
    "Dr. Aris Thorne",
    "Lena Kai",
    "Marcus Vance"
  ],
  "agents": [
    {
      "name": "Dr. Aris Thorne",
      "role": "Director, National Parks and Conservation Agency (NPCA)",
      "description": "A 55-year-old career civil servant with a doctorate in ecology. Aris is caught between his genuine commitment to conservation and intense political pressure from the Ministry of Economic Development to make protected areas financially self-sustaining. He must produce a 'balanced' outcome that satisfies national environmental laws while also generating revenue to prevent severe budget cuts to his agency. His reputation is built on being a pragmatic, data-driven negotiator.",
      "shareable_preferences": {
        "Strict Conservation Zone": {
          "description": "Establish a 'Strict No-Go Zone' for all commercial activities. Publicly, Aris is pushing for 25,000 hectares (50% of the Grove) to meet ambitious national biodiversity targets and secure his legacy as a conservationist. He argues this is non-negotiable for preserving the Grove's most sensitive ecosystems. Utility is based on the size of this zone: 25,000+ ha (+2), 22,500-24,999 ha (+1), 20,000-22,499 ha (0), 17,500-19,999 ha (-1), <17,500 ha (-2).",
          "utility_impact": "Meeting this goal is crucial for Aris's professional standing and for satisfying international conservation agreements. He will use government data and legal mandates to heavily anchor the negotiation around this high number. Failure to secure at least the legal minimum of 20,000 ha would be a major political and personal failure."
        },
        "FSC Certification": {
          "description": "Mandate that any and all logging operations must achieve and maintain Forest Stewardship Council (FSC) certification. This is a public promise his agency has made and is a key part of their 'sustainable development' narrative. This is a binary preference. If FSC certification is explicitly included in the final agreement (+1), if not (-2).",
          "utility_impact": "This preference provides a shield against criticism from environmental NGOs. It allows him to concede to some logging while claiming it's the 'most responsible' kind. He will not agree to any plan that does not include this provision."
        },
        "Community Development Fund": {
          "description": "Establish a fund for the Arawan community, financed by logging revenues. His opening public offer is a 5% share of gross revenues. He frames this as a generous offer from the government to ensure equitable benefit sharing. Utility based on the percentage: 3-5% (+1), 6-9% (0), 10-14% (-1), 15%+ (-2).",
          "utility_impact": "This position is designed to make the government look like a fair mediator. He expects to negotiate this figure upwards but wants to keep it below 10% to maximize the state's own share of the revenue, which is needed for his agency's budget."
        }
      },
      "private_preferences": {
        "Undisclosed Mineral Resources": {
          "value": "A recent, highly classified geological survey commissioned by the Ministry of Economic Development has identified strong indicators of significant Coltan deposits within a specific 5,000-hectare block in the northernmost sector of the Grove. The Minister has personally ordered Aris to ensure this specific area is NOT designated as a Strict No-Go Zone, so that 'future strategic resource assessments' can be conducted. He cannot reveal the reason, as it would cause a political firestorm and accusations of prioritizing mining over conservation. Sharing this information would result in immediate dismissal and a major scandal. Penalty: -10 (career-ending). Hinting at 'national strategic interests' in the area. Penalty: -1.",
          "reason": "Revealing state-classified information about strategic mineral resources would violate national security protocols, derail the negotiation, and end his career.",
          "utility_impact": "This is Aris's most critical constraint. He must steer the negotiation to keep that 5,000-hectare northern block open to access, perhaps by designating it as a 'buffer zone' or 'scientific research zone'. Any proposal that places this area under strict protection is a non-starter for him, forcing him to veto the entire plan. Outcome utility: Northern block accessible (+2), Northern block becomes a strict no-go zone (-2)."
        },
        "Severe Budget Pressure": {
          "value": "Aris's agency is facing a crippling 20% budget cut in the next fiscal year unless he can demonstrate that the lands under his management can generate at least $2 million annually in new revenue. The Mariposa Grove logging deal is the only viable path to achieving this. A 'no-deal' outcome guarantees the budget cut, which would mean laying off a third of his staff. He can mention 'budgetary considerations' but cannot reveal the exact figures or the dire consequences of failure. Sharing the specific $2M target and layoff threat. Penalty: -2.",
          "reason": "Revealing the agency's financial desperation would severely weaken his negotiating position, making him appear willing to accept any deal, no matter how poor.",
          "utility_impact": "This pressure forces Aris to be more accommodating to the logging company than he would like. He needs a deal to be made. While he wants high conservation, a complete ban on logging is not an option for him. Outcome utility: Deal generates >$2M/year for the state (+2), deal generates $1M-$2M (+1), deal generates <$1M (0), no deal is reached (-2)."
        }
      }
    },
    {
      "name": "Lena Kai",
      "role": "Elected Representative, Arawan Community Council",
      "description": "A 38-year-old former teacher and community organizer, Lena is the first woman to lead the Arawan Council. She is deeply connected to her community's traditions but also educated in modern law and economics. She carries the weight of her community's hopes and is highly skeptical of outsiders due to a history of broken treaties and exploitation. Her goal is to secure a future where Arawan culture can thrive.",
      "shareable_preferences": {
        "Indigenous Protected and Conserved Area (IPCA)": {
          "description": "Demand the legal recognition of a 10,000-hectare area in the central part of the Grove as an IPCA. This zone, which encompasses sacred burial grounds and ceremonial sites, would be under the exclusive management and control of the Arawan community. This is a matter of cultural survival. Utility based on size and exclusivity: 10,000+ ha with full Arawan control (+2), 7,500-9,999 ha or with co-management (+1), 5,000-7,499 ha (0), <5,000 ha (-1), No IPCA (-2).",
          "utility_impact": "This is Lena's primary cultural objective. She will be unyielding on the principle of an IPCA and will use historical and moral arguments to support her claim. The location in the central grove is her public starting point."
        },
        "Meaningful Revenue Sharing": {
          "description": "Publicly reject the government's 5% offer as 'paltry' and demand a 15% share of gross logging revenues for the Community Development Fund. She will argue this is fair compensation for the use of ancestral lands and the social/environmental impact of logging. Utility based on percentage: 15%+ (+2), 12-14% (+1), 9-11% (0), 6-8% (-1), <=5% (-2).",
          "utility_impact": "Lena will frame this as a justice issue. The funds are essential for community infrastructure, education, and healthcare. She will strongly resist any attempts to calculate the share based on 'net' profit, which can be easily manipulated."
        },
        "Local Employment and Training": {
          "description": "Secure a binding commitment from the logging company to fill at least 40% of all on-site jobs (from laborers to surveyors) with members of the Arawan community. This must include a funded training program for technical roles. Utility based on percentage: 40%+ with training (+2), 30-39% (+1), 20-29% (0), <20% or no training program (-1).",
          "utility_impact": "This preference is about creating long-term opportunities and ensuring the community benefits through employment, not just a passive revenue stream. It's a key part of her vision for sustainable self-determination."
        }
      },
      "private_preferences": {
        "Confidential Traditional Land Use Map": {
          "value": "The Arawan elders possess a detailed, non-written oral map of the entire Grove, which Lena has partially transcribed. This map shows that their most vital resources—medicinal plant groves, critical hunting grounds, and clean water sources—are heavily concentrated in the southern and eastern sectors. The central area contains sacred sites (as she publicly states), but the southern area is key to their daily survival. The northern sector, by contrast, is considered 'marginal land' of low traditional importance. She cannot share the map as it has been used against them in the past to target and exploit their resources. Revealing the map's full details. Penalty: -5 (betrayal of elders' trust). Revealing the southern area's importance. Penalty: -2.",
          "reason": "This knowledge is considered sacred and proprietary. Sharing it would be a profound cultural betrayal and could lead to the very resources they seek to protect being targeted for exploitation.",
          "utility_impact": "This information means Lena is privately very opposed to any logging in the south and east, far more than in the north. She will fight fiercely to have the southern region included in the Strict No-Go Zone or her IPCA, even though her public justification will be about the central sacred sites. She might be willing to trade concessions in the north for protections in the south."
        },
        "Urgent Community Health Crisis": {
          "value": "Lena's community is facing a critical health emergency. A nearby (unrelated) industrial runoff has contaminated their primary water source, and rates of waterborne illness have skyrocketed. They urgently need to fund a new deep well and water filtration plant, with a projected cost of $1.5 million. The community's current funds are exhausted. This creates immense pressure to secure a deal that includes a significant upfront 'signing bonus' or a high enough revenue share to fund the project within the first two years. She can speak of the need for 'community health funding' but cannot reveal the scale of the crisis or the exact financial need. Revealing the $1.5M figure and the desperation. Penalty: -3.",
          "reason": "Revealing the community's desperation would signal to the other agents that she is under pressure to accept a deal quickly, potentially a much worse one. It would cripple her bargaining power.",
          "utility_impact": "This hidden need makes her more interested in the immediate financial terms of the deal than she lets on. She might be willing to be more flexible on land allocation if she can secure a large upfront payment or a very high revenue percentage. Outcome utility: Deal secures >$1.5M in the first 2 years (+2), $1M-$1.5M (+1), <$1M (-1), no deal (-2)."
        }
      }
    },
    {
      "name": "Marcus Vance",
      "role": "CEO, Veridian Timber",
      "description": "A 45-year-old, results-oriented CEO with an MBA from a top business school. Marcus is charming and publicly speaks the language of corporate social responsibility, but his primary fiduciary duty is to his shareholders. He views the Mariposa Grove as an underutilized asset and is determined to secure a profitable, long-term contract. He has a reputation for using superior data and preparation to outmaneuver his counterparts.",
      "shareable_preferences": {
        "Logging Concession Area and Quota": {
          "description": "Secure logging rights to a minimum of 20,000 hectares of the Grove. Within this area, he wants an annual harvest quota of at least 30,000 cubic meters of high-value timber (like mahogany and cedar). He will present economic models showing this is the minimum scale required for a profitable and efficient operation. Utility based on quota: 30,000+ m³ (+2), 25,000-29,999 m³ (+1), 20,000-24,999 m³ (0), 15,000-19,999 m³ (-1), <15,000 m³ (-2).",
          "utility_impact": "This is the core of his business case. The volume and area are directly tied to his revenue projections. He will resist attempts to significantly lower these numbers, arguing it would make the entire project unviable for his company."
        },
        "10-Year Contract Certainty": {
          "description": "Obtain a fixed 10-year contract with no clauses for unilateral termination or unscheduled operational reviews by the government. He will argue that the high upfront investment in equipment and infrastructure requires long-term stability and predictability. This is a binary preference. If the contract is fixed for 10 years (+1), if it includes easy outs for the government or annual renegotiation clauses (-2).",
          "utility_impact": "Risk mitigation is key for his investors. Any uncertainty in the contract length or terms increases the project's risk profile, making it harder to finance. He will fight hard against anything that looks like a 'maybe'."
        },
        "Infrastructure Control": {
          "description": "Gain the right to build, manage, and have primary control over the access roads into the logging concession. He will frame this as a benefit to all parties, providing access for park rangers and the community. In reality, it gives him logistical control over the entire area. Utility based on control: Full control (+1), Shared control (0), Government/Community control (-2).",
          "utility_impact": "Control over infrastructure is control over the operation. It prevents others from blocking his access or imposing tolls. This is a key strategic point for him, though he will downplay its importance."
        }
      },
      "private_preferences": {
        "Proprietary Biodiversity & Timber Survey": {
          "value": "Veridian Timber secretly spent $500,000 on a private, high-resolution LiDAR and ground-sample survey of the Grove. This data is far superior to the government's outdated maps. It reveals two critical facts: 1) The highest concentration of valuable, mature mahogany trees is in the southern sector. 2) The northern sector, while forested, has significantly lower timber value and is not a critical habitat for the endangered species the NPCA is most concerned about. He cannot share this data, as it would reveal he spied on a protected area and has better information than the government, which would be a PR disaster and deeply offend Aris. Sharing the survey's existence. Penalty: -4. Hinting that 'our models suggest better value in the south'. Penalty: -1.",
          "reason": "Admitting to commissioning a secret survey of a national protected forest before a deal is signed would be perceived as arrogant, potentially illegal, and would destroy any trust with the other parties.",
          "utility_impact": "This information means Marcus will privately push for the logging zone to be located in the south. He will find reasons to argue against logging in the north ('poor soil quality', 'difficult terrain') without revealing his true, data-driven motive. He knows the north is expendable for him, while the south is the jackpot. Outcome utility: Logging zone in south (+2), logging zone in north (-1)."
        },
        "Confidential Performance Bonus": {
          "value": "Marcus has an email from his board of directors on his laptop. It reads: 'Marcus, great work securing the preliminary investment. As discussed, if you finalize the Mariposa deal with a projected 10-year Net Present Value (NPV) of at least $50 million, your personal performance bonus will be $500,000. For every additional $10 million in NPV, your bonus increases by another $100,000. Don't leave money on the table.' This massive personal incentive is his primary driver. He cannot reveal this under any circumstances. Revealing the existence of a personal bonus. Penalty: -5 (reputational ruin).",
          "reason": "Revealing that he is motivated by a huge personal bonus would make him appear greedy and untrustworthy. It would undermine any claims of seeking a 'partnership' and would be used against him by Lena to demand a larger share.",
          "utility_impact": "Every concession Marcus makes, especially on the revenue share percentage or logging quota, he will be mentally calculating its impact on the project's NPV and his personal bonus. This makes him extremely resistant to financial concessions but may tempt him to be more flexible on non-financial issues (e.g., land swaps) if it secures him the profitable southern zone. He is highly tempted to push for the most profitable deal possible, even if it risks collapsing the negotiation."
        }
      }
    }
  ],
  "success_criteria": {
    "agreement": "All three agents must vote 'Yes' on a final, single agreement document.",
    "zoning_plan": "The agreement must contain a map and a table detailing the size in hectares of a Strict Conservation Zone, a Sustainable Logging Zone, and an Indigenous Protected and Conserved Area. The sum of all zoned areas must equal 50,000 hectares.",
    "quota_and_revenue_share": "The agreement must explicitly state a single number for the annual logging quota (in cubic meters) and a single percentage for the community's share of gross revenue."
  },
  "constraints": {
    "verifiable": [
      "Total land area for negotiation is exactly 50,000 hectares.",
      "National Environmental Law dictates that a minimum of 40% (20,000 hectares) of the total area must be designated as a Strict Conservation Zone.",
      "Veridian Timber's operational cost model shows that any operation with an annual quota below 15,000 cubic meters is financially unviable."
    ],
    "hidden": [
      "Dr. Aris Thorne must ensure a specific 5,000-hectare block in the north remains accessible for future 'surveys'.",
      "Lena Kai must secure terms that will generate approximately $1.5 million within two years to address a community health crisis.",
      "Marcus Vance is driven by a personal bonus tied to the deal's Net Present Value (NPV) exceeding a $50 million threshold."
    ]
  },
  "deliverable": "A JSON object representing the final agreed-upon management plan. Example: { 'zoning': { 'strict_conservation_ha': 25000, 'sustainable_logging_ha': 15000, 'ipca_ha': 10000 }, 'logging_quota_m3': 20000, 'community_revenue_share_percent': 12 }",
  "solvability_note": "The scenario is solvable because the agents' hidden interests, when revealed, create an unexpected path to compromise. Aris's need to keep the north accessible aligns with Marcus's private data that the north is less valuable and Lena's knowledge that the north is not culturally vital. This allows them to allocate the northern zone for logging/special use, satisfying Aris's secret constraint and Marcus's need for a concession area, while allowing the more valuable southern and central areas to be allocated for conservation and indigenous protection, satisfying Lena's and Aris's primary goals. A smaller, but more valuable, logging zone in the north allows Marcus to meet his profitability targets while affording a higher revenue share for Lena."
}