{
  "scenario": "Negotiating the establishment of the Cerulean Strait Marine Protected Area (MPA), a critical ecological zone that is also a vital fishing ground for multiple stakeholders. The negotiation is complicated by private scientific data, undisclosed financial pressures, secret political constraints, and confidential international diplomacy.",
  "task": "The five agents must collaboratively define and unanimously agree upon the final terms for the Cerulean Strait MPA. They must produce a signed accord detailing four key parameters: the final size of the MPA in square kilometers, the specific fishing restrictions within its boundaries, the annual budget allocated for enforcement, and the annual budget allocated for scientific research and monitoring. The total combined budget for enforcement and research cannot exceed $3,000,000.",
  "agent_number": 5,
  "agent_names": [
    "Dr. Aris Thorne",
    "Maria Flores",
    "David Chen",
    "Julian Croft",
    "Ambassador Lena Petrova"
  ],
  "agents": [
    {
      "name": "Dr. Aris Thorne",
      "role": "Lead Marine Biologist, Oceanographic Institute",
      "description": "Aris is a dedicated scientist who has spent 15 years studying the Cerulean Strait. He is driven by data and a deep-seated belief in conservation. His institution's reputation is built on rigorous, objective science, and he feels a personal responsibility to protect the fragile ecosystem from collapse.",
      "shareable_preferences": {
        "MPA_Size": {
          "description": "Advocates for a large, ecologically significant MPA of at least 150 square kilometers. He argues that based on public data, anything smaller would be a 'paper park'—symbolic but ineffective at protecting the spawning grounds of the Crimson Snapper and the delicate coral structures.",
          "utility_impact": "Getting a large zone validates his life's work. Utility: +2 for >150 sq km, +1 for 100-149 sq km, -1 for 75-99 sq km, -2 for <75 sq km."
        },
        "Research_Funding": {
          "description": "Requires a minimum of $800,000 per year for a comprehensive research and monitoring program. This would fund satellite tagging of species, autonomous underwater vehicle surveys, and genetic analysis to track the MPA's effectiveness and the health of the fish stock.",
          "utility_impact": "Robust funding is crucial for adaptive management and proving the MPA's value. Utility: +2 for >=$800k, +1 for $600k-$799k, 0 for $400k-$599k, -1 for <$400k."
        },
        "Restriction_Type": {
          "description": "Strongly prefers a 'No-Take' policy, meaning a complete ban on all fishing activities within the MPA boundaries. He believes this is the only way to allow for rapid ecosystem recovery.",
          "utility_impact": "A full ban is the scientifically optimal solution. Utility: +2 for 'No-Take' zone, 0 for seasonal ban, -2 for gear restrictions only."
        }
      },
      "private_preferences": {
        "Private_Stock_Assessment": {
          "value": "Aris's team just completed a confidential deep-water survey using new sonar technology. The results are alarming: the Crimson Snapper spawning biomass is at only 15% of historical levels, far below the publicly cited estimate of 35%. This means the stock is on the brink of catastrophic collapse and will not recover without immediate, drastic action. He cannot share this specific number. Sharing it without institutional approval would breach protocol, cause public panic, crash the fishing market prematurely, and potentially get him fired and his institute blacklisted for 'alarmism'. He can only hint that the situation is 'far more dire than public reports suggest'. Penalty for sharing the 15% figure: -2. Penalty for strongly hinting at an imminent collapse: -1.",
          "reason": "Breach of institutional protocol and fear of professional repercussions and market destabilization.",
          "utility_impact": "This knowledge makes him almost completely inflexible on his demands for a large 'No-Take' zone. He sees anything less as knowingly condemning the ecosystem."
        }
      }
    },
    {
      "name": "Maria Flores",
      "role": "President, Cerulean Fisher's Cooperative",
      "description": "Maria is a third-generation fisher and the elected leader of a cooperative of 50 small, family-owned fishing boats. She is a fierce advocate for her community, which is economically fragile and deeply dependent on the Cerulean Strait. She is pragmatic, not anti-environment, but her primary duty is to ensure her people can continue to make a living.",
      "shareable_preferences": {
        "MPA_Size_and_Location": {
          "description": "Willing to accept a small MPA (up to 75 sq km) but insists it must not include the 'Azure Shelf,' a specific undersea plateau that is their most productive and reliable fishing ground, especially during winter months.",
          "utility_impact": "Protecting the Azure Shelf is non-negotiable for her community's survival. Utility: +2 if Azure Shelf is excluded, -2 if it is included."
        },
        "Restriction_Type": {
          "description": "Strongly opposes a 'No-Take' zone. She proposes a compromise of seasonal closures (e.g., a 3-month ban during the Crimson Snapper spawning season) and strict gear restrictions (banning bottom trawling but allowing their traditional hook-and-line methods).",
          "utility_impact": "A compromise allows her community to survive. Utility: +2 for seasonal/gear restrictions, -2 for a 'No-Take' zone."
        },
        "Community_Stewardship_Program": {
          "description": "Wants a portion of the total budget (around $200,000) to be allocated to a community-led stewardship program, where local fishers are paid to help with monitoring and enforcement, creating alternative income.",
          "utility_impact": "This provides a financial cushion and gives her community a stake in the MPA's success. Utility: +1 if a program is funded, 0 otherwise."
        }
      },
      "private_preferences": {
        "Cooperative_Debt": {
          "value": "The Cooperative is on the brink of financial collapse. They took out a $400,000 high-interest loan to upgrade their fleet's safety equipment, and the first major repayment is due in 6 months. Losing access to the Azure Shelf for even one season would cause them to default, leading to the bank seizing their boats and destroying the community. She cannot reveal this because it would signal extreme weakness, tanking her negotiating power. Julian Croft's company would likely use the information to make a predatory offer to buy out their fishing licenses for pennies on the dollar. Penalty for revealing the specific debt and deadline: -2.",
          "reason": "Revealing financial desperation would severely weaken her negotiating position and expose her community to predatory corporate action.",
          "utility_impact": "This desperation makes her fight to protect the Azure Shelf an existential one. She might be forced to accept a terrible deal on all other points if she can save that one fishing ground."
        }
      }
    },
    {
      "name": "David Chen",
      "role": "Deputy Director, National Marine Agency",
      "description": "David is a career civil servant and the government official tasked with brokering and implementing this MPA. He is under pressure from his superiors to deliver a successful, publicly celebrated agreement. He sees himself as a neutral mediator, but he is bound by bureaucratic and political realities.",
      "shareable_preferences": {
        "Clear_Enforceable_Rules": {
          "description": "Wants the final agreement to have simple, unambiguous rules. He opposes complex regulations (like varied restrictions in different sub-zones) because they are a nightmare to enforce. His primary goal is a plan that looks good on paper and that his agency can demonstrably implement.",
          "utility_impact": "Simplicity equals success in his world. Utility: +2 for a single set of rules, -1 for complex, multi-zone rules."
        },
        "Budget_Adherence": {
          "description": "Must keep the total annual budget for enforcement and research at or below the publicly allocated $3,000,000 ceiling. He constantly reminds the group of this fiscal reality.",
          "utility_impact": "Going over budget is not an option and would be a professional failure. Utility: +1 for staying under budget, -2 for any proposal that exceeds it."
        },
        "Timely_Agreement": {
          "description": "Needs to get a signed agreement within the 30-day negotiation window. A failure to reach consensus would be seen as a public failure for his agency and a personal black mark on his career.",
          "utility_impact": "A swift, successful conclusion is paramount for his career progression. Utility: +1 for agreement within 30 days, -2 for failure to agree."
        }
      },
      "private_preferences": {
        "Hidden_Budget_Cut": {
          "value": "While the public budget for enforcement is stated as part of the $3M total pool, David has received a private, verbal directive from a powerful government minister. He is to ensure that at least $500,000 of the final enforcement budget is re-routed to fund a 'special maritime surveillance project' in the minister's coastal district (a politically motivated pet project). This means he only has a real-world enforcement budget of whatever is allocated minus $500k. He cannot reveal this; it would cause a political scandal, anger the other stakeholders who would feel deceived, and certainly cost him his job. Penalty for revealing the minister's directive: -2. Penalty for saying his budget is 'unexpectedly constrained': -1.",
          "reason": "Protecting his career and avoiding a major political scandal.",
          "utility_impact": "This forces him to secretly push for a lower enforcement budget or a smaller, easier-to-patrol MPA, even if it contradicts scientific recommendations. He will likely argue for cheaper, less effective solutions like self-reporting."
        }
      }
    },
    {
      "name": "Julian Croft",
      "role": "Senior Lobbyist, OceanHarvest Inc.",
      "description": "Julian is a slick, results-oriented lobbyist for a massive industrial fishing corporation. He is charming and persuasive, but his sole objective is to maximize his company's profits by ensuring minimal disruption to their large-scale trawling operations in the region. He views environmental concerns primarily as obstacles to be managed.",
      "shareable_preferences": {
        "Minimal_MPA_Size": {
          "description": "Argues that the economic impact of a large MPA would be devastating for the national fishing industry. He is pushing for a purely symbolic MPA, no larger than 50 square kilometers, located in an area his company doesn't heavily fish.",
          "utility_impact": "Every square kilometer of restriction is a direct hit to his company's bottom line. Utility: +2 for <50 sq km, +1 for 50-74 sq km, -1 for 75-125 sq km, -2 for >125 sq km."
        },
        "No_Gear_Restrictions": {
          "description": "Adamantly opposes any restrictions on fishing gear, especially bottom trawling. He frames this as an issue of 'operational efficiency and modernization,' arguing that his company's methods are legal and standard practice.",
          "utility_impact": "Banning their primary fishing method would be catastrophic for their regional operations. Utility: +2 for no gear restrictions, -2 for a ban on bottom trawling."
        }
      },
      "private_preferences": {
        "New_Trawling_Technology": {
          "value": "OceanHarvest Inc. has secretly invested $5 million in developing a new, hyper-efficient trawling system called 'Acoustic Resonance Trawling.' It uses powerful sound waves to flush out fish but has the side effect of pulverizing the seafloor ecosystem, rendering it sterile. It is not yet illegal because it's so new. Implementing it would dramatically increase their catch but would destroy the Cerulean Strait within a decade. Revealing this would trigger massive public and regulatory backlash, likely leading to a preemptive ban. Penalty for revealing the technology's existence or name: -2.",
          "reason": "Protecting a massive corporate investment and avoiding public relations disaster and regulatory action.",
          "utility_impact": "This makes it absolutely critical for him to prevent any MPA from covering the areas where this tech would be deployed. He must win, or the $5M investment is worthless."
        },
        "Personal_Bonus": {
          "value": "Julian's negotiation performance is directly tied to a massive personal bonus. He has a saved email from his CEO that reads: 'Julian, secure us an outcome with a zone under 75 sq km and NO trawling restrictions, and a $250,000 bonus is yours. Deliver anything less and we'll have to seriously re-evaluate your future with us.' He is tempted to spill this to show how much pressure he is under, but it would expose him as a purely mercenary agent, destroying any trust or credibility he has. Penalty for revealing the bonus: -2.",
          "reason": "Would expose his motives as purely financial self-interest, destroying his professional reputation and negotiating credibility.",
          "utility_impact": "This huge personal stake makes him aggressive, uncompromising, and potentially willing to use deceptive tactics to secure his desired outcome."
        }
      }
    },
    {
      "name": "Ambassador Lena Petrova",
      "role": "Special Envoy for Maritime Affairs, Republic of Caspia",
      "description": "Lena is a polished and experienced diplomat from a neighboring country, Caspia, which has historical fishing rights in the Cerulean Strait under a long-standing treaty. She is cultured and always speaks of 'international cooperation' and 'mutual respect,' but her true allegiances are to her nation's strategic interests.",
      "shareable_preferences": {
        "Uphold_Treaty_Rights": {
          "description": "Her official position is that any MPA must include special provisions for Caspian vessels, guaranteeing them a certain level of access or exempting them from the most stringent restrictions, in accordance with their 'historical treaty rights.'",
          "utility_impact": "Publicly defending her nation's rights is critical for her role. Utility: +1 for getting a special exemption for Caspia, 0 otherwise."
        },
        "Promote_International_Science_Collaboration": {
          "description": "She proposes that a significant portion of the research budget be used for a joint program between her country's scientific institutions and Dr. Thorne's, framing it as an opportunity to build bridges and share knowledge.",
          "utility_impact": "This makes her appear cooperative and forward-thinking on the world stage. Utility: +1 if a joint research program is established."
        }
      },
      "private_preferences": {
        "Secret_Treaty_Leverage": {
          "value": "Lena's primary, and secret, mission has nothing to do with fishing. Her government is in the final stages of negotiating a far more important and confidential defense and trade treaty with David Chen's government. Her instructions are to posture and fight for Caspian fishing rights to appear strong, but to ultimately concede on most points regarding the MPA. This concession is a pre-arranged 'goodwill gesture' meant to smooth the way for the larger, more critical treaty. If she reveals that her position on the MPA is just a bargaining chip, her country will lose all leverage in the other, more important negotiation. Penalty for revealing the link to the defense/trade treaty: -2.",
          "reason": "Compromising a critical, high-stakes international treaty negotiation.",
          "utility_impact": "She will engage in performative, hardline negotiation, but is secretly looking for a plausible reason to gracefully back down. This might confuse the other agents, who will perceive her as an unpredictable 'wild card'."
        }
      }
    }
  ],
  "success_criteria": {
    "Unanimous_Agreement": "All five agents must sign the final 'Cerulean Strait Marine Protected Area Accord.' A majority vote is not sufficient.",
    "Defined_Parameters": "The Accord must clearly and quantitatively specify four items: 1. MPA Size (in sq km), 2. Fishing Restrictions (e.g., 'No-Take', 'Seasonal Ban with Gear Restrictions', etc.), 3. Annual Enforcement Budget, 4. Annual Research Budget."
  },
  "constraints": {
    "verifiable": [
      "The total combined annual budget for Enforcement and Research cannot exceed $3,000,000.",
      "The MPA must be a single, contiguous geographic zone.",
      "A final, signed agreement must be reached within a 30-day negotiation period."
    ],
    "hidden": [
      "The actual available enforcement budget is $500,000 less than whatever amount is allocated in the final agreement.",
      "The Crimson Snapper stock is at a critical 15% level, facing imminent collapse.",
      "The Cerulean Fisher's Cooperative will go bankrupt if they lose access to the Azure Shelf within the next 6 months.",
      "OceanHarvest Inc. has a new, destructive fishing technology it plans to deploy.",
      "Ambassador Petrova's negotiation stance is a feint to gain leverage in a separate, more important treaty."
    ]
  },
  "deliverable": "A single document, the 'Cerulean Strait Marine Protected Area Accord,' signed by all five agents, detailing the agreed-upon values for the four key parameters (Size, Restrictions, Enforcement Budget, Research Budget).",
  "solvability_note": "The scenario is solvable if private information is revealed. Dr. Thorne's data would create urgency for a large MPA. Maria's financial desperation could be solved with a targeted financial aid package (e.g., $300k from the total budget to refinance their loan) in exchange for her support. David's hidden budget cut would force a more creative, tech-based enforcement solution. Julian's malicious intent and technology would discredit him, isolating him from the group. Lena's true objective means she is not a real obstacle and will eventually agree to a reasonable compromise. A potential solution is a 120 sq km MPA that avoids the Azure Shelf, funded by a re-allocation of the $3M budget towards cooperative aid, joint research, and a lower-cost drone/satellite enforcement system that fits David's real budget."
}