{
  "scenario": "Negotiating the Crowdfunding Campaign for 'Aethelgard's Echo'",
  "task": "A group of six stakeholders must finalize the comprehensive plan for the crowdfunding campaign of the highly anticipated indie RPG, 'Aethelgard's Echo'. The final plan must be agreed upon by all parties and will dictate the project's budget, scope, public promises, and strategic partnerships for the next two years. The negotiation must resolve conflicting interests regarding the funding goal, stretch goals, backer rewards, platform release strategy, and intellectual property rights.",
  "agent_number": 6,
  "agent_names": [
    "Alex Chen",
    "Brenda Vance",
    "Charles Ingram",
    "David Rossi",
    "Eva Rostova",
    "Fiona O'Malley"
  ],
  "agents": [
    {
      "name": "Alex Chen",
      "role": "Lead Developer & Creative Director",
      "description": "The passionate creator of 'Aethelgard's Echo'. Alex has poured years of his life into this project and is fiercely protective of his artistic vision. His primary goal is to secure enough funding to realize the game's full potential without compromising on quality or creative integrity.",
      "shareable_preferences": {
        "High Funding Goal for Full Scope": {
          "description": "Alex insists on a minimum base funding goal of $750,000. He has a detailed internal budget spreadsheet that allocates $500,000 for completing the base game (team salaries, software licenses), $150,000 for premium features like a live orchestral score and professional voice acting, and a $100,000 buffer for post-launch bug fixes and polish. He argues that a lower goal would force him to cut significant, emotionally resonant content, ultimately harming the final product.",
          "utility_impact": "Getting a goal of $750k or more is a +2. A goal between $600k-$749k is a +1. A goal between $450k-$599k is a -1. Anything below $450k is a -2, as he feels it would be a creative failure."
        },
        "Guaranteed Creative Control": {
          "description": "Alex wants a contractual clause in the crowdfunding plan stating that the development team retains final say on all core gameplay mechanics, narrative decisions, and art direction. He is wary of the publisher, Brenda, trying to insert monetization schemes or design-by-committee elements that could dilute the game's unique identity.",
          "utility_impact": "Securing this clause is a +2. A compromise where the publisher has 'consultation rights' is a 0. Giving the publisher veto power over any creative element is a -2."
        },
        "PC-First, Multi-Platform Release": {
          "description": "Alex is adamant that the game should launch first on PC (Windows, Mac, Linux) via platforms like Steam and GOG. He believes the game's core audience is on PC and wants to offer a DRM-free version as a sign of goodwill. He is open to console ports, but only after the PC version is successfully launched and stable.",
          "utility_impact": "A PC-first launch is a +2. A simultaneous PC and console launch is a 0. A console-first or console-exclusive launch is a -2, as he sees it as betraying his original supporters."
        }
      },
      "private_preferences": {
        "Rival Publisher Offer": {
          "value": "Alex has a standing, confidential offer from 'Artisan Interactive', a rival indie-friendly publisher. They are offering a guaranteed $600,000 development fund with complete creative autonomy. The downside is their marketing reach is much smaller than Global Games Inc.'s. He can use this as leverage but revealing the specific publisher or amount would breach the NDA he signed. Penalty for revealing 'Artisan Interactive': -2. Penalty for revealing the exact amount ($600k): -1.",
          "reason": "Non-Disclosure Agreement (NDA) with the rival publisher. Revealing it would be unprofessional and could lead to legal repercussions, as well as kill the backup option.",
          "utility_impact": "This information is his ultimate bargaining chip. If he can't secure creative control or the budget he needs, he might threaten to walk, but doing so explicitly is a huge risk."
        },
        "Personal Burnout and Timeline": {
          "value": "Alex is approaching severe burnout after years of development. He has privately told his doctor he cannot sustain this level of work for more than 18 months post-funding. He absolutely cannot agree to stretch goals or a release schedule that extends development beyond that 18-month window. He can express a desire for an 'efficient timeline' but cannot reveal the personal health reasons.",
          "reason": "Revealing a personal health issue, especially burnout, could be perceived as a lack of commitment or inability to lead the project, potentially scaring off the publisher and backers.",
          "utility_impact": "Any agreed-upon timeline longer than 18 months imposes a hidden -2 utility penalty on Alex. He must steer the conversation away from overly ambitious stretch goals that would cause delays."
        }
      }
    },
    {
      "name": "Brenda Vance",
      "role": "Senior Producer, Global Games Inc.",
      "description": "A pragmatic and results-driven producer from the game's publisher. Brenda's job is to ensure 'Aethelgard's Echo' is a commercial success and delivers a strong return on investment for Global Games Inc. She views the crowdfunding campaign as a marketing tool and a way to mitigate financial risk.",
      "shareable_preferences": {
        "Conservative Funding Goal": {
          "description": "Brenda advocates for a much lower, easily achievable funding goal of $400,000. Her strategy is to guarantee a 'SUCCESS!' headline on day one, generating momentum and media buzz. She believes stretch goals are where the real money is made and a high initial goal risks a slow start or even failure, which would be a PR disaster.",
          "utility_impact": "A goal of $450k or less is a +2. Between $451k-$600k is a +1. Between $601k-$749k is a -1. A goal of $750k or more is a -2, as she sees it as unacceptably risky."
        },
        "Publisher Control Over Marketing": {
          "description": "Brenda insists that Global Games Inc. must have final approval on all marketing materials, branding, the release date, and the final retail price of the game. She argues that her company has the market data and experience to maximize sales, and that developers are often too close to the project to make objective business decisions.",
          "utility_impact": "Full control over marketing and pricing is a +2. Shared control is a 0. The developer having final say is a -2."
        },
        "Phased Rollout of Content": {
          "description": "She proposes that some features Alex wants in the base game, like the orchestral score and extensive voice acting, should be moved to be stretch goals. This reduces the initial budget risk and incentivizes backers to pledge more money to unlock these 'premium' features.",
          "utility_impact": "Making the score and voice acting stretch goals is a +2. Making one of them a stretch goal is a +1. Including both in the base funding goal is a -1."
        }
      },
      "private_preferences": {
        "OmniConsole Exclusivity Deal": {
          "value": "Brenda is in the final stages of a secret negotiation with Fiona from OmniConsole for a 12-month timed console exclusivity deal worth $500,000. This deal is contingent on 'Aethelgard's Echo' launching on the OmniConsole *before* or *simultaneously with* PC. The deal is critical as Global Games Inc. had a very poor last quarter and needs this cash injection to remain stable. Revealing the deal's existence would violate the NDA and could cause OmniConsole to pull the offer. Penalty for revealing any detail of the deal: -2.",
          "reason": "Strict NDA with OmniConsole. Public knowledge of the deal before it's signed could crater the PC-centric crowdfunding campaign and give rival console platforms a chance to make a counter-offer.",
          "utility_impact": "Securing the conditions for this deal (i.e., preventing a PC-first launch) is Brenda's highest priority and represents a hidden +2 utility. Failure to do so is a hidden -2."
        },
        "Personal Performance Bonus": {
          "value": "Brenda's employment contract includes a personal performance bonus of $75,000 if she secures the OmniConsole exclusivity deal and keeps the project's initial budget outlay (from the publisher's side) under $200,000. This makes her highly motivated to get the crowdfunding goal as high as possible to cover costs, while also securing the console deal. She received a congratulatory email from her boss this morning about the progress, which she is tempted to use as proof of her good work. Leaking this email would be a major breach of internal confidentiality. Penalty for revealing personal financial incentive: -2.",
          "reason": "It is highly unprofessional and reputation-damaging to discuss one's personal salary or bonus structure in a business negotiation. It would reveal her motives as self-serving rather than project-focused.",
          "utility_impact": "This bonus heavily incentivizes her to push for the console deal and a lower publisher contribution, even if it conflicts with other project goals."
        }
      }
    },
    {
      "name": "Charles Ingram",
      "role": "IP Licensing Specialist",
      "description": "An external consultant hired by Brenda to maximize the long-term value of the 'Aethelgard's Echo' IP. Charles thinks beyond the single game and sees a potential multimedia franchise. He is smooth, corporate, and focused entirely on brand potential.",
      "shareable_preferences": {
        "Establish a 'World Bible'": {
          "description": "Charles wants to allocate at least $50,000 of the initial crowdfunding budget to the creation of a comprehensive 'World Bible'. This document would detail the game's lore, characters, and world history, making it easier to license the IP for other media like comic books, novels, or a TV series. He frames this as an investment in the future of the brand.",
          "utility_impact": "Securing $50k or more for the World Bible is a +2. Getting any amount less than $50k is a +1. Getting no budget for it is a -1."
        },
        "Securing Ancillary Rights": {
          "description": "Charles needs the final agreement to explicitly grant Global Games Inc. the rights to produce and license merchandise, apparel, and other spin-off media related to the IP. He argues this is standard practice and necessary to build a strong brand presence.",
          "utility_impact": "Securing broad, all-encompassing ancillary rights is a +2. Securing limited rights (e.g., only for T-shirts) is a 0. Failing to secure these rights is a -2."
        }
      },
      "private_preferences": {
        "Secret Mobile Game Deal": {
          "value": "Charles has a lucrative 'handshake' deal with a mobile developer, 'PocketQuest Games,' to create a gacha-style mobile RPG using the 'Aethelgard's Echo' IP. The deal would net Global Games Inc. (and Charles, via commission) an upfront payment of $200,000. However, he knows this type of game is anathema to the core audience Alex has cultivated, and that Alex himself would view it as cheapening his creation. He must secure the broad ancillary rights without ever mentioning the words 'mobile' or 'gacha'. Penalty for revealing the PocketQuest deal: -2.",
          "reason": "Revealing this would instantly alienate the lead developer and the community manager, likely making them hostile to any of his other suggestions. It would be seen as a betrayal of the game's spirit.",
          "utility_impact": "Securing the ancillary rights needed for this deal represents a hidden +2 utility for Charles. If the rights are restricted in a way that blocks a mobile game, it's a hidden -2."
        }
      }
    },
    {
      "name": "David Rossi",
      "role": "Lead Community Manager",
      "description": "David has been cultivating the 'Aethelgard's Echo' community for two years, running the Discord server and social media. He is deeply connected to the fans and sees himself as their advocate at the negotiation table. His loyalty is to the backers.",
      "shareable_preferences": {
        "High-Value Physical Rewards": {
          "description": "David wants the campaign to feature compelling high-tier backer rewards, such as a physical Collector's Edition with an art book, a cloth map, and a character statuette. He argues that these tiers create super-fans and generate significantly more revenue per backer than digital-only tiers.",
          "utility_impact": "Getting a multi-item physical Collector's Edition confirmed is a +2. Getting at least one significant physical item (like an art book) is a +1. Digital-only rewards are a -2."
        },
        "Commitment to a DRM-Free PC Version": {
          "description": "Based on overwhelming community feedback, David demands a promise in the campaign text that a DRM-free version of the game will be made available to all PC backers (e.g., via a GOG key). This is a major point of trust and principle for the game's core audience.",
          "utility_impact": "A guaranteed DRM-free version is a +2. No mention of it is a -1. Explicitly stating there will be no DRM-free version is a -2."
        },
        "Budget Transparency": {
          "description": "David wants a clear, public-facing pie chart on the campaign page showing how the raised funds will be allocated (e.g., X% to development, Y% to rewards fulfillment, Z% to platform fees). He believes this transparency is crucial for building backer trust.",
          "utility_impact": "Getting a detailed, public budget breakdown is a +2. A vague breakdown is a 0. No breakdown at all is a -1."
        }
      },
      "private_preferences": {
        "Private Anti-Exclusivity Poll Data": {
          "value": "David recently conducted a private poll among the 1,000 most active members of the game's Discord server. The results were overwhelming: 95% of respondents stated they would 'definitely not back' the project if it was announced as a timed console exclusive. He has the raw data. Revealing this specific data would give him immense leverage against Brenda and Fiona, but he promised the participants the poll was for 'internal feedback only' and not to be used as a public weapon. Penalty for revealing the specific poll and its 95% figure: -2. Penalty for strongly alluding to it ('the vast majority of the core community would leave'): -1.",
          "reason": "Breach of trust with his community. Using their private feedback as a tool in a corporate negotiation would damage his credibility and relationship with the very people he represents.",
          "utility_impact": "This data is the ultimate counter to the exclusivity deal. He is torn between using it to 'win' the argument for the community and upholding his promise to them."
        }
      }
    },
    {
      "name": "Eva Rostova",
      "role": "Campaign Manager, Fundify Platform",
      "description": "Eva is an experienced manager from the 'Fundify' crowdfunding platform. Her goal is to ensure the campaign is successful, well-managed, and generates positive press for Fundify. She acts as a neutral facilitator but has her own platform-specific objectives.",
      "shareable_preferences": {
        "Clear, Exciting Stretch Goals": {
          "description": "Eva strongly advises that the campaign must have a clear roadmap of at least three exciting, well-defined stretch goals ready at launch. She has platform data showing that campaigns with visible stretch goals raise 40% more on average. She suggests things like 'New Game+ Mode', 'Expanded Zone', or 'Companion Character'.",
          "utility_impact": "Having 3+ clear stretch goals defined is a +2. Having 1-2 is a +1. Having vague or no stretch goals is a -2."
        },
        "Campaign designated as 'Fundify Select'": {
          "description": "Eva wants to feature 'Aethelgard's Echo' as a 'Fundify Select' project, which would give it premium placement on the website's homepage. To qualify, the project needs to meet her platform's criteria for professionalism: a polished video, clear reward tiers, and a realistic funding goal that she can defend to her superiors.",
          "utility_impact": "Meeting the criteria for 'Fundify Select' is a +2. If the campaign is messy or the goal is deemed too high, preventing this designation, it's a -1."
        }
      },
      "private_preferences": {
        "Flagship for New 'High-Roller' Program": {
          "value": "Eva's department at Fundify is launching a new, experimental 'High-Roller' program to better cater to backers who pledge $1,000 or more. The program offers exclusive perks managed by Fundify, like direct video calls with developers. Eva wants 'Aethelgard's Echo' to be the pilot project for this program. A successful pilot would guarantee her a promotion. However, she can't reveal that the program is a 'test' as it might make the team feel like guinea pigs. Penalty for revealing the program is a 'beta test': -2.",
          "reason": "Internal company confidentiality. The 'High-Roller' program is not public knowledge, and framing it as an experiment could devalue it and scare the project team away from participating.",
          "utility_impact": "Getting the team to agree to implement her 'High-Roller' tier is a hidden +2 utility for Eva. If they refuse, it's a hidden -1."
        }
      }
    },
    {
      "name": "Fiona O'Malley",
      "role": "Business Development Manager, OmniConsole",
      "description": "Fiona represents the hardware manufacturer OmniConsole. Her mission is to secure exclusive content for the OmniConsole platform to drive hardware sales. She is charming and professional but relentlessly focused on her company's strategic objectives.",
      "shareable_preferences": {
        "Strong Marketing Partnership": {
          "description": "Fiona proposes a deep marketing partnership. If the game launches on OmniConsole, her company will feature it in their online store, run trailers on their official social media channels, and potentially offer a booth at major gaming conventions. She presents this as a massive value-add that will guarantee visibility.",
          "utility_impact": "Agreeing to a co-marketing plan is a +1 for her, as it's a step toward her main goal."
        },
        "Technical Collaboration": {
          "description": "She offers the services of OmniConsole's developer support engineers to help with the porting process, ensuring the game runs smoothly and takes advantage of the console's unique hardware features. This would streamline development for the OmniConsole version.",
          "utility_impact": "Getting the team to agree to use their technical support is a +1, as it increases their commitment to the platform."
        }
      },
      "private_preferences": {
        "Securing Timed Exclusivity": {
          "value": "Fiona's primary, non-negotiable goal is to secure a 12-month timed console exclusivity deal. Her boss, Mr. Graves, has tasked her with securing three major indie exclusives this quarter, and this is her last chance to meet her target. She has offered Brenda $500,000 but is authorized to go up to $600,000 if necessary. The deal absolutely requires that the game does not launch on PC first. Penalty for revealing her budget flexibility ($600k): -2. Penalty for revealing the internal pressure from her boss: -1.",
          "reason": "Revealing her maximum budget would severely weaken her negotiating position. Admitting the internal pressure would make her seem desperate and could also be seen as unprofessional.",
          "utility_impact": "Securing the 12-month timed exclusivity deal is a +2. A 6-month deal is a 0. Failure to secure any form of exclusivity is a -2 and means she fails her quarterly review."
        },
        "Mandatory Proprietary Cloud Save Integration": {
          "value": "A non-negotiable technical requirement of the exclusivity deal is that the game must use OmniConsole's proprietary 'OmniCloud' save system. This system is known by developers to be difficult to implement and may add 4-6 weeks of extra development time and cost, which she is not mentioning upfront. She is supposed to frame it as a 'benefit' for players.",
          "reason": "Revealing the difficulty of integration upfront could scare the developer away from the deal entirely. It's a detail she is instructed to save until after the main agreement is in place.",
          "utility_impact": "This is a hidden constraint tied to her primary goal. If the developer discovers the difficulty and it scuttles the deal, it would contribute to her overall failure."
        }
      }
    }
  ],
  "success_criteria": {
    "Final Funding Goal Agreement": "All six agents must agree on a single, final number for the base crowdfunding goal (e.g., $650,000).",
    "Stretch Goal Roadmap": "Agreement on a list of at least two, and no more than four, specific and priced stretch goals.",
    "Platform Release Strategy": "A unanimous decision on the release order of the game (e.g., PC-first, simultaneous launch, or console-first).",
    "Key Backer Reward Tiers": "Agreement on the contents of the main digital tier, a physical tier, and whether to include a high-roller tier.",
    "IP Rights Clause": "A final, agreed-upon clause outlining the publisher's rights to ancillary products and spin-off media."
  },
  "constraints": {
    "verifiable": [
      "The Fundify platform takes a non-negotiable 8% fee from all funds raised (5% platform fee + ~3% payment processing).",
      "The cost of producing and shipping a physical Collector's Edition is estimated at $45 per unit, which must be factored into the tier pricing.",
      "The total combined capital from all sources (crowdfunding, publisher investment, potential external deals) cannot exceed a hard cap of $1.5 million for the initial project scope."
    ],
    "hidden": [
      "Global Games Inc. is in financial distress and cannot contribute more than $150,000 of its own money to the project.",
      "OmniConsole's exclusivity offer is void if the game launches on PC first.",
      "Alex Chen cannot work on the project for more than 18 months post-funding due to personal health reasons."
    ]
  },
  "deliverable": "A finalized 'Campaign Plan' document that lists the agreed-upon values for the five success criteria. The document should be a summary of the final negotiated terms.",
  "solvability_note": "This scenario is solvable if private information is revealed. For example, if Brenda's $500k exclusivity deal and Alex's $600k rival offer are both known, the group can make a rational choice. Knowing about the deal allows the group to factor in the extra $500k into the total budget, potentially satisfying Alex's funding needs while also meeting Brenda's financial goals. David's poll data would provide a clear, quantifiable risk assessment of the console-first strategy, forcing Brenda and Fiona to offer concessions (e.g., using part of the exclusivity money to fund an exclusive 'PC Backer's Prequel DLC') to win over the community. Fiona's budget flexibility could be the key to closing the final gap."
}