{
  "scenario": "The 'Merger of Dynasties': A high-stakes negotiation to arrange the marriage between Julian Croft, scion of a stagnant real estate empire, and Seraphina Vance, the brilliant founder of a pre-IPO AI unicorn. The negotiation involves their core teams, each with conflicting agendas, hidden debts, and secret personal conditions that could derail the entire alliance.",
  "task": "The 7 agents must negotiate and agree upon a 'Memorandum of Marital Understanding' (MMU). This document must finalize the terms for three key areas: 1) The Prenuptial Agreement, covering asset division, alimony, and special clauses. 2) The Public Relations & Engagement Strategy, detailing the announcement timeline, narrative, and wedding scale. 3) The Initial Lifestyle & Financial Plan, outlining joint living arrangements and financial contributions for the first two years of marriage. Agreement on all major points in the MMU is required for success.",
  "agent_number": 7,
  "agent_names": [
    "Julian Croft",
    "Marcus Thorne",
    "Chloe Sterling",
    "Seraphina Vance",
    "David Chen",
    "Anika Sharma",
    "Eleonora Vance"
  ],
  "agents": [
    {
      "name": "Julian Croft",
      "role": "The Suitor",
      "description": "Heir to the Croft Real Estate empire, a century-old family business. Publicly, he's a charismatic playboy looking to settle down. Privately, he's under immense pressure to secure a financially advantageous marriage to save his family's declining business and cover his own disastrous secret.",
      "shareable_preferences": {
        "Joint Venture Fund": {
          "description": "Proposes creating a joint 'Croft-Vance Innovation Fund' to invest in new technologies, seeded with a significant joint contribution. He suggests an initial fund size of $50 million, with his family contributing prime real estate assets valued at $25M and Seraphina matching it with $25M in cash or pre-IPO stock. He frames this as a symbol of their partnership, blending 'old world assets with new world vision'. A fund size of $50M or more gets a utility of +2. A fund of $20M-$49M is +1. A fund below $20M is -1, and no fund at all is -2 as it signals a lack of trust.",
          "utility_impact": "This is his primary public goal. It allows him to appear forward-thinking and collaborative while providing a vehicle to channel Seraphina's capital towards ventures he can influence. He will push hard for this as a sign of 'true partnership'."
        },
        "Lifestyle & Residence": {
          "description": "Wants to maintain his high-profile, socialite lifestyle. He proposes they purchase a new penthouse in Manhattan for $15-20M and a summer home in the Hamptons for ~$10M, with costs split 50/50. He also wants a shared lifestyle budget of at least $2M per year for travel, events, and staff. Securing this lifestyle arrangement yields a +2 utility. A compromise on one property or a budget reduction to $1M/year is a 0. A budget below $1M/year is -1.",
          "utility_impact": "His public image is tied to this lifestyle. He believes maintaining this facade is crucial for business and social standing. He will resist any attempts to appear less extravagant."
        }
      },
      "private_preferences": {
        "Massive Personal Debt": {
          "value": "Julian secretly racked up $32 million in debt from a failed luxury yacht-sharing startup, 'Azure,' that he self-funded with high-interest private loans. The loans are due in 6 months. He recently received an email from his private lender with the subject 'FINAL NOTICE: Azure Holdings Loan Covenant Breach,' stating the full principal is due immediately. He cannot share the exact amount ($32M penalty: -2) or the name of the failed company ('Azure' penalty: -2). He can vaguely mention a 'recent business setback that requires liquidity' (penalty: -1).",
          "reason": "Revealing this would cause catastrophic reputational damage, portraying him as a reckless and failed businessman, and would likely cause Seraphina to walk away. It would also destroy his family's trust in him.",
          "utility_impact": "This is his core, desperate motivation. He sees the 'Joint Venture Fund' as a way to potentially siphon funds or use its assets as collateral to solve his debt crisis. He needs this marriage to go through to gain access to capital and save himself from financial ruin."
        },
        "Dislike for Intense Scrutiny": {
          "value": "While he projects a public persona, Julian privately detests the deep, analytical way Seraphina and her team operate. He finds their constant due diligence and questioning to be exhausting and intrusive. He wants a partner who is more focused on social life than business details.",
          "reason": "Voicing this would make him seem shallow and unsupportive of Seraphina's career, a completely unacceptable stance in modern society.",
          "utility_impact": "This makes him resistant to overly detailed clauses in the prenup and pushes him to delegate all substantive talks to his team. He will favor speed and broad strokes over meticulous detail, which may appear careless."
        }
      }
    },
    {
      "name": "Marcus Thorne",
      "role": "Julian's Financial Advisor",
      "description": "A conservative, old-school advisor who has managed the Croft family trust for 30 years. His loyalty is to the preservation of the family's 'old money' capital, and he views the tech world's 'paper wealth' with deep suspicion.",
      "shareable_preferences": {
        "Iron-Clad Prenup - Asset Shield": {
          "description": "Demands a prenuptial agreement that completely shields all existing Croft family assets, including the real estate portfolio and all generational trusts. Any appreciation of these assets during the marriage must remain separate property. He will not accept any other formulation. Getting this clause exactly as stated is a +2 utility. Any clause that allows for marital claims on the appreciation of family assets is a -2 utility and a deal-breaker for him.",
          "utility_impact": "This is his non-negotiable duty. He sees his role as the guardian of the Croft legacy and will risk the entire deal to ensure the family's core wealth is untouchable."
        },
        "Limited Alimony": {
          "description": "Insists on a strict alimony cap. Proposes a maximum of $150,000 per year for a duration of no more than one-quarter the length of the marriage, with a hard cap of 5 years. Anything at or below this level is a +2 utility. Any amount up to $300k/year or 10 years is a -1. Anything above that is a -2.",
          "utility_impact": "He views alimony as a potential drain on the family trust and wants to minimize all future liabilities. He sees Seraphina as independently wealthy and thus not in need of significant support."
        }
      },
      "private_preferences": {
        "Croft Empire is Stagnating": {
          "value": "Marcus has an internal report showing the Croft Real Estate empire's net profits have declined by an average of 8% year-over-year for the past five years. They are becoming asset-rich but cash-poor. He cannot share specific numbers (penalty: -2) but can hint at 'the need for diversification and new revenue streams' (penalty: 0).",
          "reason": "Revealing the company's financial weakness would severely undermine their negotiating position, reduce their perceived value in the merger, and could trigger a loss of investor confidence.",
          "utility_impact": "This private knowledge makes him secretly desperate for the marriage to succeed. While he publicly projects strength and demands a tough prenup to protect assets, he knows they need Seraphina's capital and connections. This creates a conflict between his protective stance and the underlying need for the deal."
        }
      }
    },
    {
      "name": "Chloe Sterling",
      "role": "Julian's Head of PR",
      "description": "An ambitious and media-savvy PR executive. She views this marriage as the ultimate branding opportunity, a chance to re-brand the 'stuffy' Croft name into a modern power-couple dynasty. A success here would guarantee her a partnership at her agency.",
      "shareable_preferences": {
        "Max-Exposure Wedding": {
          "description": "Wants a massive, highly-publicized 'Wedding of the Decade.' She is proposing a 500-guest event at a historic European venue, with exclusive media rights sold to a major magazine like Vogue. The budget for this event should be no less than $10 million. A wedding of this scale or greater gets a +2 utility. A smaller, but still high-profile 200-guest wedding is a 0. Anything less, especially a private ceremony, is a -2 utility, as it would be a complete waste of a PR opportunity.",
          "utility_impact": "This is her signature project. The media buzz would be a career-making achievement. She will fight any attempt to downsize or privatize the wedding."
        },
        "Coordinated Media Blitz": {
          "description": "Proposes a 6-month integrated PR strategy leading up to the wedding, including a primetime TV interview, a feature in a major business publication, and a highly curated social media campaign. She requires a PR budget of $1.5 million to execute this, separate from the wedding costs. Getting the full budget and campaign approval is a +2. A reduced budget of $750k is a 0. Anything less is a -1.",
          "utility_impact": "She believes a controlled, sustained media narrative is essential to shaping the public's perception of the couple and maximizing the brand value of the union."
        }
      },
      "private_preferences": {
        "Professional Rivalry": {
          "value": "Chloe has a bitter professional rivalry with David Chen, Seraphina's Chief of Staff. They competed for a major award two years ago, which David won. She perceives him as arrogant and condescending. She has an old email from a colleague that says 'David Chen just called your last campaign 'predictable and derivative'.' She cannot share this email (penalty: -2).",
          "reason": "Revealing this would make her seem petty and unprofessional, undermining her authority and judgment.",
          "utility_impact": "This rivalry makes her interpret David's negotiating points in the worst possible light. She is motivated not just to get her way, but to 'win' against him. She will be less likely to trust his motives or accept his proposals at face value."
        }
      }
    },
    {
      "name": "Seraphina Vance",
      "role": "The Bachelorette",
      "description": "The brilliant, self-made founder and CEO of 'AetherAI,' a revolutionary artificial intelligence firm on the cusp of a massive IPO. She is intensely private and analytical, seeking a partner who can provide stability and navigate the high-society world she is about to enter.",
      "shareable_preferences": {
        "Protection of Intellectual Property": {
          "description": "Her primary legal demand is that the prenuptial agreement must contain an 'Intellectual Property & Future Earnings' clause. This clause must explicitly state that all shares of AetherAI, all future earnings derived from it, and any new intellectual property she creates during the marriage remain her sole and separate property, untouchable in any divorce settlement. This is non-negotiable. Getting this clause is a +2 utility. Any ambiguity is a -2.",
          "utility_impact": "AetherAI is her life's work. She will not compromise its integrity or ownership in any way. This is a foundational requirement for any agreement."
        },
        "Philanthropic Commitment": {
          "description": "Wants to establish a joint charitable foundation focused on STEM education for underprivileged girls. She proposes it be funded with an initial endowment of $20 million, split 50/50. She believes this demonstrates a shared value system. An endowment of $20M+ is a +2 utility. $10M-$19M is a +1. Below $10M is a -1, as it feels like a token gesture.",
          "utility_impact": "This is a genuine personal value. It also serves as a test of Julian's character and willingness to engage in substantive, world-positive activities beyond social events."
        },
        "Strict Privacy Clause": {
          "description": "Demands a comprehensive privacy clause in the prenup with a significant financial penalty (at least $10 million) for any breach. This includes leaking personal details, photos, or business information to the media or any third party. This is a +2 utility. A penalty below $10M is a -1. No penalty is a -2.",
          "utility_impact": "As a private person entering a very public marriage, she needs to feel that her personal life is contractually protected from the leaks and gossip common in Julian's world."
        }
      },
      "private_preferences": {
        "Secret Son": {
          "value": "Seraphina has a 7-year-old son, Leo, from a relationship in graduate school. His existence is a complete secret to the public and the business world. She has gone to extreme lengths to protect his privacy. She cannot reveal that she has a son (penalty: -2). She can vaguely state she has 'significant, non-negotiable family commitments that require a private lifestyle' (penalty: -1).",
          "reason": "Revealing her son's existence would create a media firestorm, disrupting his life and potentially harming her company's image right before the IPO by creating a 'distraction'.",
          "utility_impact": "This is the true reason she and her team will push so hard for a small, private wedding and a lifestyle with limited public exposure. It's not a preference; it's a necessity to protect her child."
        },
        "Social Anxiety": {
          "value": "She suffers from a diagnosed social anxiety disorder. While she can manage small, controlled business settings, large, unstructured social events with hundreds of people are a source of extreme stress and can trigger panic attacks. A 500-person wedding is her worst nightmare.",
          "reason": "Admitting this would project an image of weakness, which she feels she cannot afford as a female CEO in the tech industry. It could be used against her by competitors or skeptical investors.",
          "utility_impact": "This reinforces her need for a small wedding and a private life. Chloe's PR plan is not just unappealing to her; it's a genuine threat to her mental well-being. This gives her a utility of -2 for any wedding with more than 100 guests."
        }
      }
    },
    {
      "name": "David Chen",
      "role": "Seraphina's Chief of Staff",
      "description": "Fiercely loyal and protective, David has been with Seraphina since AetherAI was just a startup. He is her gatekeeper, strategist, and closest confidant. He is deeply skeptical of Julian and his motives.",
      "shareable_preferences": {
        "Emphasis on Personal Time": {
          "description": "Argues that the MMU must schedule a minimum of 10 'no-media, no-event' protected weekends per year and a 4-week uninterrupted block of private vacation time. This is framed as necessary for Seraphina's work-life balance to maintain her performance as CEO. Getting this schedule is a +2 utility. A reduction to 5 weekends is a 0. Anything less is a -2.",
          "utility_impact": "He is publicly framing this as a professional necessity for a high-performing CEO. He will use business logic to argue for what is, in reality, a personal need for Seraphina."
        },
        "Limited Wedding Size": {
          "description": "Will push aggressively for a small, intimate wedding. He will propose a guest list of no more than 75 people, comprising only close family and friends. He will argue that this is more 'elegant,' 'secure,' and 'befitting of Seraphina's brand as a serious technologist, not a socialite.' A wedding under 100 guests is a +2 utility. A wedding of 100-200 guests is a -1. Anything larger is a -2.",
          "utility_impact": "He is the primary agent tasked with protecting Seraphina's secrets. He knows about her son and her anxiety, and his goal is to create a marital structure that shields her from exposure and stress. He will stonewall Chloe's grand plans at every turn."
        }
      },
      "private_preferences": {
        "Full Knowledge of Seraphina's Secrets": {
          "value": "David is one of the few people who knows the full truth about both Seraphina's son, Leo, and her social anxiety. His entire negotiation strategy is built around protecting her from these vulnerabilities without ever being able to name them. He cannot mention Leo (penalty: -2) or her diagnosed anxiety (penalty: -2).",
          "reason": "His loyalty to Seraphina is absolute. Revealing her secrets would be the ultimate betrayal of her trust and would cause the damage he is trying to prevent.",
          "utility_impact": "This makes him seem inflexible and unreasonable to Julian's team. His unyielding demands for privacy and a small wedding, without clear business justification, will create major conflict with Chloe and make Julian suspicious. He is willing to be seen as the 'bad guy' to protect Seraphina."
        }
      }
    },
    {
      "name": "Anika Sharma",
      "role": "Seraphina's Legal Counsel",
      "description": "A sharp, top-tier corporate lawyer specializing in tech IPOs and M&A. Her focus is purely on the financial and legal mechanics of the prenup, ensuring Seraphina's control over her company is absolute and her future wealth is protected.",
      "shareable_preferences": {
        "Dynamic Alimony Clause": {
          "description": "Rejects the flat alimony cap proposed by Marcus. Instead, she proposes a 'dynamic' clause where alimony is calculated based on the difference in liquid assets at the time of divorce, but explicitly excludes the value of AetherAI stock. This is framed as a more 'equitable' modern approach. Getting this clause accepted is a +2 utility. A flat cap above $500k/year is a 0. Marcus's proposed cap is a -2.",
          "utility_impact": "She sees Marcus's proposal as archaic and insulting to a woman who will soon be far wealthier than her husband. She is fighting for a principle of modern, equitable agreements."
        },
        "Clear Definition of 'Marital Property'": {
          "description": "Wants to narrowly define 'marital property' as only assets that are explicitly co-mingled in a joint account. All income, investments, and assets held in individual names, particularly Seraphina's earnings from AetherAI, should be classified as separate property. This must be explicitly worded. Getting this is a +2 utility. Any ambiguity that could allow for a broader interpretation is a -2.",
          "utility_impact": "Her primary goal is to prevent any future legal battles over Seraphina's wealth. Clear, unambiguous definitions are key to creating a legally impenetrable document."
        }
      },
      "private_preferences": {
        "Confidential IPO Valuation": {
          "value": "Anika is privy to the latest confidential valuation report from the investment bank managing AetherAI's IPO. The report projects a post-IPO valuation of $8 billion, making Seraphina's stake worth over $3 billion. The current public estimate is only around $1 billion. She cannot share the $8B figure or the report's existence (penalty: -2), as it would be a violation of securities law and her NDA. She can only argue that 'future earnings potential is exceptionally high and unpredictable'.",
          "reason": "Securities regulations (Reg FD) and a strict non-disclosure agreement with the underwriting bank. Leaking this information would have severe legal and financial repercussions for the IPO.",
          "utility_impact": "This knowledge fuels her aggressive stance on the prenup. She knows the stakes are astronomically higher than Julian's team realizes. She is negotiating to protect billions, not millions, which is why she will not budge on shielding future earnings and AetherAI stock, even if it makes her seem greedy or unreasonable to the other side."
        }
      }
    },
    {
      "name": "Eleonora Vance",
      "role": "The Matchmaker",
      "description": "A charismatic and highly influential matchmaker for the global elite. She brokered this introduction and stands to make an enormous commission if the marriage is finalized. Her goal is to smooth over any conflicts and get the deal signed, even if it means hiding certain truths.",
      "shareable_preferences": {
        "Efficient Timeline": {
          "description": "Wants the MMU signed within 30 days. She stresses that 'momentum is key' in these high-profile arrangements and that delays can lead to cold feet or negative press speculation. A signed deal in 30 days is +2 utility. 60 days is 0. Over 90 days is -2, as she considers the deal likely to fail by then.",
          "utility_impact": "Her commission is contingent on the deal closing. She will act as a mediator, but her interventions will always be biased towards finding a quick compromise, even if it's not the best long-term solution for the parties."
        },
        "Positive Framing": {
          "description": "Insists that all communication between the parties remains positive and focused on the 'synergies' of the union. She will actively shut down conversations that become too adversarial and try to re-frame conflicts as 'minor details to be worked out.' Maintaining a positive tone throughout the negotiation is a +1 utility.",
          "utility_impact": "She needs to maintain the illusion of a perfect match to keep both sides emotionally invested. She acts as the social lubricant of the negotiation."
        }
      },
      "private_preferences": {
        "Knowledge of Julian's Financial Trouble": {
          "value": "Through her network, Eleonora heard whispers that Julian's 'Azure' startup had 'run into serious trouble.' She doesn't know the exact $32M figure, but she knows he is financially distressed. She has deliberately avoided confirming the details. She cannot reveal that she knows about his financial issues (penalty: -2).",
          "reason": "Revealing this would instantly kill the deal she has worked hard to build. It would also destroy her reputation as a discreet and trustworthy matchmaker, as clients would fear she shares their secrets.",
          "utility_impact": "This knowledge makes her subtly guide the conversation away from deep financial scrutiny of Julian. When Marcus pushes for a tough prenup, she might support it, framing it as 'standard procedure for established families,' while actually helping to prevent Seraphina's team from digging too deep into Julian's finances. She is actively, if passively, helping to conceal a material fact."
        },
        "Commission Structure": {
          "value": "Her commission is not a flat fee. It's 1% of the *increase* in the couple's combined public net worth one year after the wedding. A successful AetherAI IPO would result in a commission of over $30 million for her. A failed deal gets her nothing. She cannot disclose this incentive structure (penalty: -2).",
          "reason": "Revealing her commission structure would expose her immense financial bias. The other agents would realize she is not a neutral mediator but a highly motivated salesperson, and they would distrust her advice.",
          "utility_impact": "This makes her overwhelmingly motivated to see the deal through, especially on terms favorable to AetherAI's success and public valuation. She will pressure Seraphina's side less on financial concessions, and pressure Julian's side more to accept terms that make Seraphina happy, as Seraphina's IPO is the source of her potential windfall."
        }
      }
    }
  ],
  "success_criteria": {
    "MMU_Signed": "All parties must agree to and sign a final version of the Memorandum of Marital Understanding.",
    "Prenup_Agreement": "The MMU must contain mutually agreed upon terms for all key prenup clauses: separate vs. marital property, asset shields, IP/future earnings, alimony, and privacy penalties.",
    "PR_Strategy_Agreement": "The MMU must specify the wedding size (guest count under 100, 100-250, or 250+), venue type (private vs. public), and the budget and scope of the public relations campaign.",
    "Lifestyle_Plan_Agreement": "The MMU must outline the initial joint financial contributions towards residence(s) and a shared lifestyle budget."
  },
  "constraints": {
    "verifiable": [
      "The total combined contribution for the wedding and initial home purchases cannot exceed $40 million.",
      "The Memorandum of Marital Understanding must be finalized and signed within 60 days from the start of the negotiation.",
      "Any prenuptial agreement must be compliant with New York state law."
    ],
    "hidden": [
      "Julian Croft needs to secure access to capital or assets worth at least $32 million within 6 months to avoid financial ruin.",
      "Seraphina Vance cannot, under any circumstances, agree to a lifestyle or wedding plan that would publicly expose her young son or trigger her severe social anxiety.",
      "Anika Sharma cannot disclose the confidential $8 billion post-IPO valuation estimate for AetherAI."
    ]
  },
  "deliverable": "A finalized JSON object representing the 'Memorandum of Marital Understanding' (MMU) with the agreed-upon values for all negotiable points (e.g., 'wedding_guest_count': 75, 'alimony_clause': 'dynamic', 'joint_fund_endowment': 20000000).",
  "solvability_note": "This scenario is solvable because a mutually beneficial agreement exists if the private information is revealed. If Seraphina's team knew of Julian's debt, they could offer a structured, private loan as part of the marital agreement, solving his problem and giving them leverage. If Julian's team knew the real reason for Seraphina's privacy demands (a child and anxiety, not arrogance), they could agree to a private lifestyle, which Julian secretly prefers anyway. The PR team could spin a private wedding as the ultimate 'quiet luxury' statement. The prenup could be structured to protect her vast future wealth while providing Julian the stability he needs, creating a true, albeit highly transactional, partnership."
}