{
  "scenario": "High-Profile Celebrity Divorce Settlement",
  "task": "Negotiate the terms of a comprehensive divorce settlement between high-profile actress Isabella Rossi and rock star Julian Croft. The negotiation involves their legal representatives, a business manager, and a court-appointed mediator. The goal is to agree on the division of assets, business interests, real estate, and a non-disclosure agreement, all while navigating a minefield of undisclosed information and personal secrets that could derail the entire process and lead to a reputation-destroying public trial.",
  "agent_number": 4,
  "agent_names": [
    "Eleanor Vance",
    "Marcus Thorne",
    "Dr. Anya Sharma",
    "Leo Chen"
  ],
  "agents": [
    {
      "name": "Eleanor Vance",
      "role": "Isabella Rossi's Lead Counsel",
      "description": "A sharp, tenacious, and highly respected family law attorney. Eleanor's primary duty is to protect Isabella's financial future and public image. She sees this not just as a division of assets, but as securing justice for a client whose personal contributions to the marriage, she feels, have been undervalued.",
      "shareable_preferences": {
        "Asset Division Percentage": {
          "description": "Eleanor is pushing for a 60/40 split of all liquid marital assets in Isabella's favor, totaling a claim of $48M from the $80M liquid pot. She will argue this is justified by Julian's significantly higher future earning potential and to compensate Isabella for career opportunities she passed on to support the family. She will not accept less than a 55% split ($44M). Utility: +2 for >=60%, +1 for 55-59%, 0 for 50-54%, -1 for 45-49%, -2 for <45%.",
          "utility_impact": "This is Eleanor's central financial goal. Achieving this validates her strategy and secures a comfortable future for her client, allowing her to restart her career without financial pressure. A lower split would be seen as a major loss."
        },
        "Primary Residence": {
          "description": "Isabella must be awarded sole ownership of the Los Angeles marital home, valued at $25M. For Isabella, this property represents stability for their daughter, Lily, and is a symbol of her identity. Eleanor will frame this as a non-negotiable emotional need for her client and child. Utility: +2 for securing the home, -2 for failing to secure it.",
          "utility_impact": "This is a high-stakes emotional issue. Eleanor will trade other financial points to win this, as it's a visible 'win' for Isabella in the public eye and crucial for her personal well-being."
        },
        "Non-Disclosure Agreement (NDA)": {
          "description": "Insists on a 'mutual, ironclad' NDA with a substantial penalty clause of at least $10 million for any breach. This is to prevent either party from speaking to the press, writing memoirs, or indirectly disclosing details about the marriage or divorce. Utility: +1 for a penalty clause of $10M+, 0 for $5M, -1 for anything less or a non-mutual NDA.",
          "utility_impact": "Protecting Isabella's 'America's Sweetheart' brand is paramount. A weak NDA leaves her vulnerable to Julian's camp leaking damaging information, so Eleanor will hold firm on this point."
        }
      },
      "private_preferences": {
        "Isabella's Career Instability": {
          "value": "Isabella's last major film was a box-office failure, and her talent agency has privately informed her that major role offers have dried up. Her confirmed projected income for the next 18 months is a mere $1.5M, a fraction of her public image. Sharing this would severely undermine the 'future earnings disparity' argument. The penalty for revealing this specific financial projection is -2.",
          "reason": "Revealing this would demonstrate financial desperation and cripple Eleanor's negotiating leverage for the asset split.",
          "utility_impact": "This knowledge makes Eleanor desperate to secure a high settlement. She will bluff about Isabella's bright career future to justify her demands, but is terrified of being called on it."
        },
        "Prenuptial Agreement Invalidity": {
          "value": "The couple's prenuptial agreement, which heavily favored Julian, contained a 'sunset clause' that rendered it void on their 10th anniversary, which was 8 months ago. Eleanor is confident it's legally unenforceable. She can hint that the prenup has 'significant legal issues' (penalty -0.5), but revealing the specific sunset clause expiration gives away her trump card too early (penalty -1).",
          "reason": "This is a critical piece of legal strategy. Revealing it prematurely would allow the other side to prepare a counter-argument, whereas using it as a surprise threat later could force a major concession.",
          "utility_impact": "This is Eleanor's ace in the hole. It's why she is so confident in her aggressive demands. She plans to use the 'prenup problem' as a threat to avoid trial, where she would almost certainly win."
        },
        "Isabella's Infidelity": {
          "value": "Eleanor possesses a file confirming that Isabella had a brief affair a year ago. While California is a no-fault divorce state, making it legally irrelevant to the financial split, the public relations fallout would be catastrophic for Isabella's brand. The existence of this information is a massive liability. Revealing this would result in a penalty of -2.",
          "reason": "Public knowledge of the affair would destroy Isabella's public image, potentially violating endorsement morals clauses and costing her millions in future income.",
          "utility_impact": "This makes Eleanor extremely risk-averse to a public trial. She will push hard in negotiations but will be secretly motivated to settle to ensure this information never sees the light of day."
        }
      }
    },
    {
      "name": "Marcus Thorne",
      "role": "Julian Croft's Lead Counsel",
      "description": "A pragmatic and methodical corporate lawyer who has recently moved into family law. Marcus is less interested in courtroom drama and more focused on a clean, financially sensible exit. His objective is to protect Julian's business empire and brand from the fallout of the divorce with minimal disruption.",
      "shareable_preferences": {
        "Adherence to 50/50 Split": {
          "description": "Marcus will argue for a strict 50/50 division of liquid assets ($40M each), framing it as the 'fair and equitable' standard. He will initially reference the 'spirit of the prenuptial agreement' as the foundation for this, suggesting it shows their original intent. Utility: +2 for a 50/50 split, +1 for 55/45 (Isabella's favor), 0 for 60/40, -2 for any split >60%.",
          "utility_impact": "A 50/50 split is a clean, defensible position that minimizes Julian's immediate cash-out. It sets a baseline of 'reasonableness' from which he can negotiate."
        },
        "Protection of Business Assets": {
          "description": "Julian's music company, 'Croftunes Inc.', and his entire song catalog must be declared his sole and separate property, with Isabella waiving all future claims. Marcus will offer a larger cash sum from the liquid assets as a buyout to achieve this. This is his client's number one priority. Utility: +2 for full waiver of claims, -2 for Isabella retaining any equity or future revenue share.",
          "utility_impact": "This is a red line for Marcus's client. Julian's identity and future are tied to his music. Giving up any control is unthinkable, and Marcus is instructed to prevent this at all costs."
        },
        "Expedited Timeline": {
          "description": "Marcus is pushing to finalize the entire settlement within 30 days. He will cite the need to minimize legal fees and emotional distress. The real reason is to conclude the matter before Julian's upcoming world tour and album launch. Utility: +1 for settlement in <30 days, 0 for 30-60 days, -1 for >60 days.",
          "utility_impact": "A prolonged negotiation creates a cloud of negative press that could harm ticket and album sales. Marcus will use the timeline as a pressure tactic, offering small concessions for speed."
        }
      },
      "private_preferences": {
        "Undisclosed Marital Asset": {
          "value": "Two years ago, Julian used a shell corporation to acquire a catalog of 80s rock music for $5M. It is legally a marital asset but is not on any shared financial statements. Marcus knows its existence is a legal time bomb. Revealing the asset exists would have a penalty of -2, as it opens them to charges of fraudulent concealment.",
          "reason": "Disclosure would immediately add it to the marital pot and expose Julian to severe legal penalties from the court for hiding assets, completely destroying their negotiating position.",
          "utility_impact": "This secret forces Marcus to seek a quick settlement before any formal discovery process unearths it. He is willing to overpay slightly in other areas to get the deal signed and closed."
        },
        "Tour Sponsor Pressure": {
          "value": "The main sponsor for Julian's $100M world tour, 'Aura Beverages,' has a 'moral turpitude' clause. Marcus was recently sent a 'friendly reminder' email from their legal team about it. A messy public divorce with accusations of infidelity or misconduct could cause them to pull their sponsorship. Revealing this vulnerability would be a penalty of -1.",
          "reason": "Admitting this gives Eleanor immense leverage. She could threaten to leak damaging (even if false) information to hold the tour hostage.",
          "utility_impact": "This adds immense pressure on Marcus to settle quickly and quietly. He knows his client's entire financial year is at risk, making him more flexible on the final settlement number than he appears."
        },
        "Julian's Substance Abuse": {
          "value": "Julian recently completed a secret 28-day stint in a high-end rehabilitation facility for substance abuse. The public story was 'exhaustion'. If this were to leak, it would not only be a personal catastrophe but could invalidate the tour's insurance policy, killing the tour instantly. The penalty for this information getting out is -2.",
          "reason": "This is profoundly damaging personal and financial information. It would destroy Julian's 'rock god' image and have catastrophic financial consequences.",
          "utility_impact": "Marcus cannot risk a public trial where Julian's personal conduct would be scrutinized. He must settle, and this knowledge makes him even more willing to concede on financial terms to guarantee an NDA and a swift, quiet end to the proceedings."
        }
      }
    },
    {
      "name": "Dr. Anya Sharma",
      "role": "Court-Appointed Mediator",
      "description": "A former judge with a reputation for being fair, insightful, and impartial. Dr. Sharma's goal is not to take sides but to guide the parties to a durable and legally sound agreement that the court will sign off on. She is skilled at finding common ground but has no patience for gamesmanship.",
      "shareable_preferences": {
        "Zone of Equitable Agreement": {
          "description": "Dr. Sharma's primary goal is to land on a final asset split that falls between 45/55 and 55/45. She believes any outcome outside this range is likely to be perceived as punitive or unfair, and will be difficult for her to endorse to the presiding judge. Utility: +2 for a split within the 45-55% range, -1 for a split outside it, -2 if one party is clearly being coerced.",
          "utility_impact": "Her professional reputation rests on her ability to craft fair agreements. She will actively steer the conversation towards this middle ground, questioning the justification for extreme positions."
        },
        "Amicable Co-Parenting Plan": {
          "description": "Before tackling the finances, Dr. Sharma wants the parties to agree on a comprehensive co-parenting plan for their 8-year-old daughter, Lily. This includes schedules, holidays, and decision-making. She believes starting with the child's welfare builds goodwill. Utility: +2 for reaching a quick and detailed parenting plan, 0 for moderate contention, -1 for failure to agree.",
          "utility_impact": "This is a procedural preference. Success here signals that a larger agreement is possible. Failure suggests the parties are too adversarial, and she may need to adopt a more rigid, formal approach."
        },
        "Full Financial Disclosure": {
          "description": "Dr. Sharma requires both parties to formally attest that they have provided a full and complete declaration of their assets. She will state clearly that 'any agreement predicated on incomplete information can be invalidated later.' Utility: +1 for a smooth, transparent exchange of financial documents, -1 for any signs of hesitation or inconsistency.",
          "utility_impact": "She is laying the groundwork for a binding agreement. This puts pressure on both sides to be truthful, as she is creating a record that could be used against them in the future if hidden assets are discovered."
        }
      },
      "private_preferences": {
        "Knowledge of Presiding Judge": {
          "value": "The judge assigned to this case, Judge Miller, is a notorious stickler for financial transparency. Last year, he threw out a major celebrity settlement and ordered a full forensic audit because he suspected one party was hiding offshore accounts. Dr. Sharma knows any deal that seems imbalanced or rushed will face extreme scrutiny. Sharing this explicitly ('Judge Miller will audit you') would breach her neutrality (penalty -1), but she can hint at the 'court's need for meticulous documentation.'",
          "reason": "This is privileged professional insight. Using it as a threat would compromise her role as a neutral facilitator and turn her into a coercive figure.",
          "utility_impact": "This knowledge makes her highly sensitive to any red flags. If one side seems too eager to settle or the numbers don't add up, she will probe deeply, unknowingly threatening the secrets of both parties."
        }
      }
    },
    {
      "name": "Leo Chen",
      "role": "Julian Croft's Business Manager",
      "description": "Julian's long-time business manager and the architect of his financial empire. Leo is fiercely protective of Julian's business interests. He views this divorce purely as a business transaction—a hostile negotiation where the goal is to minimize the payout and protect the core asset, Croftunes Inc.",
      "shareable_preferences": {
        "Zero Equity in Croftunes Inc.": {
          "description": "Leo's most critical objective is to ensure Isabella walks away with zero equity or ongoing revenue share from Croftunes Inc. He will argue that a clean break is best for all parties and will advocate for a one-time cash payment to settle any claims against the business. Utility: +2 for a zero-equity outcome, -2 if Isabella is granted any percentage of the company.",
          "utility_impact": "Any lingering entanglement is a threat to Leo's long-term business plans for the company. He will be incredibly rigid on this point, seeing it as an existential threat to the business's future."
        },
        "Use of Conservative Business Valuation": {
          "description": "Leo will present and defend a conservative valuation of Croftunes Inc. at $50M. He will argue that the music industry is volatile and that future earnings are purely speculative. He will strongly resist any suggestions of hiring a neutral third-party valuator, claiming it's an unnecessary expense. Utility: +1 for the settlement using his $50M valuation, -1 for using a neutral valuation, -2 for a valuation over $75M.",
          "utility_impact": "Controlling the valuation is key to controlling the size of the total marital pot. A lower valuation means a smaller settlement, directly serving his primary goal."
        }
      },
      "private_preferences": {
        "Imminent IPO Plan": {
          "value": "Leo is in the advanced stages of preparing Croftunes Inc. for an Initial Public Offering (IPO) within the next 24 months. The investment bank's confidential preliminary projection values the company at $200M-$250M post-IPO. The current $50M valuation is deliberately and massively understated. Revealing the IPO plan would be catastrophic, incurring a penalty of -2.",
          "reason": "Knowledge of the IPO would fundamentally change the nature of the settlement, entitling Isabella to a share of the much larger future value. It would be a financial disaster for Julian.",
          "utility_impact": "This secret makes Leo pathologically resistant to giving up any equity. He will fight tooth and nail against it, appearing irrationally stubborn, because he knows the true stakes are 4-5 times higher than what's on the table."
        },
        "Personal Financial Incentive": {
          "value": "Leo's compensation agreement with Julian includes a $2M 'transactional success bonus' if the total value of assets and cash transferred to Isabella in the divorce settlement remains below $40M. He recently received a congratulatory email from Julian's family office lawyer saying, 'Keep the payout under $40M and the 2M bonus is all yours.' Revealing this personal conflict of interest would result in a penalty of -2.",
          "reason": "This is a massive, undisclosed conflict of interest. If revealed, the other side would claim he is not negotiating in good faith, and he could be professionally sanctioned.",
          "utility_impact": "This bonus structure makes Leo personally invested in lowballing Isabella. He will not just argue for a low number; he will actively sabotage any potential deal that approaches the $40M threshold, creating conflict and confusion to protect his own payday."
        }
      }
    }
  ],
  "success_criteria": {
    "Signed Settlement Agreement": "All parties must sign a final, legally binding Marital Settlement Agreement.",
    "Comprehensive Asset Division": "The agreement must explicitly detail the division of all known assets, including the $80M in liquid funds, the $25M LA home, vehicles, art, and a full waiver or specific allocation of interest in Croftunes Inc.",
    "NDA Clause Finalized": "The agreement must contain a mutually agreed-upon Non-Disclosure Agreement with specified penalties for breaches.",
    "Mediator's Endorsement": "The final agreement must be endorsed by Dr. Anya Sharma as a fair and equitable resolution reached through a proper process, making it acceptable for judicial review."
  },
  "constraints": {
    "verifiable": [
      "Total declared liquid marital assets: $80,000,000.",
      "Agreed-upon valuation of the Los Angeles residence: $25,000,000.",
      "Presented valuation of Croftunes Inc.: $50,000,000.",
      "Deadline: Julian Croft's world tour begins in 90 days. A public court battle cannot proceed before then."
    ],
    "hidden": [
      "The prenuptial agreement is legally void due to an expired sunset clause.",
      "An undisclosed marital asset (music catalog) worth at least $5M exists.",
      "Croftunes Inc. is being prepared for an IPO with a projected valuation of over $200M.",
      "Leo Chen receives a $2M personal bonus if the settlement is under $40M."
    ]
  },
  "deliverable": "A finalized JSON object representing the terms of the agreed-upon settlement. This object must specify the exact percentage and dollar amount of the liquid asset split, the disposition of the LA residence, the terms of the settlement regarding Croftunes Inc., and the penalty amount for the NDA.",
  "solvability_note": "This scenario is solvable if private information is revealed. The revelation of the void prenup, the hidden asset, and the upcoming IPO would force Julian's side to offer a significantly higher settlement. Simultaneously, the revelation of Isabella's affair and career troubles would give her a strong incentive to accept a deal and avoid public exposure. With all cards on the table, a mediator could easily structure a deal (e.g., a cash and asset payout of $60-70M) that is far more than Julian initially offered but avoids the catastrophic outcomes both sides risk in a public trial."
}