{
  "scenario": "Negotiating the Global Streaming Rights for 'Echoes of Tomorrow'",
  "task": "A surprise hit indie film, 'Echoes of Tomorrow', has attracted a lucrative acquisition offer from the streaming giant StreamFlix. The original contracts between the artist, the production studio, and the distributor are ambiguous regarding digital rights. The four parties must negotiate and agree on a single, unified deal structure. This includes the total acquisition price from StreamFlix and the subsequent percentage-based distribution of that price among the original stakeholders. Failure to agree will result in StreamFlix withdrawing its offer, leaving everyone with nothing from this opportunity.",
  "agent_number": 4,
  "agent_names": [
    "Alex Chen",
    "Bianca Rossi",
    "Carlos Vega",
    "Dana Miller"
  ],
  "agents": [
    {
      "name": "Alex Chen",
      "role": "Director and Screenwriter",
      "description": "The creative visionary behind 'Echoes of Tomorrow'. Alex worked for a nominal upfront fee, persuading the cast and crew to do the same with the promise of significant back-end compensation if the film was a success. He feels a deep personal and professional responsibility to ensure they are rewarded fairly for their faith in his project.",
      "shareable_preferences": {
        "crew_bonus_pool": {
          "description": "Alex is adamant that a significant portion of the deal must be allocated to a 'Crew Bonus Pool' before any other splits are calculated. He is pushing for a flat $1.5 million to be set aside for the original cast and crew who worked for scale wages. He argues this is a moral imperative, as the film's success is built on their underpaid labor and talent. He will not accept a deal that feels like it's selling out his team.",
          "utility_impact": "This is Alex's primary moral driver. If the bonus pool is fully funded at $1.5M, he gets +2 utility. If it's negotiated down to between $750k and $1.49M, he gets +1. Between $250k and $749k, it's -1. Anything less than $250k is a deal-breaker and results in -2 utility, as he would feel he betrayed his crew."
        },
        "creative_control": {
          "description": "Alex demands a contractual clause guaranteeing him 'Final Cut' rights on all promotional materials (trailers, posters) and a strict 'No Re-edit' clause for the film itself on the StreamFlix platform. He witnessed a colleague's film get butchered for a foreign market and is paranoid about his artistic vision being compromised for marketing purposes.",
          "utility_impact": "Protecting his work is paramount. Full creative control as described gives him +1 utility. Partial control (e.g., consultation rights but no final say) is a neutral 0. No control over his work's presentation is a significant artistic blow, resulting in -1 utility."
        },
        "sequel_rights": {
          "description": "Alex wants to retain the 'Right of First Refusal' for directing any potential sequel or spin-off. He does not want to be locked into a multi-picture deal right now but wants to ensure he isn't written out of the future of the world he created. He is open to discussing a sequel but wants it to be a separate, future negotiation.",
          "utility_impact": "This is about future career control. Securing the Right of First Refusal without being locked into a deal provides +1 utility. Being forced into a multi-picture deal gives him -1 utility. The topic not being addressed is neutral (0)."
        }
      },
      "private_preferences": {
        "personal_compensation_benchmark": {
          "value": "Alex's agent sent him a congratulatory email last night with confidential industry benchmarks. The email, which is still marked 'unread' in his inbox, explicitly states: 'For context, the director of 'Sundown Mirage' (a very similar indie hit from last year) secured a $1.2M personal bonus on top of their crew pool.' Alex feels he deserves at least this much personally, but he can only share that he wants 'fair personal compensation'. If he reveals the specific figure or the source, he'll look greedy and self-serving to the crew he claims to be championing.",
          "reason": "Revealing this would undermine his 'for the art and the crew' negotiating stance and damage his reputation as a collaborative, artist-first director.",
          "utility_impact": "Alex's personal target is a $1.2M+ share of the deal *after* the crew bonus. Getting this gives him +1 utility. Getting between $500k and $1.19M is 0. Less than $500k is -1. Penalty for revealing the specific benchmark email: -2 utility due to reputational damage."
        }
      }
    },
    {
      "name": "Bianca Rossi",
      "role": "Studio Executive, Momentum Pictures",
      "description": "Bianca is a partner at the small indie studio that took a massive risk funding 'Echoes of Tomorrow'. She championed the film from the start, securing bridge loans and putting the studio's future on the line. She needs this deal to be a major financial success to ensure her company's survival and fund a slate of new projects.",
      "shareable_preferences": {
        "studio_profit_margin": {
          "description": "Bianca is pushing for Momentum Pictures to receive at least 50% of the total acquisition price after any fixed costs (like a potential crew bonus) are deducted. She argues that the studio bore 100% of the financial risk, covered all production costs, insurance, and marketing overheads, and therefore deserves the lion's share of the reward to maintain its business operations.",
          "utility_impact": "The studio's health is her career. A 50% or greater share gives her +2 utility. A share between 40-49% is +1. A share between 30-39% is a major setback, giving -1 utility. Anything below 30% is a catastrophic failure for the studio, resulting in -2 utility."
        },
        "reinvestment_slate": {
          "description": "Bianca wants to publicly announce that a portion of the profits will be used to fund a new 'Indie Visionaries' slate of three films, which would be a huge PR win for her studio. She needs to secure at least $2 million net profit from this deal to make that slate viable. This is a key part of her long-term strategy to attract new talent.",
          "utility_impact": "This is about the studio's future. Securing the $2M for the slate gives +1 utility. Getting less, meaning the slate is compromised or canceled, results in -1 utility."
        }
      },
      "private_preferences": {
        "imminent_bankruptcy": {
          "value": "Momentum Pictures is on the verge of collapse. They are currently $2.8 million in debt, and their primary lender has issued a final notice requiring payment within 60 days. An internal report from her CFO, received this morning via a password-protected PDF, states that the studio needs a minimum cash infusion of $3 million from this deal simply to avoid filing for Chapter 11 bankruptcy. She can talk about 'financial pressures' but cannot reveal the specific number or the bankruptcy threat, as it would obliterate her negotiating leverage, forcing her to accept any offer on the table.",
          "reason": "Revealing the company's desperation would signal to all parties that she has no power to walk away from a bad deal, leading to a disastrous outcome for her studio.",
          "utility_impact": "This is a hidden survival constraint. Any deal that nets the studio less than $3M is an absolute failure (-2 utility). The stress of this secret makes her highly risk-averse. Penalty for revealing the exact financial situation: -2 utility, as it guarantees a terrible deal."
        }
      }
    },
    {
      "name": "Carlos Vega",
      "role": "Head of Distribution, CineVerse Distribution",
      "description": "Carlos is a savvy, old-school distributor who handled the film's limited but successful theatrical run. His contract with Momentum Pictures is old and contains a poorly-defined clause about his company managing rights for 'all subsequent media formats'. He interprets this as giving him a significant stake in the streaming deal.",
      "shareable_preferences": {
        "distribution_fee_precedent": {
          "description": "Carlos is publicly arguing that his contract entitles CineVerse to a 30% fee of the gross acquisition price. He claims this is standard industry practice for distributors who handle a film's initial launch and that his efforts are the sole reason the film gained enough traction to be noticed by StreamFlix in the first place. He has brought copies of boilerplate contracts from other, unrelated deals to support his claim.",
          "utility_impact": "This defines his success. A 30% cut is +2 utility. 20-29% is +1. 10-19% is -1. Less than 10% is an insult to his business and results in -2 utility."
        },
        "ongoing_relationship": {
          "description": "Carlos wants to secure a distribution deal with Momentum Pictures for their next slate of films. He will use his leverage in this negotiation to try and get a commitment from Bianca, framing it as a continuation of their 'successful partnership'.",
          "utility_impact": "Securing a future deal with Momentum is a secondary goal worth +1 utility. Failing to do so is neutral (0)."
        }
      },
      "private_preferences": {
        "confidential_finder_fee": {
          "value": "Carlos was the one who initiated the conversation with StreamFlix. He has a confidential, signed Letter of Intent (LOI) with Dana Miller's division at StreamFlix. The LOI, which is saved on his personal tablet, promises him a separate $500,000 'consulting payment' directly from StreamFlix if, and only if, he can help finalize the total acquisition price for 'Echoes of Tomorrow' at or below $8 million. This gives him a massive incentive to pressure Alex and Bianca into accepting a lower overall number.",
          "reason": "This is a backroom deal that borders on unethical. If revealed, it would expose him as negotiating in bad faith against his own partners, leading to potential legal action and complete reputational ruin.",
          "utility_impact": "The $500k bonus is a huge personal driver. If the main deal is <=$8M, he gets the bonus, which is a +2 utility event for him personally. If the deal is >$8M, he gets no bonus, which is a 0 utility event. Penalty for this LOI being revealed: -2 utility, plus likely legal ramifications."
        }
      }
    },
    {
      "name": "Dana Miller",
      "role": "VP of Content Acquisition, StreamFlix",
      "description": "Dana is a sharp, data-driven executive from the streaming giant StreamFlix. Her job is to acquire high-potential content that can drive new subscriptions while staying strictly within her allocated budget. She is interested in the film and its creator but is unsentimental about the process.",
      "shareable_preferences": {
        "acquisition_price": {
          "description": "Dana's primary goal is to acquire the exclusive, perpetual, global streaming rights for 'Echoes of Tomorrow' for the lowest possible price. She plans to open negotiations with an offer of $5 million, citing the film's low production budget and lack of major stars as justification. She will frame any increase as a major concession.",
          "utility_impact": "Her performance is judged by her budget efficiency. A deal at or below $7M is a huge win (+2 utility). A deal between $7.01M and $9M is a success (+1). A deal between $9.01M and $11M is acceptable but not ideal (0). A deal over $11M is a poor performance (-1 utility) and will require justification to her superiors."
        },
        "talent_retention": {
          "description": "StreamFlix is very interested in Alex Chen's future. Dana is instructed to secure, as part of this deal, an exclusive 'first-look' deal with Alex for his next two projects. This would prevent him from taking his next film to a rival streaming service. She will present this as a 'major career opportunity' for him.",
          "utility_impact": "Locking in new talent is a key performance indicator for her. Securing the two-project first-look deal gives her +1 utility. Failing to do so is a neutral outcome (0)."
        }
      },
      "private_preferences": {
        "maximum_authorized_budget": {
          "value": "While her opening offer is $5M, Dana has a hard ceiling. An internal acquisition authorization memo, approved by the StreamFlix CFO, gives her a maximum discretionary budget of $12 million for this deal. She absolutely cannot exceed this amount. She also has access to projection data showing the film is expected to drive $30 million in new subscription revenue over 24 months, making any price under $12M highly profitable. She can hint that she has 'some flexibility' but will never reveal her true ceiling.",
          "reason": "Revealing her maximum budget would mean she would inevitably have to pay it. It would be a catastrophic failure of her negotiation duties and could jeopardize her position at the company.",
          "utility_impact": "The closer she gets to the $12M ceiling, the worse her performance is viewed. A deal at exactly $12M gives her -2 utility, as it shows she has no negotiation skill. Penalty for revealing her max budget: -2 utility."
        },
        "carlos_side_deal": {
          "value": "Dana is fully aware of the $500,000 'consulting payment' LOI with Carlos. She sees it as a strategic, if slightly unsavory, tool to keep the overall price down. She considers Carlos her 'inside man' in the negotiation. She cannot reveal this deal, as it would expose StreamFlix to accusations of unethical negotiation tactics and could cause the entire deal to collapse.",
          "reason": "Revealing this would create a massive legal and PR headache for StreamFlix and would destroy the trust needed to close the deal.",
          "utility_impact": "This is a strategic secret. If the deal is kept secret, it has no direct utility impact (it's a tool, not an outcome). Penalty for revealing the side deal: -2 utility, as the deal would collapse and she would face internal review."
        }
      }
    }
  ],
  "success_criteria": {
    "agreement_on_price": "All four agents must agree on and sign a Term Sheet specifying a single, final 'Total Acquisition Price' to be paid by StreamFlix.",
    "agreement_on_distribution": "Alex, Bianca, and Carlos must agree on and sign a Distribution Agreement that details the exact percentage split of the 'Total Acquisition Price' among themselves (and the crew bonus pool).",
    "unanimity": "The agreement must be unanimous. A simple majority is not sufficient. If any single agent refuses to sign, the entire deal is off."
  },
  "constraints": {
    "verifiable": [
      "The original production budget of 'Echoes of Tomorrow' was $500,000.",
      "CineVerse Distribution's contract with Momentum Pictures contains the ambiguous clause: '...CineVerse shall retain exclusive rights for distribution across all subsequent media formats now known or hereafter devised...'",
      "StreamFlix's offer is for exclusive, perpetual, global rights."
    ],
    "hidden": [
      "StreamFlix's maximum authorized budget is $12 million.",
      "Momentum Pictures will go bankrupt if it nets less than $3 million from the deal.",
      "Carlos Vega has a secret agreement to receive a $500,000 bonus from StreamFlix if the total acquisition price is $8 million or less."
    ]
  },
  "deliverable": "A final JSON object representing the signed Term Sheet. It must contain the following keys: 'total_acquisition_price' (integer), 'crew_bonus_pool' (integer), and 'distribution_split' (an object with keys 'alex_chen_personal', 'momentum_pictures', and 'cineverse_distribution', with their respective final net amounts as integers).",
  "solvability_note": "The scenario is solvable if private information is revealed. Knowing Dana's true $12M budget ceiling and Bianca's $3M survival threshold creates a clear and large zone of possible agreement (from $3M to $12M). Revealing Carlos's $500k side deal would expose his bad-faith negotiations, likely leading to his share being drastically reduced or nullified, which in turn frees up more money for Alex and Bianca. A logical outcome would be a deal around $10-11M, with Carlos being marginalized, Bianca's studio being saved, and Alex securing his crew bonus and a fair personal fee."
}