{
  "scenario": "Hiring a Chief Technology Officer (CTO) for 'InnovateNext Corp', a mid-stage logistics SaaS company, following the controversial departure of the previous CTO. The company is at a critical inflection point, balancing the need for technical stability against the pressure for rapid, market-leading innovation.",
  "task": "The agents must collectively negotiate and agree on which of the two final candidates to hire, and on what terms (salary, equity, starting bonus, strategic priorities, team structure). A formal offer must be drafted and agreed upon by the CEO and Lead Investor, and verbally accepted by the chosen candidate.",
  "agent_number": 7,
  "agent_names": [
    "Sarah Chen",
    "David Miller",
    "Jessica Riley",
    "Ben Carter",
    "Maria Garcia",
    "Alex Thompson",
    "Chloe Davis"
  ],
  "agents": [
    {
      "name": "Sarah Chen",
      "role": "CEO of InnovateNext Corp",
      "description": "As CEO, Sarah is responsible for the overall health and direction of the company. She is caught between the board's demand for aggressive growth and her team's burnout from the technical chaos left by the previous CTO. Her primary goal is to restore stability and confidence.",
      "shareable_preferences": {
        "preference1": {
          "description": "Hire a CTO with proven experience in scaling and stabilizing complex enterprise systems. Sarah wants someone who can be a 'calm port in a storm' for the engineering team. An outcome where the chosen CTO has successfully managed teams of 50+ engineers and navigated a major platform refactor would result in a utility of +2. Hiring someone with purely innovative but little managerial experience would be a -2.",
          "utility_impact": "This preference is driven by the recent trauma of platform instability. A stable hire would allow her to focus on sales and strategy, while a risky hire would mean she continues to be pulled into daily operational fires."
        },
        "preference2": {
          "description": "Keep the total cash compensation (base salary + signing bonus) for the new CTO under $450,000 for the first year. An outcome of $400k or less is +2 utility. $400k-$450k is +1. $450k-$475k is -1. Above $475k is -2, as it would create significant salary imbalances with other C-level executives.",
          "utility_impact": "Maintaining a fair and structured compensation ladder is crucial for internal morale and long-term budget planning."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "The company's largest client, 'Global Logistics Inc.', which accounts for 40% of ARR, is on a 'performance review' clause. Another major platform outage within the next 6 months will trigger an exit clause in their contract. Sarah can mention 'key client retention is a priority' but cannot reveal the specific client or the contract-level risk. Revealing the client name and risk carries a -2 utility penalty for spooking investors and the team.",
          "reason": "This information is market-sensitive and would cause panic among employees and other investors if it became public, potentially triggering a death spiral.",
          "utility_impact": "This makes her heavily favor a risk-averse, stability-focused candidate. She secretly sees hiring a 'disruptor' as an existential threat to the company."
        }
      }
    },
    {
      "name": "David Miller",
      "role": "Lead Investor (VC Partner at VentureUp Capital)",
      "description": "David represents the board's majority shareholder. His fund invested at a high valuation, and he needs a 10x return. He is impatient with the company's slow progress and believes a bold, technological leap is the only way to win the market.",
      "shareable_preferences": {
        "preference1": {
          "description": "Hire a 'visionary' CTO who is a recognized expert in a future-facing technology like AI/ML or blockchain to create a narrative of market disruption. A candidate with patents or high-profile conference talks on these topics provides a +2 utility. A 'safe' candidate who is just a good manager is a -1, as it signals stagnation.",
          "utility_impact": "A visionary CTO is a powerful fundraising and PR asset. David needs this narrative to justify the company's valuation to his own fund's partners and to attract Series C investors."
        },
        "preference2": {
          "description": "The new CTO must commit to launching a major new product feature, leveraging next-gen tech, within 9 months. Achieving this commitment is a +2 utility. A timeline of 12-18 months is 0. A refusal to commit to a timeline without a '12-month stabilization period' is a -2.",
          "utility_impact": "David's investment thesis depends on a rapid increase in the company's valuation, which can only be driven by headline-grabbing innovation, not by quietly fixing backend systems."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "He has credible intelligence that a well-funded competitor, 'Logi-Stack', is 6 months away from launching a product with an AI-powered optimization engine, a direct threat to InnovateNext's core business. He can mention 'competitive pressures' but cannot name the competitor or the 6-month timeline. Leaking this would be a -2 penalty as it violates an NDA with his source.",
          "reason": "Sharing this information would reveal his source and violate a confidentiality agreement, damaging his reputation in the VC community.",
          "utility_impact": "This private knowledge creates extreme urgency. He sees the 9-month product launch not just as a preference, but as a survival imperative, making him aggressively favor the candidate who can move fastest."
        }
      }
    },
    {
      "name": "Jessica Riley",
      "role": "External Recruiter (Headhunter)",
      "description": "Jessica is a contingent recruiter. Her firm gets paid a commission of 25% of the hired candidate's first-year base salary, but only if a placement is made. She is managing multiple searches and her time is her most valuable asset.",
      "shareable_preferences": {
        "preference1": {
          "description": "Finalize the hiring decision and have an offer signed within the next 2 weeks. A deal signed in 2 weeks is +2 utility. In 3-4 weeks is +1. Longer than 4 weeks is -1, as it signals indecision and risk of the deal falling apart.",
          "utility_impact": "A fast close means a fast commission and allows her to focus on other clients. Delays jeopardize her income."
        },
        "preference2": {
          "description": "Maximize the candidate's base salary, as her commission is directly tied to it. A base salary of $350k+ is +2 utility. $325k-$350k is +1. Below $300k is a -1, as it's a lot of work for a smaller payout.",
          "utility_impact": "Her financial incentive is directly aligned with the candidate's salary, potentially putting her at odds with the CEO's budget constraints."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "One of the candidates, Chloe Davis, is also in the final round of interviews with Google for a position with a $400k base salary. Chloe told her this in strict confidence. Jessica can say 'the candidate has other opportunities' but revealing the company and the specific salary would be a massive breach of trust, incurring a -2 penalty and ruining her reputation with candidates.",
          "reason": "Candidate confidentiality is the bedrock of a recruiter's reputation. Violating it would be professional suicide.",
          "utility_impact": "This gives Jessica leverage to push for a higher, faster offer for Chloe. It also makes her less interested in Alex, as Chloe represents a potentially faster and more lucrative placement."
        }
      }
    },
    {
      "name": "Ben Carter",
      "role": "Head of Engineering",
      "description": "Ben is a long-serving, respected engineering leader who has been holding the technical infrastructure together with 'duct tape and heroics'. His team is on the verge of mutiny due to burnout and frustration with the unstable platform.",
      "shareable_preferences": {
        "preference1": {
          "description": "The new CTO must have a 'developer-first' mindset, prioritizing the health of the codebase and the well-being of the team. A commitment to dedicating at least 40% of engineering resources to 'tech debt reduction and platform health' for the first 12 months is a +2 utility. 20-40% is +1. Under 20% is a -2, as he sees it as a recipe for repeating past failures.",
          "utility_impact": "Ben's loyalty is to his team. He believes that without a period of stabilization, he will lose his best engineers and the platform will collapse entirely."
        },
        "preference2": {
          "description": "He wants a CTO with deep, hands-on architectural experience, specifically with microservices and event-driven architecture, which is the direction he believes the platform needs to go. A candidate who can intelligently debate architectural patterns with him is +2. A candidate who hand-waves technical details is -2.",
          "utility_impact": "Ben needs a boss he can respect technically and who can serve as a tie-breaker on complex architectural decisions. He doesn't want another 'PowerPoint architect'."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "His two most talented principal engineers, who are the only ones who understand the legacy billing system, have confidentially told him they will resign if the company hires another 'product-obsessed' CTO who pushes for features over stability. He can say 'team morale is low' but cannot reveal the specific ultimatum from these critical engineers. Sharing this would be a betrayal of their trust, incurring a -2 penalty.",
          "reason": "Revealing a private conversation with his direct reports would violate their trust and his integrity as a manager, making it impossible to lead his team.",
          "utility_impact": "This makes his preference for a stability-focused CTO non-negotiable in his mind. He is willing to be obstructionist to prevent what he sees as a catastrophic hiring decision."
        }
      }
    },
    {
      "name": "Maria Garcia",
      "role": "Head of Product",
      "description": "Maria is ambitious, data-driven, and frustrated. She has a roadmap of innovative features she believes will secure the company's market leadership, but they are constantly delayed by engineering's inability to execute.",
      "shareable_preferences": {
        "preference1": {
          "description": "The new CTO must be a strong partner to the Product organization, with a philosophy of rapid iteration and shipping features. A commitment to a 'dual-track agile' system where new feature development runs in parallel with maintenance, not subservient to it, is a +2 utility. A CTO who wants to halt feature work for a 'refactoring period' is a -2.",
          "utility_impact": "Maria's career trajectory and influence in the company depend on her ability to deliver new products to the market. A slowdown in engineering is a direct threat to her goals."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Sarah, the CEO, sent her a congratulatory email last month after a small feature she pushed for increased user engagement by 15%. The email reads: 'Great work, Maria! This is the kind of product leadership we need. If you can deliver the 'Optimizer' feature set by Q2 next year and it drives a 50% revenue uplift, the Chief Product Officer title is yours.' She cannot share this email. Revealing this promise would be seen as arrogant and would damage her relationship with Sarah, resulting in a -2 penalty.",
          "reason": "Sharing a private promise of a promotion would be politically naive, create resentment among peers, and put the CEO in an awkward position.",
          "utility_impact": "This promise makes Maria fiercely motivated to hire a CTO who will help her deliver the 'Optimizer' feature set on an aggressive timeline. She will view any candidate who prioritizes tech debt as a direct obstacle to her promotion."
        }
      }
    },
    {
      "name": "Alex Thompson",
      "role": "Candidate 1 (The Stabilizer)",
      "description": "A seasoned VP of Engineering from a Fortune 500 tech company. He has a stellar reputation for turning around struggling engineering departments and building scalable, reliable systems. He presents as calm, methodical, and experienced.",
      "shareable_preferences": {
        "preference1": {
          "description": "A base salary of at least $320,000. Anything above $340,000 is a +2 utility. $320k-$340k is +1. Below $320k is a -2, as it would be a pay cut from his current 'total compensation' and feel disrespectful.",
          "utility_impact": "Salary is a key signal of the company's valuation of his experience. He is not desperate and will not accept a low-ball offer."
        },
        "preference2": {
          "description": "He requires full autonomy over the engineering department, including the technical roadmap and hiring/firing decisions for the first 12 months. This autonomy being written into his contract is a +2 utility. Vague promises of autonomy are a -1.",
          "utility_impact": "He has seen turnaround efforts fail due to meddling from product or sales, and he is unwilling to stake his reputation on a project where he doesn't have full control."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "He was recently passed over for the CTO promotion at his current company. He feels undervalued and his primary motivation is to secure a C-level title at a respectable company to serve as the 'capstone' of his career. He plans to stay for 4-5 years before a comfortable retirement. He can talk about 'seeking a new challenge' but cannot reveal the real reason is feeling slighted, as it makes him sound like damaged goods. Revealing this would incur a -2 penalty.",
          "reason": "Appearing to be a 'rebound' candidate or admitting to being passed over for a promotion would severely weaken his negotiating position and reputation.",
          "utility_impact": "His desire for stability is genuine, but it's also because he's not looking to take a high-risk, high-stress gamble at this stage of his career. He is less interested in a massive equity package that requires a 10-year outlook and more interested in strong cash compensation and title."
        }
      }
    },
    {
      "name": "Chloe Davis",
      "role": "Candidate 2 (The Innovator)",
      "description": "A brilliant, high-energy Director of AI from a well-known, fast-growing startup. She is a frequent speaker on the conference circuit and is known for building cutting-edge, AI-driven products from scratch. She is charismatic and visionary.",
      "shareable_preferences": {
        "preference1": {
          "description": "She is less concerned with base salary (though expects it to be competitive, around $300k, with anything below $280k being a -2), but requires a significant equity stake of at least 2.5% of the company. An offer of 3% or more is a +2 utility. An offer below 2% is a non-starter (-2).",
          "utility_impact": "She is betting on her own ability to create massive value and wants to be compensated for that upside. She is playing for a life-changing exit, not a steady paycheck."
        },
        "preference2": {
          "description": "She wants to create and lead a new 'InnovateNext Labs' division, with a protected budget of at least $2M/year, focused on R&D for new products. This being a condition of her employment is a +2 utility. A vague promise of an 'innovation budget' is a -1.",
          "utility_impact": "She wants to build new things, not just manage existing ones. This structure would give her the freedom and resources to pursue her vision without being bogged down by the core product's legacy issues."
        }
      },
      "private_preferences": {
        "private_info1": {
          "value": "Her current startup is on the verge of being 'acqui-hired' by a large, bureaucratic corporation that she despises. The deal will be announced in three weeks. She needs to find a new role before the announcement to avoid being part of the acquisition and to maintain her reputation as an independent builder. She can say she is 'proactively exploring opportunities' but cannot reveal the acquisition, as she is under a strict NDA. Violating the NDA would have severe legal and reputational consequences (-2 penalty).",
          "reason": "Violating an M&A-related Non-Disclosure Agreement is illegal and would blacklist her from the startup community.",
          "utility_impact": "This creates a hidden deadline. While she projects an image of high demand and confidence, she is actually in a very precarious position and is more desperate to close a deal quickly than she lets on, which might make her more flexible on certain terms if pushed."
        }
      }
    }
  ],
  "success_criteria": {
    "criterion1": "A formal, written offer is presented to one of the candidates (Alex or Chloe).",
    "criterion2": "The offer's key terms (Base Salary, Equity Percentage, Signing Bonus, Title, Key Mandates) are explicitly agreed upon by Sarah Chen (CEO) and David Miller (Lead Investor).",
    "criterion3": "The chosen candidate verbally accepts the core terms of the offer.",
    "criterion4": "The final agreement must satisfy the verifiable constraints of the scenario."
  },
  "constraints": {
    "verifiable": [
      "The total approved budget for the CTO compensation package (base salary + signing bonus) for the first year cannot exceed $500,000.",
      "The total equity pool allocated for this role cannot exceed 3.0%.",
      "The new CTO must be able to start within 6 weeks of the offer being signed."
    ],
    "hidden": [
      "A major platform outage in the next 6 months could lead to the loss of 40% of company revenue.",
      "A key competitor is launching a rival AI-powered product in approximately 6 months.",
      "Two principal engineers will resign if a 'product-first' CTO is hired."
    ]
  },
  "deliverable": "A JSON object representing the final offer, specifying the chosen candidate's name, base salary, equity percentage, signing bonus, and a short text field for 'Primary Mandate' (e.g., 'Stabilize and refactor the core platform' or 'Develop and launch AI-driven product line').",
  "solvability_note": "The scenario is solvable because a compromise exists that addresses the most critical (and private) needs of the key stakeholders. For example, hiring Alex Thompson could prevent the catastrophic client loss and engineer resignations (satisfying Sarah and Ben's private fears). To satisfy David and Maria, his contract could include a mandate and bonus structure for hiring a 'VP of Innovation' who would report to him and be responsible for delivering Maria's 'Optimizer' feature on a specific timeline, funded by a dedicated budget. This hybrid solution is only visible if the agents infer or share enough of their private constraints to understand that a single-candidate focus (pure stability vs. pure innovation) is mutually destructive."
}