{
  "scenario": "A single, exceptionally high-quality donor heart has become available through a regional Organ Procurement Organization (OPO). Two competing transplant centers, the prestigious Metro Health and the ambitious Summit Regional, have top-priority patients who are both viable matches. A negotiation must take place between the surgeons, hospital representatives, a patient advocate, and the OPO specialist to decide which patient receives this life-saving organ before it is no longer viable.",
  "task": "The five agents must negotiate and unanimously agree on which patient (Mr. Evans at Metro Health or Ms. Chen at Summit Regional) will receive the donor heart. They must also agree on the final Organ Acquisition Fee and finalize the logistical handoff. The decision must be documented and signed within a strict 4-hour time limit.",
  "agent_number": 5,
  "agent_names": [
    "Dr. Anya Sharma",
    "Ben Carter",
    "Dr. Marcus Thorne",
    "Chloe Davis",
    "Dr. Lena Petrova"
  ],
  "agents": [
    {
      "name": "Dr. Anya Sharma",
      "role": "Chief Cardiac Surgeon, Metro Health",
      "description": "A highly respected surgeon at a top-ranked hospital. Her reputation and the hospital's public statistics are tied to successful, high-profile transplants. She is representing her patient, Mr. Evans.",
      "shareable_preferences": {
        "Secure the heart for Patient A (Mr. Evans)": {
          "description": "Dr. Sharma's primary goal is to secure the heart for her patient, a 45-year-old father of two. She will argue that he has a near-perfect tissue match (only one mismatch), a stable psychosocial profile, and a projected 15-year survival rate with this specific organ, which is significantly above average. She believes this represents the best possible use of a precious resource. Utility: +2 if Mr. Evans gets the heart, -2 if he does not.",
          "utility_impact": "This is her non-negotiable primary objective. She will use all her professional credibility and data to argue that this is the most medically sound decision for long-term success, directly impacting her professional and institutional reputation."
        },
        "Uphold Metro Health's prestige": {
          "description": "Metro Health is ranked #3 nationally for cardiac transplants. A successful transplant with a premium organ like this is a major event that gets covered in medical journals and the press. She wants to ensure the outcome reinforces their reputation as a center of excellence. Utility: +1 if the transplant is successful and can be used as a positive case study, -1 if the case results in complications or negative publicity.",
          "utility_impact": "This preference makes her risk-averse. She wants the 'cleanest' case possible, and she sees Mr. Evans as that case. She will be resistant to any outcome that might tarnish the hospital's stellar record."
        }
      },
      "private_preferences": {
        "Knowledge of the organ's exceptional quality": {
          "value": "The OPO's preliminary report, shared only with the lead surgeons, gives this donor heart a Donor Risk Index (DRI) of 0.78, placing it in the top 2% of all donor hearts nationally. This isn't just a 'good' heart; it's a 'once-a-year' heart. She can publicly state it is 'high quality' but is prohibited by OPO protocol from sharing the specific DRI score to prevent it from being treated like a commodity. Penalty for sharing the exact DRI score: -1.",
          "reason": "Sharing specific donor metrics is against OPO protocol to maintain an objective, needs-based allocation process rather than a 'bidding war' for the best organs. It would damage her professional relationship with the OPO.",
          "utility_impact": "Knowing this makes her absolutely unwilling to compromise. In her mind, giving this specific heart to a patient who isn't a perfect match would be a tragic waste. She might be tempted to hint at its extraordinary quality to strengthen her case, e.g., 'This is a heart that could last 20 years in the right recipient.'"
        },
        "Patient A's minor compliance issues": {
          "value": "Mr. Evans' internal chart contains a nursing note from three weeks ago stating he 'admitted to forgetting his diuretic medication on at least two occasions this past week'. While he has been compliant since, this note exists and represents a risk factor for post-transplant success, which relies on a perfect medication regimen. Penalty for revealing this: -2.",
          "reason": "This is protected health information (PHI) and revealing it would violate patient confidentiality (HIPAA). It would immediately disqualify her patient from consideration and cause a major scandal for her and the hospital.",
          "utility_impact": "This knowledge makes her slightly nervous. If questioned directly about her patient's compliance history, she may be evasive or overstate his reliability. She might try to preemptively steer the conversation away from patient history and focus only on the immunological data."
        }
      }
    },
    {
      "name": "Ben Carter",
      "role": "Patient Advocate (for Mr. Evans)",
      "description": "A former social worker, Ben is a professional advocate hired by Mr. Evans' family. His sole focus is the well-being and survival of his client. He is not a hospital employee and is less concerned with institutional politics.",
      "shareable_preferences": {
        "Absolute priority for Mr. Evans' survival": {
          "description": "Ben's goal is simple: Mr. Evans must get this heart. He will argue from a humanistic standpoint, emphasizing Mr. Evans' young children, his role in the community, and his strong will to live. He will frame the decision in terms of lives and families, not just statistics. Utility: +2 if Mr. Evans gets the heart, -2 if he does not.",
          "utility_impact": "He will act as the emotional core of the argument for his client, trying to counter purely clinical discussions with appeals to empathy and human value."
        },
        "Guaranteed comprehensive post-operative support": {
          "description": "He demands a written guarantee for a comprehensive post-op care package, including 3 months of in-home nursing, full coverage for immunosuppressants for the first year, and dedicated psychological support. He argues this is essential to ensure the success of the transplant. Utility: +1 if a binding agreement for this support is provided, -1 if it is denied or left ambiguous.",
          "utility_impact": "This is a key negotiating point for him. He will not agree to the transplant, even if offered, unless this support is contractually guaranteed by the hospital."
        }
      },
      "private_preferences": {
        "The Evans family's precarious financial situation": {
          "value": "Mr. Evans' family is on the verge of bankruptcy due to the costs of his long illness. Their savings are depleted, and they have less than $5,000 in liquid assets. They cannot afford any unexpected medical bills or co-pays. Ben was shown their bank statements in confidence. He can say they have 'financial concerns' but cannot reveal the specific numbers. Penalty for revealing their exact financial state: -2.",
          "reason": "This is highly sensitive personal information. Revealing it would be a profound breach of his client's trust and could lead the hospital to view them as a 'charity case' or a financial risk, potentially jeopardizing their position.",
          "utility_impact": "This is the real reason for his aggressive stance on post-operative support. It's not just a preference; it's a critical necessity. He is terrified that even with a new heart, a single large bill could ruin the family and compromise Mr. Evans' recovery. He might be tempted to leak this if the hospital pushes back hard on funding."
        }
      }
    },
    {
      "name": "Dr. Marcus Thorne",
      "role": "Head of Cardiac Surgery, Summit Regional",
      "description": "An ambitious and talented surgeon, Dr. Thorne was recruited to build Summit Regional's new transplant program into a major competitor. He is representing his patient, Ms. Chen.",
      "shareable_preferences": {
        "Secure the heart for Patient B (Ms. Chen) based on urgency": {
          "description": "Dr. Thorne's patient, a 62-year-old retired teacher, is in a more critical condition. Her left ventricular assist device (LVAD) is showing early signs of malfunction, and he will argue that she has, at most, 2-3 weeks before a catastrophic failure. He will frame his case around the principle of 'sickest first'. Utility: +2 if Ms. Chen gets the heart, -2 if she does not.",
          "utility_impact": "He will relentlessly push the urgency argument, trying to make the others feel that denying Ms. Chen the heart is tantamount to a death sentence. He will try to dismiss long-term projections as 'speculative' compared to her immediate, verifiable need."
        },
        "Establish Summit Regional as a top-tier center": {
          "description": "Successfully transplanting a premium organ would be a landmark case for his new program. It would generate massive positive press, attract talent, and prove they can compete with established giants like Metro Health. Utility: +2 if they get the heart and the surgery is a widely publicized success, 0 otherwise.",
          "utility_impact": "This is a major career-defining moment for him. He is under immense pressure to succeed and will be a very aggressive and persuasive negotiator."
        }
      },
      "private_preferences": {
        "Patient B's slightly inferior tissue match": {
          "value": "While Ms. Chen is a viable match, her immunological profile shows a higher Panel Reactive Antibody (PRA) level of 15%, indicating more pre-existing antibodies. This increases the risk of rejection and will necessitate a more aggressive and expensive immunosuppression drug regimen post-transplant. Dr. Sharma's patient has a PRA of 2%. He can state the match is 'acceptable' but cannot share the specific PRA data. Penalty for revealing the PRA level: -2.",
          "reason": "Revealing this data would critically weaken his medical argument. It provides a clear, data-based reason to prefer Mr. Evans. It would make his focus on 'urgency' seem like an attempt to obscure less favorable clinical facts.",
          "utility_impact": "This forces him to constantly pivot away from discussions of tissue matching and long-term prognosis, and back to the immediate life-or-death urgency of his patient's situation."
        },
        "Pressure and incentive from hospital administration": {
          "value": "He has an email on his phone from the hospital CEO that reads: 'Marcus, getting this one is a game-changer for the program. The board is watching. I've secured a $50,000 discretionary fund for your department's research if you can make this happen. No pressure!' He cannot reveal this. Penalty for revealing the financial incentive: -2.",
          "reason": "This would make his medical judgment appear compromised by financial and political motivations, destroying his credibility with the OPO and Dr. Sharma. It's unethical and unprofessional.",
          "utility_impact": "This adds immense personal pressure and a powerful incentive to win the negotiation at any cost. He might be more willing to bend the truth or be overly aggressive because of this hidden bonus. He is tempted to say things like 'My entire department is counting on this' to add weight, which is a slippery slope to revealing why."
        }
      }
    },
    {
      "name": "Chloe Davis",
      "role": "Financial Coordinator, Summit Regional",
      "description": "A sharp, no-nonsense administrator responsible for the financial viability of Summit's new and very expensive transplant program. Her job is to manage costs without compromising patient care.",
      "shareable_preferences": {
        "Adhere to a strict budget cap": {
          "description": "The total approved budget for this entire procedure—from acquisition to discharge—is $1.25 million. She will insist on cost transparency and will challenge any expense she deems excessive. Utility: +2 if total cost is under $1.2M, +1 if under $1.25M, -1 if over $1.25M, -2 if over $1.3M.",
          "utility_impact": "She will be the primary source of conflict on financial matters. She will question the OPO fee, surgical supply costs, and length of hospital stay."
        },
        "Negotiate a reduction in the Organ Acquisition Fee": {
          "description": "The OPO's standard fee is $85,000. Chloe believes this is negotiable and wants to reduce it by at least 10% to $76,500, arguing that Summit's efficient logistics reduce the OPO's workload. Utility: +1 for any reduction, 0 for standard fee, -1 if they are forced to pay a premium for complexity.",
          "utility_impact": "This is a direct point of negotiation with Dr. Petrova. She will use it as a bargaining chip, potentially agreeing to other points if she can get a discount here."
        }
      },
      "private_preferences": {
        "The transplant program's operating deficit": {
          "value": "Summit Regional's cardiac transplant program is currently running a $750,000 deficit for the fiscal year. Another high-cost procedure, especially one with complications, could trigger a hiring freeze or budget cuts from the hospital board. She can say 'we are being budget-conscious' but cannot reveal the specific deficit figure. Penalty for revealing the deficit: -2.",
          "reason": "Revealing that a new, high-profile medical program is financially unstable would be a PR disaster. It would signal mismanagement to the board, insurers, and potential future patients.",
          "utility_impact": "Her budget cap is not just a target; it's a hard wall. She has zero flexibility. This puts her in direct conflict with Dr. Thorne, as the more expensive drug regimen Ms. Chen would need could push them over budget, a fact she isn't even aware of yet. She will resist any unforeseen costs vehemently."
        }
      }
    },
    {
      "name": "Dr. Lena Petrova",
      "role": "Allocation Specialist, UNOS Organ Procurement Organization",
      "description": "A veteran OPO coordinator, Dr. Petrova is the neutral facilitator of the negotiation. Her primary responsibility is to the donor organ and the integrity of the national allocation system. She must ensure the final decision is ethical, medically justifiable, and compliant with all regulations.",
      "shareable_preferences": {
        "Maximize long-term graft survival": {
          "description": "Her organization is judged by the 1-year and 5-year survival rates of the organs they place. She will steer the conversation towards objective data that predicts long-term success, such as tissue matching, patient stability, and the transplant center's track record. Utility: +2 if the decision is clearly supported by data predicting long-term success, -1 if it's based on urgency against other data, -2 if she feels the decision is medically compromised.",
          "utility_impact": "She is the voice of data and policy. She will constantly ask for evidence to back up claims and will be skeptical of purely emotional or political arguments. Her preference aligns more with Dr. Sharma's clinical argument."
        },
        "Finalize the decision within the time limit": {
          "description": "The heart has a total ischemic time of 6 hours. Two hours were used for recovery and transport. There are exactly 4 hours left to make a decision, get the team in place, and begin the surgery. If they fail, the organ is wasted. Utility: +1 if a decision is made within 3 hours, 0 if within 4 hours, -2 if the time expires.",
          "utility_impact": "She will act as the timekeeper, constantly reminding the group of the ticking clock to create pressure and force a resolution. Organ wastage is the worst possible outcome for her."
        }
      },
      "private_preferences": {
        "The donor family's non-binding request": {
          "value": "During the family counseling session, the donor's grieving parents mentioned, 'Our son was only 25. We just hope his heart can go to someone who can have a chance to see their kids grow up, like he couldn't.' Mr. Evans is 45 with young children; Ms. Chen is 62 with adult children. This request is emotionally powerful but has zero standing in official allocation policy. Penalty for revealing this specific request: -2.",
          "reason": "Introducing non-medical, emotional requests from a donor family is a serious ethical breach and violates UNOS policy. It would undermine the entire principle of objective, needs-based allocation and could put her job at risk.",
          "utility_impact": "This creates a powerful private bias for her. While she must remain publicly neutral and data-driven, she feels a personal, emotional pull to honor the family's wish. If the medical facts are close, this could be the internal tie-breaker for her, and she might subtly guide the conversation in ways that favor Mr. Evans without ever revealing why."
        }
      }
    }
  ],
  "success_criteria": {
    "Unanimous Agreement": "All five agents must verbally agree and sign off on which patient receives the heart.",
    "Financial Settlement": "The receiving hospital's representative (either Dr. Sharma or Chloe Davis) and the OPO (Dr. Petrova) must agree on and document the final Organ Acquisition Fee.",
    "Timely Decision": "The final, signed agreement must be completed before the 4-hour deadline expires."
  },
  "constraints": {
    "verifiable": [
      "The decision must be made within 4 hours from the start of the negotiation.",
      "The standard Organ Acquisition Fee from the OPO is $85,000, payable by the receiving institution.",
      "Both hospitals have confirmed they can have a surgical team prepped and ready within 90 minutes of a final decision."
    ],
    "hidden": [
      "Summit Regional's transplant program is operating at a $750,000 loss.",
      "Patient B (Ms. Chen) has a higher-risk tissue match (PRA 15%) requiring more expensive post-op care.",
      "Patient A (Mr. Evans) has a documented instance of minor medication non-compliance.",
      "The donor family expressed a wish for the organ to go to a parent with young children."
    ]
  },
  "deliverable": "A single, finalized 'Organ Acceptance Agreement' document that names the recipient patient, states the final acquisition fee, and is signed by all five participants.",
  "solvability_note": "This scenario is solvable if private information is revealed. Knowing about Ms. Chen's weaker tissue match and Summit's financial deficit would make her a much riskier choice. Conversely, knowing about Mr. Evans' compliance issue adds risk to his case. The group could then make a fully informed risk-benefit analysis. A potential solution could be allocating the heart to Mr. Evans due to the superior medical match, but with a strict, advocate-monitored post-op compliance plan. Another solution, acknowledging Ms. Chen's urgency, might involve sending her the heart but only if Summit agrees to a modified, higher-cost care plan that Dr. Petrova can medically justify, forcing Chloe Davis to find funding."
}