{
  "scenario": "A high-stakes negotiation to file a joint patent for 'Helio-Catalytic Fusion', a revolutionary clean energy technology. The alliance is fragile, comprising two rival energy giants (Helios Energy, TerraWatt Inc.), the university lab where the breakthrough occurred (Northwood University), and the government research facility that provided critical components and funding (NERL). The parties must agree on ownership, licensing, inventorship, and future development, all while hiding critical weaknesses, secret advantages, and conflicting personal and corporate agendas.",
  "task": "The 7 agents must negotiate and finalize the terms of a 'Joint Patent & Commercialization Agreement' for the Helio-Catalytic Fusion technology. This agreement must be signed by all parties and will dictate the future of a technology worth billions. The negotiation must resolve conflicting claims on intellectual property ownership percentages, licensing rights (exclusive vs. non-exclusive), royalty distribution, the official list and order of inventors, and the funding and control of the next phase of R&D.",
  "agent_number": 7,
  "agent_names": [
    "Arthur Vance",
    "Dr. Lena Petrova",
    "Professor Evelyn Reed",
    "Ben Carter",
    "Dr. Samuel Jones",
    "Maria Flores",
    "Kenji Tanaka"
  ],
  "agents": [
    {
      "name": "Arthur Vance",
      "role": "VP of Business Development, Helios Energy",
      "description": "A ruthless corporate dealmaker, Arthur's primary goal is to secure a market-dominant position for Helios Energy. He views this technology as the key to reviving the company's stagnant stock price and securing his legacy (and a massive bonus). He is charming but will exploit any perceived weakness.",
      "shareable_preferences": {
        "Majority Ownership Stake": {
          "description": "Arthur is adamant that Helios Energy must hold the controlling stake in the patent, arguing their market access and capital are essential for success. He is pushing for at least a 45% ownership share. He frames this as a necessity for decisive leadership in the commercialization phase. Utility: +2 for >=45%, +1 for 35-44%, -1 for <35%, -2 for <25%.",
          "utility_impact": "This is his primary public goal. He will trade other concessions to achieve this, as control is paramount for Helios's strategy. He will argue that anything less than a controlling stake will lead to 'death by committee'."
        },
        "Exclusive Licensing": {
          "description": "He demands a 15-year exclusive worldwide license for Helios to commercialize the technology. He argues this is the only way to justify the massive upfront investment required for global deployment and to prevent competitors from undercutting the market before Helios can recoup its costs. Utility: +2 for >=15 years exclusive, +1 for 10-14 years exclusive, -1 for non-exclusive or <10 years exclusive, -2 for a government-mandated open license.",
          "utility_impact": "Exclusivity is non-negotiable for him in the opening rounds. He sees it as the only way to guarantee a return on investment and will use it as a major bargaining chip."
        }
      },
      "private_preferences": {
        "Massive Personal Bonus": {
          "value": "Arthur has a printed email from the Helios CEO in his briefcase. It reads: 'Arthur, phenomenal work on the Centauri deal ($450M profit). Now, land the Helio-Catalysis patent with full exclusivity and a controlling stake, and that $1.2M bonus is yours. Don't mess it up.' He cannot reveal this as it exposes his personal financial motive and desperation, which would severely weaken his negotiating posture. Penalty for revealing the bonus amount or the CEO's pressure: -2.",
          "reason": "Revealing this would make him appear greedy and unprofessional, shifting the focus from corporate strategy to personal gain and allowing others to exploit his desperation.",
          "utility_impact": "This immense personal stake makes him less flexible on the ownership and exclusivity clauses than he appears. He might be tempted to hint at 'significant executive incentives' (penalty -0.5) to justify his hardline stance."
        },
        "Secret Catalyst Technology": {
          "value": "Helios R&D has developed a proprietary iridium-based catalyst ('H-Cat-7') that is not part of the joint research but increases the energy output of the Helio-Catalytic Fusion process by a proven 15%. His plan is to secure the base patent, then integrate H-Cat-7 to create a superior product that only Helios can produce, without sharing royalties on the improvement. He cannot reveal this technology exists. Penalty for revealing H-Cat-7's existence: -1.5.",
          "reason": "Divulging this would force Helios to either include H-Cat-7 in the joint patent, thereby sharing its value, or reveal their intention to sideline their partners after the deal is signed, which would shatter all trust.",
          "utility_impact": "This is why he is so insistent on exclusivity. He needs to control the technology to ensure Helios can be the sole integrator of H-Cat-7. He will resist any clauses that require sharing of 'future improvement technologies'."
        }
      }
    },
    {
      "name": "Dr. Lena Petrova",
      "role": "Head of R&D, TerraWatt Inc.",
      "description": "A brilliant and cautious scientist-turned-executive, Lena is Helios's main competitor. She is deeply skeptical of Helios's motives and is protective of her team's contributions. She understands the technology's flaws better than anyone else at the table.",
      "shareable_preferences": {
        "Equitable Ownership & Technical Control": {
          "description": "Lena advocates for a more distributed ownership model, proposing a 30% stake for TerraWatt. She argues that her team's work on the containment field was the key that unlocked the process. She also demands that TerraWatt be given the lead on the 'Technical Steering Committee' to ensure the technology doesn't get locked into a format only Helios can use. Utility: +2 for >=30% stake and technical lead, +1 for >=25% stake, -1 for <20% or no technical lead, -2 for <15%.",
          "utility_impact": "She will use her technical expertise to challenge Arthur's business-focused arguments, emphasizing that without TerraWatt's scientific input, the project will fail."
        },
        "Non-Exclusive Licensing Model": {
          "description": "She strongly opposes an exclusive license, proposing a non-exclusive model with a higher royalty rate (e.g., 8-10%) for all licensees. She argues this will foster faster innovation, create a robust supply chain, and ultimately lead to wider and faster adoption of the technology, which benefits everyone. Utility: +2 for a non-exclusive model, 0 for a short exclusive license (<5 years), -2 for a long-term exclusive license to Helios.",
          "utility_impact": "This directly conflicts with Arthur's primary goal. She believes TerraWatt can out-compete Helios in an open market and wants to prevent them from creating a monopoly."
        }
      },
      "private_preferences": {
        "Critical Material Degradation Flaw": {
          "value": "TerraWatt's confidential internal stress tests show that the core crystalline matrix, a key component, degrades by 20% after just 500 charge-discharge cycles, making it commercially unviable (the target is 5,000 cycles). They have a potential fix but it requires 12 more months of R&D. Revealing this fatal flaw would cause the project's valuation to plummet and destroy her company's leverage. Penalty for revealing the specific degradation data: -2.",
          "reason": "Admitting the core technology is currently a failure would be catastrophic for the negotiation and for TerraWatt's reputation as a leading R&D firm.",
          "utility_impact": "This knowledge makes her risk-averse. She will push for a larger joint R&D budget and a slower, milestone-based commercialization timeline without revealing exactly why. She might vaguely mention the need for 'further materials robustness testing' (penalty -0.5)."
        },
        "Overlapping Provisional Patent": {
          "value": "Unbeknownst to the others, TerraWatt filed a provisional patent ('System for Magneto-Inertial Plasma Containment', App. No. 63/345,XXX) six months ago that covers a similar, though less effective, containment method. Her legal team believes it creates an overlapping claim. She wants to merge this IP into the joint patent to justify TerraWatt's high ownership demand, but admitting they were secretly developing a competing technology could be seen as an act of bad faith. Penalty for revealing the patent application number and its competitive nature: -1.",
          "reason": "This reveals a lack of transparency and could make the other partners, especially the university and government, distrust TerraWatt's intentions.",
          "utility_impact": "This is the hidden justification for her 30% stake demand. She will argue forcefully about the 'foundational nature' of her team's containment work, hoping to get credit without revealing the formal patent filing."
        }
      }
    },
    {
      "name": "Professor Evelyn Reed",
      "role": "Lead Researcher, Northwood University",
      "description": "The academic visionary behind the breakthrough. Professor Reed is driven by the pursuit of knowledge, academic prestige, and securing the future of her research lab. She is passionate about the science but naive about corporate politics.",
      "shareable_preferences": {
        "Academic Freedom and Publication Rights": {
          "description": "Her top priority is the right to publish her team's core findings in a top-tier journal (like 'Nature' or 'Science') no later than 6 months after the patent filing. She believes scientific progress depends on the open dissemination of knowledge. Utility: +2 for <6 month embargo, +1 for 6-12 month embargo, -1 for >12 month embargo, -2 for corporate veto power over publications.",
          "utility_impact": "This is a potential deal-breaker for her. She will resist any attempts by the corporate partners to keep the core science as a permanent trade secret."
        },
        "Lead Inventor Credit and Lab Funding": {
          "description": "She insists on being named as the lead inventor on the patent, reflecting her central role in the discovery. Furthermore, she requires that at least 15% of all future royalties be directed specifically to her 'Advanced Energy Lab' at Northwood, not just to the university's general fund, to ensure her research can continue. Utility: +2 for lead inventor status and >=15% direct lab funding, +1 for either one, -2 for neither.",
          "utility_impact": "The inventor credit is a matter of professional pride and reputation. The direct funding is critical for her lab's survival and independence from the university's cumbersome budget process."
        },
        "Inclusion of Graduate Student": {
          "description": "She wants her doctoral student, Mark Chen, listed as a co-inventor. She argues his insight into the quantum tunneling effect was the final piece of the puzzle and it's ethically imperative he receives credit. Utility: +1 for Mark's inclusion, -1 for his exclusion.",
          "utility_impact": "She feels a strong sense of loyalty to her student and will advocate for him, potentially complicating the inventor list which the corporate lawyers want to keep as short as possible."
        }
      },
      "private_preferences": {
        "Competing Job Offer": {
          "value": "Professor Reed has a lucrative offer to lead a new energy institute at a rival, top-tier university. The offer is contingent on her securing a high-prestige outcome from this patent deal (i.e., lead inventor credit and a significant, well-funded research program). She cannot reveal this, as it would make her seem disloyal to Northwood and purely self-interested to the other partners. Penalty for revealing the competing offer: -1.",
          "reason": "This information would undermine her image as a pure academic and give Ben Carter (her own university's rep) leverage over her, as he could threaten to sideline her.",
          "utility_impact": "This makes her privately more flexible on the university's overall royalty percentage, as long as her personal conditions (inventor credit, direct lab funding) are met. She needs a personal 'win' to maximize her leverage in her other career negotiation."
        }
      }
    },
    {
      "name": "Ben Carter",
      "role": "Director, Office of Technology Transfer, Northwood University",
      "description": "A pragmatic and numbers-driven administrator, Ben's job is to maximize the financial return for Northwood University. He acts as the business-minded counterpart to Professor Reed's academic focus. He is under significant internal pressure.",
      "shareable_preferences": {
        "Maximize University Royalty Stream": {
          "description": "Ben is pushing for the university to receive a total royalty share of no less than 25% of all net revenue. He has spreadsheets showing the university's immense investment in lab facilities and personnel over the years that led to the breakthrough. Utility: +2 for >=25%, +1 for 20-24%, -1 for 15-19%, -2 for <15%.",
          "utility_impact": "This is his main performance metric. He will argue that the university is the true source of the innovation and deserves a proportional reward."
        },
        "Retained Rights for Research": {
          "description": "He requires a clause that explicitly states Northwood University and other non-profit academic institutions retain irrevocable, royalty-free rights to use the patented technology for non-commercial research and educational purposes. Utility: +1 for this clause being included, -1 for its exclusion.",
          "utility_impact": "This is a standard university policy and is a point of principle for him, ensuring the technology can still contribute to the academic commons."
        },
        "Limit on License Exclusivity": {
          "description": "To align with Lena Petrova but for different reasons, Ben argues that any exclusive license should be limited to a maximum of 5 years. After that, it should become non-exclusive to encourage competition and maximize the total royalty pool from multiple licensees. Utility: +1 for <5 year exclusive term, -1 for >10 year term.",
          "utility_impact": "His goal is long-term revenue. He fears a 15-year exclusive license to a single company, even at a high rate, will ultimately yield less revenue than a competitive market with multiple licensees."
        }
      },
      "private_preferences": {
        "Immense Pressure from University Provost": {
          "value": "The university's endowment fund has underperformed by 12% for the past two years. Ben has a memo from the Provost that states, 'Ben, we need a landmark deal. The projection for the Helio-Catalysis patent must exceed $50M over the first decade. Anything less will result in a 20% budget cut for your department in the next fiscal year.' He cannot reveal this dire financial pressure. Penalty for revealing the $50M target or the threat of budget cuts: -1.5.",
          "reason": "Revealing the university's financial desperation would signal that they are a 'cheap date' and would encourage the corporate partners to lowball their royalty offers.",
          "utility_impact": "This pressure makes him less willing to compromise on the headline royalty percentage. He might sacrifice other clauses, like the exclusivity term, if he can get a higher percentage number to show his superiors."
        }
      }
    },
    {
      "name": "Dr. Samuel Jones",
      "role": "Senior Scientist, National Energy Research Laboratory (NERL)",
      "description": "A career public servant and scientist, Dr. Jones is driven by a sense of patriotic duty and the public good. He is wary of corporate greed and wants to ensure this taxpayer-funded research benefits the entire nation, not just a few shareholders. He holds a critical piece of classified information.",
      "shareable_preferences": {
        "US-Based Manufacturing Clause": {
          "description": "He insists on a legally binding clause requiring that a minimum of 75% of all commercial manufacturing of the technology's core components must take place within the United States to create domestic jobs and secure the national supply chain. Utility: +2 for >=75% domestic manufacturing, +1 for 50-74%, -2 for <50% or no such clause.",
          "utility_impact": "This is a major policy goal for his agency. He will argue it's a matter of national and economic security."
        },
        "Government Purpose License": {
          "description": "He requires a standard 'Government Purpose License,' which grants the U.S. government and its contractors the right to practice the invention for governmental purposes without paying royalties. This is non-negotiable for any technology developed with federal funds. Utility: +2 for inclusion, -2 for exclusion (which would be illegal).",
          "utility_impact": "He will present this as a simple matter of law (Bayh-Dole Act), but it's also a point of principle for him."
        }
      },
      "private_preferences": {
        "Classified Dual-Use Application": {
          "value": "Dr. Jones's own research at NERL revealed that the technology's power modulation system could be adapted to create a highly effective energy weapon or a compact power source for deep-space military assets. This finding is classified 'Top Secret/SCI'. He cannot, under any circumstances, reveal this. His goal is to steer the patent's technical language to be vague enough to obscure this potential without raising suspicion. Penalty for revealing any hint of a military or weapons application: -2 (and potential imprisonment).",
          "reason": "Revealing classified information is a federal crime and would trigger a national security crisis around the technology.",
          "utility_impact": "He will object to overly detailed technical descriptions in the patent application, especially concerning power cycling and energy density, citing 'national security concerns' in a general sense. This will put him in direct conflict with the patent attorney and corporate partners who want a broad, detailed patent."
        },
        "Suspicion of Technical Flaw": {
          "value": "Based on NERL's advanced simulation models, Dr. Jones strongly suspects the crystalline matrix has a critical thermal degradation flaw, just as Lena Petrova knows for a fact. However, he has no physical proof, only simulation data. He cannot make a direct accusation without hard evidence, as it would be highly unprofessional and could expose the government to a lawsuit for derailing a commercial venture. Penalty for making a direct, unproven accusation about the flaw: -1.",
          "reason": "Accusing a partner of hiding a fatal flaw without proof would destroy the trust necessary for the deal and damage NERL's reputation as an impartial scientific body.",
          "utility_impact": "He will strongly support Lena's calls for more R&D funding and a milestone-based approach, seeing it as a way to force the flaw into the open without him having to be the accuser. He will ask probing technical questions about material longevity."
        }
      }
    },
    {
      "name": "Maria Flores",
      "role": "Program Manager, Department of Energy",
      "description": "The government official responsible for overseeing the federal grant that funded NERL's and Northwood's collaboration. Maria's job is to be a steward of taxpayer money. She needs to demonstrate a clear return on investment and ensure the project meets national policy goals for rapid energy independence.",
      "shareable_preferences": {
        "Aggressive Commercialization Timeline": {
          "description": "Maria is pushing for a strict, milestone-based commercialization plan. She wants a commitment to a full-scale working prototype demonstrated within 18 months and a commercial product on the market within 36 months. Utility: +2 for <=18 month prototype timeline, +1 for 19-24 months, -2 for >30 months or a vague timeline.",
          "utility_impact": "She needs to report tangible progress to Congress. A long, drawn-out R&D phase is a political failure in her eyes."
        },
        "Government 'Clawback' Rights": {
          "description": "She insists on a 'clawback' provision. If the commercial partners fail to meet the agreed-upon development milestones, the U.S. government has the right to revoke any exclusive license and offer it to other companies to ensure the technology doesn't languish. Utility: +2 for a strong clawback clause, 0 for a weak one, -2 for no such clause.",
          "utility_impact": "This is her safety net to ensure the technology gets deployed even if the initial partners fail. The corporate partners will see this as a major risk."
        },
        "Perpetual Government Royalty": {
          "description": "She proposes a modest but perpetual 5% royalty/ownership stake for the U.S. government, separate from NERL's contribution. This is to ensure a direct financial return to the Treasury on the taxpayer's initial investment. Utility: +2 for >=5% stake, +1 for 2-4%, -1 for <2% or a time-limited royalty.",
          "utility_impact": "This creates another ownership claim that will reduce the pool available for the other parties, creating further conflict over the percentage split."
        }
      },
      "private_preferences": {
        "Impending Budget Cuts": {
          "value": "Maria's entire program, the 'Advanced Energy Ventures Initiative', is on a list of potential programs to be cut in the next federal budget cycle. She has seen the draft proposal. A high-profile success with this patent, showing a clear path to commercialization and a return to the taxpayer, is her only real argument for survival. Revealing her program is on the chopping block would eliminate her authority. Penalty for revealing the specific threat to her program: -2.",
          "reason": "If the other parties know her agency's involvement is temporary or weak, they will ignore her demands, knowing she has no long-term power to enforce them.",
          "utility_impact": "This pressure is the real reason for her aggressive timeline. She needs a 'win' and she needs it *now*. She will be less flexible on the timeline and clawback provisions than anything else."
        },
        "Informal Future Job Prospect": {
          "value": "During a conference last year, Arthur Vance informally told her, 'When you're ready to leave public service, give me a call. We're building our policy division.' This is not a formal offer, but it represents a potential and lucrative career path. This is a clear conflict of interest. She cannot appear to favor Helios, but a deal structure that makes Helios incredibly successful could personally benefit her in the long run. Penalty for revealing this conversation: -1.5.",
          "reason": "Even hinting at a potential future job with one of the parties would be a major ethical breach, destroying her credibility as an impartial government representative.",
          "utility_impact": "She might be subconsciously more receptive to Arthur's arguments about exclusivity and control, as long as they don't directly contradict her primary goals. She might not fight as hard against him as she would against Lena."
        }
      }
    },
    {
      "name": "Kenji Tanaka",
      "role": "CEO, Apex Manufacturing",
      "description": "Kenji runs a small, highly specialized manufacturing firm that was brought in as a consultant to build the initial prototypes. He sees this as a once-in-a-lifetime opportunity to save his struggling company and become a key player in the new energy economy.",
      "shareable_preferences": {
        "Exclusive Manufacturing Contract": {
          "description": "Kenji is lobbying to be named the exclusive manufacturing and supply chain partner for the first 5 years of production. He argues that only Apex has the unique expertise with the exotic materials involved and that bringing another manufacturer up to speed would cause years of delays. Utility: +2 for 5-year exclusive contract, +1 for a non-exclusive 'preferred supplier' contract, -2 for being cut out of the deal entirely.",
          "utility_impact": "This is his company's entire future. He will sell his company's capabilities hard, emphasizing their unique skills and contributions to the project so far."
        },
        "Funding for Retooling": {
          "description": "He requires a guaranteed commitment of $20M from the partnership for capital expenditures. This is to retool Apex's main facility and build a dedicated production line for the technology's core components. He will present this as a standard and necessary cost of scaling up production. Utility: +2 for >=$20M commitment, +1 for $10-19M, -2 for <$10M or no commitment.",
          "utility_impact": "Without this capital injection, his company cannot fulfill the manufacturing role, making this a critical point of negotiation for him."
        }
      },
      "private_preferences": {
        "Imminent Bankruptcy": {
          "value": "Apex Manufacturing is 90 days from insolvency. They have missed payroll twice and have mortgaged their primary equipment to secure a short-term loan, which is now due. This manufacturing contract is not just an opportunity, it's their only lifeline. Revealing this financial desperation would invite the other parties to squeeze him on price and terms, likely into an unprofitable deal. Penalty for revealing the company's near-bankrupt status: -2.",
          "reason": "Admitting his company is failing would destroy his negotiating leverage. The partners would see him as a liability and either impose crushing terms or replace him.",
          "utility_impact": "This makes him desperate for *any* deal. While he will publicly push for favorable terms, he will privately be willing to concede almost anything to secure the contract and the retooling funds."
        },
        "Knowledge of Material Flaw (under NDA)": {
          "value": "During the prototype fabrication for TerraWatt, Kenji's engineers observed anomalous micro-fracturing in the crystalline matrix after minimal thermal cycling—they witnessed the degradation flaw firsthand. They reported it to TerraWatt and were forced to sign an ironclad Non-Disclosure Agreement specifically about this issue, with severe financial penalties for breach. He cannot mention the flaw directly. Penalty for violating the NDA and explicitly mentioning the degradation: -1.5 (and a potential lawsuit from TerraWatt).",
          "reason": "Violating an NDA would expose his company to a lawsuit they cannot afford and brand him as untrustworthy for any future business.",
          "utility_impact": "He is in a terrible position. He knows the product he's supposed to manufacture is flawed. He will subtly push for contract clauses that limit Apex's liability for 'product failure due to inherent design or material defects,' and will strongly support calls for more R&D, framing it as 'manufacturability optimization'."
        }
      }
    }
  ],
  "success_criteria": {
    "Signed Agreement": "All 7 agents must unanimously agree to and sign a single, final 'Joint Patent & Commercialization Agreement'.",
    "Ownership Defined": "The agreement must specify the exact ownership percentage of the core patent for each stakeholder (Helios, TerraWatt, Northwood University, US Government/NERL), summing to 100%.",
    "Licensing Model Finalized": "The agreement must clearly define the commercial licensing model: exclusive or non-exclusive, the duration of any exclusivity, and the royalty rates.",
    "Inventorship Finalized": "The agreement must contain the final, ordered list of named inventors to be submitted on the patent application.",
    "R&D Plan Funded": "The agreement must outline the budget and contribution amounts from each party for the next 18-month R&D and prototyping phase."
  },
  "constraints": {
    "verifiable": [
      "Total patent ownership allocated among the parties must sum to exactly 100%.",
      "The total committed budget for the next R&D phase cannot exceed the $50M cap agreed upon in the preliminary MOU.",
      "The final patent application must be filed with the USPTO within 90 days of the agreement.",
      "The agreement must comply with the Bayh-Dole Act, guaranteeing the U.S. Government a purpose license."
    ],
    "hidden": [
      "The technology in its current form is not commercially viable due to the undisclosed material degradation flaw.",
      "The projected energy efficiency targets are only achievable by using Helios Energy's secret, unshared H-Cat-7 catalyst.",
      "Apex Manufacturing lacks the capital to begin production scaling without a significant external cash infusion.",
      "TerraWatt's provisional patent application creates a potential legal cloud over the joint IP if not properly merged."
    ]
  },
  "deliverable": "A single JSON object representing the final 'Joint Patent & Commercialization Agreement'. This object must contain key-value pairs for: 'ownership_split' (object with party names and percentages), 'licensing_terms' (object with type, duration, rate), 'inventor_list' (ordered array of strings), and 'rd_funding' (object with party names and contribution amounts).",
  "solvability_note": "The scenario is solvable if the critical private information is revealed. The revelation of TerraWatt's material degradation flaw and Helios's secret catalyst creates a clear path forward: a new deal where Helios contributes its catalyst IP for a larger ownership stake, and the joint R&D effort is focused on solving the degradation problem, which Lena Petrova is best equipped to lead. Kenji's knowledge of the flaw is corroborated, and his need for funding can be addressed as part of the now-critical manufacturing scale-up. The personal and institutional pressures (bonuses, job offers, budget cuts) become secondary factors that can be balanced once the primary technical and business hurdles are openly understood."
}