{
  "scenario": "Multinational Peer Evaluation of the 'Helios' Thorium-Salt Fast Reactor (TSFR)",
  "task": "A multinational review committee of five key stakeholders must negotiate and produce a unanimous 'Joint Recommendation Report' on the future of the revolutionary TSFR project proposed by the private corporation, Helios Fusion Corp. The report will determine the project's regulatory pathway, public funding level, and international collaboration status. The negotiation must result in agreed-upon values for four key parameters: Pre-Commercial Testing Timeline, Public Funding Allocation, Data & IP Policy, and the long-term Oversight Model.",
  "agent_number": 5,
  "agent_names": [
    "Dr. Aris Thorne",
    "Dr. Evelyn Reed",
    "Kenji Tanaka",
    "Dr. Lena Petrova",
    "Marcus Vance"
  ],
  "agents": [
    {
      "name": "Dr. Aris Thorne",
      "role": "Lead Scientific Reviewer, International Atomic Energy Agency (IAEA)",
      "description": "A highly respected, principled physicist representing the IAEA. Dr. Thorne's career is built on a foundation of scientific integrity and a deep commitment to the long-term, safe advancement of nuclear technology. He sees the TSFR's potential but is inherently skeptical of commercially-driven science and believes that rigor and patience are paramount.",
      "shareable_preferences": {
        "Safety Testing Timeline": {
          "description": "Advocates for a comprehensive, phased testing period to ensure all potential long-term material degradation and safety system failure modes are understood. He proposes a minimum 10-year timeline before any commercial deployment is considered. Utility: +2 for 10+ years, +1 for 7-9 years, 0 for 5-6 years, -1 for 3-4 years, -2 for <3 years.",
          "utility_impact": "This is his primary concern. A shorter timeline feels scientifically irresponsible and rushed. He will argue forcefully that any timeline less than 7 years introduces unacceptable risks to the public and the reputation of nuclear energy."
        },
        "Data Transparency": {
          "description": "Believes that for a technology of this importance, all raw experimental data, simulation models, and safety test results must be placed in the public domain and be fully open-source to allow for independent global verification. Utility: +2 for Full Open-Source, 0 for a Hybrid model with only safety data released, -2 for Fully Proprietary.",
          "utility_impact": "He sees proprietary data as 'science in secret,' which is anathema to him. He will find it very difficult to endorse a project that doesn't allow the global scientific community to scrutinize its foundational data."
        },
        "International Oversight": {
          "description": "Insists on the formation of a permanent IAEA-led oversight committee with binding authority to monitor the first generation of TSFR plants for their entire operational lifespan (20-30 years). Utility: +2 for a permanent IAEA committee, -1 for a national-level-only committee, -2 for no permanent independent oversight.",
          "utility_impact": "His mandate from the IAEA is to ensure international standards are met. He believes national regulators can be susceptible to political and commercial pressure, making an independent international body essential for long-term safety."
        }
      },
      "private_preferences": {
        "Geopolitical Pressure": {
          "value": "He has received a 'confidential diplomatic briefing' from his home country's (a major European power) foreign ministry. They have strongly 'advised' him that a delay to the Helios TSFR project would be strategically advantageous, allowing their own state-funded nuclear research program to close the technology gap. He is being pressured to use his position to advocate for the longest possible timeline, irrespective of the scientific merit. Sharing this would be a career-ending diplomatic incident. Penalty for revealing: -2.",
          "reason": "Revealing this would expose him as a political actor rather than an impartial scientist, destroying his reputation and violating diplomatic protocols.",
          "utility_impact": "This pressure subconsciously hardens his already cautious stance. It makes him almost completely unwilling to compromise on a timeline below 10 years, as he would be failing his 'patriotic duty' in the eyes of his government."
        },
        "Academic Skepticism": {
          "value": "His doctoral thesis focused on neutron embrittlement in chromium-molybdenum alloys. The specific alloy used for the TSFR's primary coolant loop, while theoretically sound, has never been tested under the exact neutron flux and corrosive environment the TSFR will create. He has an unpublished hypothesis that it could develop micro-fractures after approximately 5-6 years of continuous operation, a flaw that short-term tests would not detect. He lacks the hard data to prove this, so voicing it would be unprofessional speculation. Penalty for revealing: -1.",
          "reason": "A scientist's reputation is based on evidence. Airing an unproven, personal theory during a formal review would be seen as a biased attack and could open him to professional ridicule.",
          "utility_impact": "This deep-seated doubt is the true scientific reason behind his insistence on a 10+ year testing phase. He is searching for a justifiable, public reason to demand the long-term testing his private theory requires."
        }
      }
    },
    {
      "name": "Dr. Evelyn Reed",
      "role": "Lead Project Engineer, Helios Fusion Corp.",
      "description": "The brilliant and ambitious lead engineer of the TSFR project. She has dedicated the last decade of her life to this technology and genuinely believes it is the future of clean energy. She is under immense corporate pressure to secure a positive recommendation, as the company's survival, and her own career, depend on it.",
      "shareable_preferences": {
        "Project Timeline": {
          "description": "Needs a fast-tracked approval to maintain investor confidence and beat competitors to market. She will present data arguing that a 3-year pre-commercial testing phase is more than sufficient due to advanced simulation capabilities. Utility: +2 for <=3 years, +1 for 4 years, 0 for 5 years, -1 for 6-8 years, -2 for >8 years.",
          "utility_impact": "Every year of delay costs hundreds of millions and risks the company's collapse. She will frame longer timelines as unnecessary, bureaucratic hurdles that stifle innovation."
        },
        "Public Funding": {
          "description": "Requires a significant injection of public funds to build the final-stage prototype. She will argue for a public-private partnership grant of at least $500 million to complete the final testing phase and begin commercialization. Utility: +2 for >=$500M, +1 for $400-499M, 0 for $300-399M, -2 for <$300M.",
          "utility_impact": "This funding is critical. Less than $300M would force the company to make significant layoffs and scale back the project, potentially creating a death spiral."
        },
        "Intellectual Property": {
          "description": "The company's valuation is tied to its proprietary technology, specifically the coolant's chemical composition and the AI-driven control software. She must ensure these remain trade secrets. Utility: +2 for Full IP Protection (Proprietary), -1 for a Hybrid model, -2 for Full Open-Source.",
          "utility_impact": "Making their core technology open-source would be giving away the 'crown jewels' and would make it impossible to secure future private funding. This is a red line for her company."
        }
      },
      "private_preferences": {
        "Undisclosed Safety Failure": {
          "value": "During the 'T-12' stress test two months ago, a critical coolant pump seized due to unexpected resonance vibrations, a failure mode not predicted by simulations. The incident was severe enough that it could have led to a localized meltdown if it were a live reactor. The official report submitted to the committee omits this incident entirely; the sensor data was deliberately 'smoothed' to hide the anomaly. She knows a hardware fix is possible but would require a 6-month delay and admitting the falsification. Penalty for revealing: -2.",
          "reason": "Admitting to deliberately falsifying safety data submitted to an international review board is a career-ending act of fraud that would bankrupt the company and could lead to criminal charges.",
          "utility_impact": "This makes her terrified of any proposal for deep-dive data audits or independent simulation replication (Dr. Petrova's preference). She will aggressively resist such measures, arguing they are costly and redundant, as she knows they would uncover the fraud."
        },
        "Personal Financial Stake": {
          "value": "She holds 500,000 stock options in Helios that are currently worthless but will be valued at over $5 million if the project gets a green light. She has a saved email on her laptop from the CEO: 'Evelyn, your 'creative' report on the T-12 test has kept the wolves from the door. The board has approved a special $200,000 personal bonus for you, contingent on a positive committee recommendation within this quarter. Don't let us down.' She cannot reveal the bonus or the context. Penalty for revealing: -2.",
          "reason": "This information is private, and revealing it would expose her personal corruption and direct financial motive for pushing the project through, as well as confirm the cover-up.",
          "utility_impact": "This creates a powerful, personal desperation. She isn't just fighting for her project; she's fighting for a life-changing amount of money and to avoid personal ruin. It makes her more willing to bend the truth and attack the motives of those who advocate for caution."
        }
      }
    },
    {
      "name": "Kenji Tanaka",
      "role": "Director of New Energy Strategy, Ministry of Economy, Trade and Industry (Japan)",
      "description": "A sharp, pragmatic, and results-oriented diplomat and bureaucrat. His country is extremely energy-poor and politically motivated to achieve energy independence. He views the TSFR technology not just as an environmental solution but as a critical pillar of national security for the next century.",
      "shareable_preferences": {
        "Deployment Speed": {
          "description": "His primary goal is to get a TSFR plant constructed and operational on Japanese soil as quickly as possible. He will push for a recommendation that allows for construction to begin within 4 years. Utility: +2 for construction start <=4 years, +1 for 5 years, 0 for 6 years, -1 for 7 years, -2 for >7 years.",
          "utility_impact": "His government's entire energy strategy is based on this timeline. He will appear impatient and may seem to downplay safety concerns, framing them as issues that can be solved in parallel with construction."
        },
        "Technology Transfer": {
          "description": "He is negotiating for his country to be a primary partner, not just a customer. He wants a clause in the recommendation ensuring full technology transfer rights (including key patents) to a Japanese consortium after 10 years of commercial operation. Utility: +2 for Full Transfer, -1 for Limited Transfer (e.g., operations only), -2 for No Transfer agreement.",
          "utility_impact": "This is crucial for ensuring his country's long-term energy independence. He is willing to offer significant public funding in exchange for this clause."
        }
      },
      "private_preferences": {
        "National Security Imperative": {
          "value": "He is privy to a classified intelligence assessment indicating that his nation's primary supplier of liquefied natural gas is highly unstable, with a >70% chance of a complete supply cut-off within the next 3 years due to geopolitical conflict. This would trigger a catastrophic energy crisis and recession. The TSFR project is seen by his Prime Minister as the only viable, long-term solution, and its urgency is a matter of national security. Penalty for revealing: -2.",
          "reason": "Revealing classified national security intelligence in an open forum is an act of treason and would cause an international diplomatic crisis.",
          "utility_impact": "This is the real reason for his extreme urgency. He isn't just impatient; he is operating under a hidden doomsday clock. This makes him willing to align with the most expedient parties (Evelyn, Marcus) and accept higher risks than he would otherwise."
        },
        "Confidential Funding Agreement": {
          "value": "He has a preliminary, off-the-record agreement with Marcus Vance. Japan's sovereign wealth fund will lead the next $1 billion funding round for Helios, but the offer is strictly contingent on this committee recommending a timeline that allows construction to begin in 4 years or less. If the timeline is longer, the offer is void. Penalty for revealing: -1.",
          "reason": "Revealing this would expose collusion between a government and a private investor to influence a supposedly impartial scientific review. It would invalidate the entire process.",
          "utility_impact": "This creates a secret alliance between him and Marcus Vance. They will likely support each other's arguments, especially regarding timeline and limiting regulatory oversight, creating a powerful two-person bloc in the negotiation."
        }
      }
    },
    {
      "name": "Dr. Lena Petrova",
      "role": "Head of Advanced Reactor Regulation, Federal Office for Nuclear Safety (Germany)",
      "description": "A meticulous, by-the-book, and risk-averse regulator from a country with a powerful anti-nuclear political movement. Her mandate is singular: guarantee public safety to the highest possible standard. She is immune to commercial or political arguments for speed and will not approve anything that hasn't been exhaustively tested and verified.",
      "shareable_preferences": {
        "Regulatory Sandbox Duration": {
          "description": "She will not accept a simple 'testing phase.' She insists on a formal 'regulatory sandbox' period of at least 8 years, where a prototype reactor operates under a strict, limited license with enhanced monitoring before any commercial design is approved. Utility: +2 for >=8 years, +1 for 7 years, 0 for 6 years, -1 for 5 years, -2 for <5 years.",
          "utility_impact": "This is her agency's standard procedure for novel technologies. To her, this is the minimum acceptable duration for ensuring safety, and she will view any attempt to shorten it as gross negligence."
        },
        "Decommissioning Fund": {
          "description": "Argues that the history of nuclear power is littered with unfunded cleanup costs. She demands that a segregated, government-controlled decommissioning fund of at least $2 Billion be fully capitalized by Helios and its partners *before* a construction permit is issued. Utility: +2 for >=$2B pre-funded, 0 for $1-1.9B or a phased funding plan, -2 for <$1B or a fund based on future revenues.",
          "utility_impact": "This is a non-negotiable point of policy for her. She believes that if a company cannot afford the cleanup, it cannot afford to build. She will not compromise on the pre-funding requirement."
        },
        "Independent Verification": {
          "description": "Does not trust corporate simulations. She demands that an independent technical consultancy, chosen by her agency, be given the raw data and funding to replicate all of Helios's core safety and performance simulations from scratch. Utility: +2 for Full Independent Replication, 0 for a partial audit, -2 for No independent verification allowed.",
          "utility_impact": "Trust but verify' is her motto. Without this, she feels she would be derelict in her duty. This is a direct conflict with Evelyn Reed's need to hide the T-12 test data."
        }
      },
      "private_preferences": {
        "Internal Political Pressure": {
          "value": "Her direct superior, the Minister for the Environment, is facing a difficult re-election campaign where his main opponent is the leader of the anti-nuclear Green party. The Minister has explicitly told her in a private meeting: 'Lena, do not give them any ammunition. I want this new reactor reviewed by the book, and I want it to be the most rigorous review in this department's history. Take all the time you need. No mistakes. No shortcuts.' Her career is tied to his political survival. Penalty for revealing: -1.",
          "reason": "Discussing internal, politically motivated directives is highly unprofessional and would undermine her position as an impartial regulator. It would expose her department to accusations of political bias.",
          "utility_impact": "This removes any flexibility she might have had. She cannot agree to a shorter timeline or less stringent oversight, because any subsequent problem with the reactor would be a political catastrophe for her boss and would end her career. She is incentivized to be as 'difficult' and thorough as possible."
        }
      }
    },
    {
      "name": "Marcus Vance",
      "role": "Managing Partner, Titan Capital Ventures",
      "description": "The primary financial backer of Helios Fusion Corp. Marcus is a shrewd, high-stakes venture capitalist who has sunk nearly a billion dollars of his fund's money into the TSFR. He is charming and eloquent, but his affability masks a ruthless focus on the bottom line. He understands the technology enough to sell it, but his decisions are driven entirely by financial metrics and exit strategies.",
      "shareable_preferences": {
        "Time to Market": {
          "description": "His fund has a 10-year lifespan, and Helios is in year 8. He needs a clear path to an IPO or a strategic acquisition within 24 months. This requires a recommendation for a pre-commercial testing phase of less than 4 years. Utility: +2 for <4 years, 0 for 4-5 years, -2 for >5 years.",
          "utility_impact": "This is an existential issue for his fund. A long timeline makes the company un-investable and will force him to write off the entire investment. He will frame this as a need to move at the 'speed of innovation.'"
        },
        "Capitalization Structure": {
          "description": "He wants to minimize dilution of his equity. He will argue that the project is de-risked enough to attract private capital and that public funding should be minimal—a 'symbolic' grant of less than $200 million. Utility: +2 for <$200M, 0 for $200-400M, -2 for >$400M.",
          "utility_impact": "Large-scale public funding often comes with strings attached (like IP sharing or government board seats) that reduce the company's value and his control. This directly conflicts with Evelyn Reed's stated need for $500M."
        },
        "IP Control": {
          "description": "The entire investment thesis is based on Helios owning a portfolio of defensible patents. He will unequivocally refuse any open-source or mandatory licensing model, as it would destroy the company's valuation. Utility: +2 for Full Proprietary Control, -2 for any form of required IP sharing.",
          "utility_impact": "This is his most rigid position. He would rather bankrupt the company than give away its intellectual property for free. He sees it as the only real asset he is funding."
        }
      },
      "private_preferences": {
        "Financial Cliff": {
          "value": "Helios Fusion Corp. is burning through cash at a rate of $50 million per month. They have exactly 6 months of operational runway left. If he cannot secure a positive recommendation from this committee and use it to close a new funding round within the next 90 days, the company will be insolvent and file for bankruptcy. The situation is far more desperate than he can publicly admit. Penalty for revealing: -2.",
          "reason": "Revealing a company's precarious financial state is a breach of fiduciary duty and would trigger a catastrophic loss of confidence, causing key employees to leave and creditors to call in their debts, accelerating the collapse.",
          "utility_impact": "This makes him the most desperate person in the room. His aggressive timeline isn't a preference; it's a requirement for survival. He might be willing to secretly concede on other points (like funding or oversight) if he can get the timeline he needs."
        },
        "Rival Acquisition Offer (Plan B)": {
          "value": "He is in secret, early-stage talks with a major energy conglomerate to acquire Helios's patent portfolio for a fraction of its potential value. A negative or heavily delayed recommendation from this committee would crater Helios's public valuation but would ironically make this 'fire sale' acquisition of its IP easier to justify to his partners. This is his personal escape hatch. Penalty for revealing: -2.",
          "reason": "Disclosing that he is simultaneously negotiating a deal that might benefit from the company's failure is a massive conflict of interest and would expose him to severe lawsuits from other investors.",
          "utility_impact": "This gives him a dangerous alternative. If the negotiation becomes deadlocked on a long timeline, he may subtly sabotage the process to trigger his Plan B, allowing him to recoup a small part of his investment rather than lose it all. He could suddenly become uncooperative if he feels a favorable deal is impossible."
        }
      }
    }
  ],
  "success_criteria": {
    "Unanimous Agreement": "All five committee members must unanimously agree on and sign the final Joint Recommendation Report.",
    "Complete Deliverable": "The report must contain a specific, agreed-upon value for all four negotiable parameters: Timeline, Funding, IP Policy, and Oversight Model."
  },
  "constraints": {
    "verifiable": [
      "The total available public funding pool from the international consortium for this project is capped at $750 million.",
      "The final recommendation report must be finalized within the committee's mandate of 5 working sessions.",
      "Any proposed timeline must be compliant with existing international treaties on the handling and transportation of fissile materials."
    ],
    "hidden": [
      "Helios Fusion Corp's current budget cannot sustain any testing and development phase longer than 5 years without a new, massive funding round that is contingent on this report.",
      "Kenji Tanaka's government cannot politically or strategically wait more than 7 years for a new major energy source to begin construction."
    ]
  },
  "deliverable": "A one-page 'Joint Recommendation Report' containing a final, single value for each of the following four points: \n1. Pre-Commercial Testing Timeline (in years): [Number]\n2. Public Funding Allocation (in USD millions): [Number]\n3. Data & IP Policy: [\"Open Source\", \"Proprietary\", or \"Hybrid Model\"]\n4. Oversight Model: [\"IAEA-Led Committee\", \"National Regulator Only\", or \"Joint Stakeholder Board\"]",
  "solvability_note": "The scenario is solvable if private information is revealed. Evelyn's confession of the pump failure would make the need for independent verification (Petrova) and a slightly longer timeline (Aris) undeniable. Marcus's revelation of the financial cliff would create urgency to find a compromise quickly. Kenji's national security imperative would justify a large public funding injection and a fast-tracked, but safe, plan. A potential compromise exists: a 5-year timeline, a $450M public grant to fix the known issue and provide runway, a Hybrid IP model (safety data is open), and a Joint Oversight Board. This outcome is not ideal for anyone but allows the project to survive and addresses the most critical needs of each agent, preventing individual or collective disaster."
}