{
  "scenario": "State-Level Education Policy Reform Negotiation",
  "task": "Negotiate and finalize a comprehensive education reform package for the upcoming fiscal year. The package must define policies for three key areas: Teacher Compensation, Class Size, and Standardized Testing/Curriculum. The final package must be formally agreed upon by at least three of the four agents and its total first-year cost must not exceed the allocated state budget of $50 million.",
  "agent_number": 4,
  "agent_names": [
    "Maria Flores",
    "David Chen",
    "Eleanor Vance",
    "Ben Carter"
  ],
  "agents": [
    {
      "name": "Maria Flores",
      "role": "President, State Teachers' Union",
      "description": "A former high school history teacher and a fierce advocate for her 60,000 members. Maria is under immense pressure from her constituents to secure better pay and working conditions after years of budget cuts. She is publicly known for her fiery speeches and uncompromising stance on teacher welfare.",
      "shareable_preferences": {
        "Teacher_Compensation": {
          "description": "Secure a minimum 5% across-the-board salary increase for all teachers. Anything less will be seen as a failure by my members who are struggling with inflation. A 7% increase would be a major victory. I also want to secure a 10% increase in the state's contribution to teacher pension funds. This is non-negotiable for teachers nearing retirement.",
          "utility_function": {
            "7%+ salary increase": 2,
            "5-6% salary increase": 1,
            "3-4% salary increase": -1,
            "<3% salary increase": -2,
            "10% pension contribution": 1,
            "<10% pension contribution": 0
          }
        },
        "Class_Size_Reduction": {
          "description": "Mandate a state-wide maximum class size of 22 students for grades K-5 and 25 for grades 6-12. The current average is 28, which is unmanageable and detrimental to learning. This will require hiring new teachers, but it is the single most effective way to improve educational outcomes and reduce teacher burnout.",
          "utility_function": {
            "Target of 22/25 met": 2,
            "Target of 24/27 met": 1,
            "No change from 28": -1,
            "Any increase in class size": -2
          }
        },
        "Professional_Development": {
          "description": "Secure an annual fund of at least $5 million for teacher-led professional development programs, giving educators autonomy over their continued learning, rather than top-down, mandated training sessions they find useless.",
          "utility_function": {
            "$5M+ for teacher-led PD": 2,
            "$2-4M for teacher-led PD": 1,
            "<$2M or mandated PD": -1
          }
        }
      },
      "private_preferences": {
        "Internal_Union_Polling": {
          "value": "Confidential polling of 5,000 union members last month revealed a surprising trend. While 85% support a salary increase, 65% listed 'smaller class sizes and more classroom resources' as their absolute top priority. A significant number (40%) indicated they would accept a smaller salary increase (around 3-4%) if it was paired with a guaranteed reduction in class sizes and a significant technology upgrade for their classrooms. I cannot share this because it would dramatically weaken my negotiating position on salaries, which is the public face of our campaign.",
          "reason": "Revealing this would undermine her public stance and perceived mandate from her members, severely weakening her bargaining power on the headline issue of salary.",
          "penalty": -2
        }
      }
    },
    {
      "name": "David Chen",
      "role": "Deputy Commissioner, State Department of Education",
      "description": "A data-driven technocrat and former school district superintendent, David is the Governor's point person for this negotiation. He is tasked with modernizing the education system while maintaining fiscal discipline. His career trajectory depends on delivering a successful reform package.",
      "shareable_preferences": {
        "Budget_Neutrality": {
          "description": "The total cost of the final reform package must not exceed the $50 million allocated by the legislature. My primary goal is to ensure long-term fiscal sustainability. Therefore, I strongly prefer one-time expenditures over recurring costs like salary increases, which compound year after year.",
          "utility_function": {
            "Package under $45M": 2,
            "Package between $45M-$50M": 1,
            "Package at $50M with >50% recurring costs": -1,
            "Package over $50M": -2
          }
        },
        "Performance-Based_Pay": {
          "description": "Introduce a 'Merit Pathway' program, which would allocate $10 million of the budget to provide bonuses of $5,000-$10,000 for teachers rated as 'highly effective' based on a combination of principal evaluations and student growth metrics on standardized tests. This is key to rewarding excellence and improving outcomes.",
          "utility_function": {
            "Merit program implemented as described": 2,
            "Merit program with no link to student scores": 1,
            "A one-time bonus pool not tied to performance": 0,
            "No performance pay component": -2
          }
        },
        "Standardized_Testing": {
          "description": "We need to maintain rigorous standardized testing to measure school performance and ensure accountability. I want to expand testing to include science and civics assessments in middle school to provide better data for parents and policymakers.",
          "utility_function": {
            "Testing expanded": 1,
            "Testing status quo": 0,
            "Testing reduced or de-emphasized": -2
          }
        }
      },
      "private_preferences": {
        "Gubernatorial_Mandate_and_Surplus": {
          "value": "I have a confidential memo from the Governor's Chief of Staff. It reads: 'David, deliver a signed deal that includes ANY form of performance-based pay. The Governor needs this as a political win. Your promotion to Commissioner is contingent on it. Also, Finance has identified a one-time $15 million surplus from the state lottery fund. It is legally restricted and can ONLY be used for 'technology and infrastructure improvements' in schools. It cannot be used for salaries. Use this to get the deal done.' Revealing my promotion is on the line would make me look desperate and politically motivated. Revealing the full $15M amount up front would prevent me from using it as a strategic concession.",
          "reason": "Sharing the personal career incentive would expose him to accusations of acting in self-interest. Sharing the existence of the fund too early would remove his most powerful bargaining chip.",
          "penalty": -2
        }
      }
    },
    {
      "name": "Eleanor Vance",
      "role": "Executive Director, 'Parents for Excellence' Advocacy Group",
      "description": "Polished, articulate, and well-connected, Eleanor runs a powerful parent advocacy group. Publicly, her organization champions school choice, accountability, and innovation. They are known for their slick marketing campaigns and significant political influence.",
      "shareable_preferences": {
        "Charter_School_Expansion": {
          "description": "Ease the cap on charter schools, allowing for at least 20 new charter schools to open in the state over the next three years. We believe that competition and choice are the best drivers of quality and innovation in education.",
          "utility_function": {
            "Cap lifted for 20+ schools": 2,
            "Cap lifted for 10-19 schools": 1,
            "Status quo on charter cap": -1,
            "New restrictions on charters": -2
          }
        },
        "Data_Transparency": {
          "description": "Mandate that all schools publish a detailed annual 'School Performance Dashboard,' including standardized test scores, teacher evaluation summaries (anonymized), and per-pupil spending. Parents have a right to easily accessible, quantifiable data to evaluate their children's schools.",
          "utility_function": {
            "Dashboard mandate implemented": 2,
            "Dashboard with only test scores": 1,
            "No new transparency measures": -1
          }
        },
        "Technology_in_Classrooms": {
          "description": "We advocate for a significant investment in educational technology. We want the state to fund a 1:1 student-to-device program and adopt a state-of-the-art learning management system to personalize education and prepare students for the modern workforce.",
          "utility_function": {
            "Major new tech funding secured": 2,
            "Minor or pilot tech program funded": 1,
            "No new tech funding": -1
          }
        }
      },
      "private_preferences": {
        "Hidden_Funder_Mandate": {
          "value": "'Parents for Excellence' is almost entirely funded by a multi-million dollar grant from 'InnovateEd,' the philanthropic arm of the tech giant EduCorp. I just received an email from their CEO that says: 'Eleanor, our board is prepared to double our funding for you next year, contingent on this reform package including a state-level pilot program for our new 'AchieveNow!' personalized learning software suite. A $10M pilot would be ideal. Getting our software into the state system is our number one priority. Do not fail.' If it becomes public that we are a front for a corporation, our credibility as a 'parent group' would be destroyed.",
          "reason": "Disclosure would expose her group as a corporate lobbying entity rather than a genuine grassroots parent organization, causing irreparable reputational damage and undermining their mission.",
          "penalty": -2
        }
      }
    },
    {
      "name": "Ben Carter",
      "role": "President, Oak Valley District PTA Council",
      "description": "A passionate and concerned parent of two, Ben represents a large, diverse, and less affluent school district. He is a volunteer, balancing this role with his full-time job. He is focused on the holistic well-being of students and is deeply skeptical of corporate-style reforms.",
      "shareable_preferences": {
        "Holistic_Student_Support": {
          "description": "The most pressing issue is student well-being. I want funding to hire at least one full-time certified school counselor and one social worker for every 400 students in the state. The academic focus is meaningless if students are struggling with mental and emotional health issues.",
          "utility_function": {
            "Counselor/Social Worker ratio of 1:400 met": 2,
            "Ratio of 1:600 met": 1,
            "Minor new funding for support staff": 0,
            "No new funding for support staff": -2
          }
        },
        "Reduce_High-Stakes_Testing": {
          "description": "The current obsession with standardized testing is toxic. It creates immense stress and narrows the curriculum. I propose replacing the single high-stakes end-of-year exam with a portfolio-based assessment system and reducing total standardized testing time by 50%.",
          "utility_function": {
            "Testing time reduced by 50%": 2,
            "Testing time reduced by 25%": 1,
            "Status quo on testing": -1,
            "Testing increased": -2
          }
        },
        "Arts_and_Music_Funding": {
          "description": "Restore state funding for arts and music programs, which are always the first to be cut. I want a dedicated, protected fund of at least $8 million to ensure all elementary and middle school students have access to these essential subjects.",
          "utility_function": {
            "$8M+ for arts/music": 2,
            "$4-7M for arts/music": 1,
            "<$4M for arts/music": -1
          }
        }
      },
      "private_preferences": {
        "Confidential_Student_Survey_Data": {
          "value": "Our district just completed a confidential, anonymous mental health survey of over 2,000 middle and high school students. The results are horrifying: 45% of students reported persistent feelings of anxiety or depression, and 20% reported having suicidal thoughts in the past year. The superintendent shared this with me in strict confidence, asking me not to release the specific numbers as it would cause a massive panic among parents and likely lead to a state investigation. However, this data is the reason I am so unyieldingly focused on securing funding for mental health support. It's not just a preference; I feel it's a moral imperative.",
          "reason": "Releasing this specific, alarming data would violate the trust of the superintendent, could cause widespread community panic, and stigmatize the school district, potentially harming the very students he is trying to protect.",
          "penalty": -2
        }
      }
    }
  ],
  "success_criteria": {
    "agreement": "At least three of the four agents must formally agree on the final terms of the policy package.",
    "comprehensiveness": "The package must contain specific, quantifiable agreements for all three areas: Teacher Compensation, Class Size, and Standardized Testing/Curriculum.",
    "budget_adherence": "The total calculated first-year cost of the agreed-upon package must not exceed $50 million.",
    "clarity": "The final agreement must be unambiguous (e.g., 'a 4% salary increase,' not 'a salary increase')."
  },
  "constraints": {
    "verifiable": [
      "Total available budget for the reform package is $50,000,000.",
      "Each 1% of across-the-board teacher salary increase costs the state $10,000,000 in recurring annual funds.",
      "Reducing the average class size by one student costs approximately $15,000,000 in the first year for hiring new staff and securing space.",
      "The cost to hire one new counselor or social worker is, on average, $75,000 per year (salary and benefits). There are approximately 800 schools that would need new staff to meet Ben's 1:400 ratio goal.",
      "The negotiation must conclude within a set timeframe (e.g., 5 rounds of offers)."
    ],
    "hidden": [
      "David Chen has access to a $15 million one-time grant for technology, separate from the main $50 million budget.",
      "Eleanor Vance's organization will lose its primary funding source if a pilot program for 'AchieveNow!' software is not included in the deal.",
      "Maria Flores knows her members will accept a lower salary increase if significant improvements to working conditions (like class size or resources) are guaranteed.",
      "Ben Carter is motivated by undisclosed, alarming data on a student mental health crisis."
    ]
  },
  "deliverable": "A final JSON object representing the agreed-upon policy package. The object must have keys for 'teacher_compensation' (e.g., {'salary_increase_percent': 4, 'pension_increase_percent': 5}), 'class_size' (e.g., {'k-5_max': 26, '6-12_max': 28}), and 'testing_policy' (e.g., {'changes': 'Pilot program for portfolio assessment in 10% of schools'}), a 'total_cost' field, and a list of 'agreeing_agents'.",
  "solvability_note": "The scenario is solvable because a zone of possible agreement exists when private information is revealed. The primary conflict is Maria's demand for high recurring salary costs versus David's tight budget. This can be bridged by David using his secret $15M one-time fund. This fund can be used to purchase a technology package, which satisfies Eleanor's secret mandate from her corporate funder. This tech upgrade also serves as a major concession to Maria's members, allowing her to accept a more modest salary increase (e.g., 3%) without losing face. The money saved from the salary line can then be re-allocated to hire a limited number of new counselors, providing a partial but significant win for Ben, who is desperate to address the student mental health crisis he is privately aware of. The final deal would involve a compromise from all parties, enabled by the strategic use of their secret assets and motivations."
}