{
  "scenario": "New Research Wing Space Allocation at Northwood University",
  "task": "A new, state-of-the-art 6,000 sq ft research wing has been built, but demand has outstripped supply. Six key stakeholders must negotiate to produce a mutually agreeable allocation plan for the four available lab suites. The plan must detail which team gets which suite, how the shared resources are managed, and how the limited renovation budget is spent. The final proposal must be signed by all parties and submitted to the University Provost for final approval.",
  "agent_number": 6,
  "agent_names": [
    "Dr. Aris Thorne",
    "Dr. Lena Petrova",
    "Dr. Kenji Tanaka",
    "Dr. Imani Adebayo",
    "Marcus Cole",
    "Dr. Evelyn Reed"
  ],
  "agents": [
    {
      "name": "Dr. Aris Thorne",
      "role": "Principal Investigator, Center for Cognitive Neuroscience",
      "description": "A highly distinguished, senior professor and a Nobel laureate candidate. His work on neural mapping using sensitive imaging equipment is world-renowned and brings immense prestige to the university. He is methodical, accustomed to getting what he needs, and sees his research as paramount.",
      "shareable_preferences": {
        "lab_environment": {
          "description": "Requires a laboratory environment with minimal vibration and electromagnetic interference. The ideal location would be a corner suite on an upper floor, away from elevators, HVAC units, and high-traffic hallways. This is critical for the nanometer-level precision of his new custom-built fMRI and electrophysiology rigs. He states he needs at least 1,500 sq ft to house the equipment and his research team of 8 people.",
          "utility_function": {
            "get_suite_A_2000sqft": "+2",
            "get_suite_C_1500sqft_ground_floor": "+1",
            "get_suite_B_1500sqft_central": "-1",
            "get_any_suite_with_extra_soundproofing_budget": "+1",
            "get_a_suite_smaller_than_1500sqft": "-2"
          }
        },
        "setup_timeline": {
          "description": "Prefers a gradual move-in over the next 4-6 months. This allows for careful calibration of his delicate instruments without rushing. He is not in a particular hurry as his current lab is still functional, albeit outdated.",
          "utility_function": {
            "move_in_within_4-6_months": "+1",
            "forced_to_move_in_within_2_months": "-1",
            "move_in_immediately": "-2"
          }
        }
      },
      "private_preferences": {
        "rival_offer": {
          "value": "Dr. Thorne has received a very attractive offer from a rival top-tier university that includes a custom-built lab facility, exactly to his specifications, and a significant salary increase. He is 80% likely to accept it if his needs are not met here. He can hint that he has 'other options' but cannot reveal the specifics of the offer, as it would be a breach of confidence and make him look disloyal, potentially souring his relationship with the Dean even if he stays. Sharing that he has an offer: -1 penalty. Sharing the institution or specific terms: -2 penalty.",
          "reason": "Revealing the offer is a high-risk negotiation tactic that could backfire, damaging his reputation and relationships at his current institution.",
          "utility_impact": "This makes him less willing to compromise on his 'ideal' lab space. For him, this isn't just about a new lab; it's about whether the university truly values his prestigious research enough to keep him."
        },
        "breakthrough_imminence": {
          "value": "His team is on the verge of a major breakthrough in mapping Alzheimer's-related neural degradation. The new equipment is key to the final, career-defining experiments. A six-month delay caused by a sub-optimal lab environment could allow a competing lab in Germany to publish first. He can talk about the importance of his work, but cannot reveal how close he is, as it would create immense pressure and potential for information leaks. Sharing the competitive timeline: -2 penalty.",
          "reason": "Secrecy is paramount in highly competitive research fields to avoid being 'scooped'.",
          "utility_impact": "This privately reinforces his public demand for a perfect, no-compromise lab environment. He believes the stakes are too high to accept anything less."
        }
      }
    },
    {
      "name": "Dr. Lena Petrova",
      "role": "Principal Investigator, Genomics & Bioinformatics",
      "description": "A brilliant and ambitious early-career scientist who recently secured a massive, high-profile grant. Her research on rapid gene sequencing has the potential for major commercial patents. She is energetic, data-driven, and under immense pressure to deliver results quickly.",
      "shareable_preferences": {
        "space_and_power": {
          "description": "Requires a large, open-plan space of at least 1,800 sq ft to accommodate her three new high-throughput sequencers, which are currently in storage. The lab must have robust electrical infrastructure, specifically multiple 3-phase 208V outlets and a high-capacity cooling system, as the machines generate significant heat.",
          "utility_function": {
            "get_suite_A_2000sqft": "+2",
            "get_suite_B_or_C_1500sqft": "-1",
            "get_any_suite_with_upgraded_power_and_hvac": "+1",
            "get_a_suite_less_than_1800sqft": "-2"
          }
        },
        "immediate_occupancy": {
          "description": "Insists on needing access to the lab space immediately. She states her research has a 'tight schedule' and any delays will jeopardize her project's momentum and milestones. Her team needs to start setting up the sequencers within the next two weeks.",
          "utility_function": {
            "move_in_within_2_weeks": "+2",
            "move_in_within_1_month": "0",
            "move_in_after_2_months": "-2"
          }
        }
      },
      "private_preferences": {
        "grant_forfeiture_clause": {
          "value": "Her $5 million grant from the prestigious 'Helios Foundation' has a strict 'Operational Start' clause. If her lab is not fully operational and processing samples within 3 months from now (she has already used up 3 months on procurement), she forfeits the entire first year's funding of $1.5 million. She recently received a 'courtesy reminder' email from the foundation's program officer. She can say the grant is 'time-sensitive' but cannot reveal the forfeiture clause or the amount. Sharing this would cause panic, make her look like a poor planner to the Dean, and give other agents extreme leverage over her. Sharing the clause details: -3 penalty.",
          "reason": "Admission of such a critical vulnerability would severely damage her professional reputation and negotiating position.",
          "utility_impact": "This is the true source of her desperation for immediate occupancy and a large, easy-to-setup space. She will be extremely aggressive in negotiations and may seem unreasonable without this context."
        }
      }
    },
    {
      "name": "Dr. Kenji Tanaka",
      "role": "Principal Investigator, Advanced Materials & Nanotechnology",
      "description": "A meticulous and safety-conscious researcher working with volatile solvents and custom-built high-pressure synthesis reactors. His work is foundational but less flashy than Thorne's or Petrova's. He is quiet, firm, and prioritizes the safety of his team above all else.",
      "shareable_preferences": {
        "safety_infrastructure": {
          "description": "Non-negotiable requirement for a ground-floor laboratory for two reasons: 1) The weight of his shielded reactor exceeds the floor load capacity of the upper levels. 2) University safety protocols mandate that labs using large quantities of explosive precursor chemicals must have direct ground-level emergency access. The lab must be outfitted with two chemical fume hoods and a specialized ventilation system capable of 12 air changes per hour.",
          "utility_function": {
            "get_suite_C_1500sqft_ground_floor": "+2",
            "not_getting_a_ground_floor_suite": "-10 (deal-breaker)"
          }
        },
        "renovation_budget": {
          "description": "The required ventilation system and blast-shielding for his reactor room are expensive. He has a quote for $120,000 for the necessary upgrades. He argues this should be the first priority for the shared renovation budget.",
          "utility_function": {
            "get_full_120k_renovation_budget": "+2",
            "get_80k-119k_budget": "+1",
            "get_less_than_80k_budget": "-2"
          }
        }
      },
      "private_preferences": {
        "prior_incident": {
          "value": "Two years ago, a minor chemical fire occurred in his old lab due to an unforeseen ventilation failure. While no one was seriously injured, it resulted in a stressful internal investigation that confidentially faulted the university's aging infrastructure. He can mention his focus on 'best practices' but cannot bring up the specific incident, as it would violate the confidential settlement agreement he signed with the university and embarrass the administration (specifically Marcus Cole). Sharing details of the incident: -3 penalty.",
          "reason": "Violating a confidential agreement and blaming the university openly would be career suicide.",
          "utility_impact": "This past trauma makes him completely inflexible on his safety demands. He will not bend on the ground floor or ventilation budget, as he secretly believes the university owes it to him and his team."
        }
      }
    },
    {
      "name": "Dr. Imani Adebayo",
      "role": "Principal Investigator, Computational Biology & Systems Modeling",
      "description": "A sharp, efficient scientist whose research is entirely digital. Her team writes code and analyzes massive datasets, collaborating with experimental labs. She needs a smaller physical footprint but has critical, non-obvious infrastructure requirements.",
      "shareable_preferences": {
        "network_connectivity": {
          "description": "Her team's primary need is not space, but data. They require a lab with direct 10-gigabit fiber optic connections to the university's supercomputing cluster, which are only pre-wired into Suite D. Running this fiber to any other suite would be prohibitively expensive and time-consuming (estimated 6-month delay and $80k cost). She needs space for 6 researchers and a small server rack.",
          "utility_function": {
            "get_suite_D_1000sqft": "+2",
            "not_getting_suite_D": "-10 (deal-breaker)"
          }
        },
        "collaborative_space": {
          "description": "Wants to establish a 'collaboration zone' or shared space adjacent to her lab for meeting with experimentalist partners like Dr. Petrova's team. This would foster synergy and accelerate research.",
          "utility_function": {
            "get_dedicated_shared_meeting_room": "+1",
            "no_shared_space": "0"
          }
        }
      },
      "private_preferences": {
        "cloud_computing_grant": {
          "value": "Dr. Adebayo has a pending $500k grant proposal for cloud computing resources. A key component of the proposal is the lab's dedicated high-speed connection to the campus cluster for hybrid cloud-local processing. Securing Suite D is a lynchpin for this grant. If she fails to get it, the grant is likely to be rejected. She can't share this because the grant is still under review, and admitting its success depends on an internal resource allocation would weaken her position in the review process. Sharing the grant dependency: -2 penalty.",
          "reason": "Discussing un-awarded grants and their dependencies is considered poor form and can create perceptions of weakness in a proposal.",
          "utility_impact": "This makes her demand for Suite D as inflexible as Tanaka's demand for the ground floor, something others might not appreciate since her physical space needs are the smallest."
        }
      }
    },
    {
      "name": "Marcus Cole",
      "role": "Director of Facilities and Operations",
      "description": "A pragmatic, budget-focused administrator. He is not a scientist. His job is to manage university infrastructure, ensure safety compliance, and keep projects on time and on budget. He sees the new wing as a line item and wants the most efficient, cost-effective allocation possible.",
      "shareable_preferences": {
        "budget_adherence": {
          "description": "The total renovation budget for the entire 6,000 sq ft wing is a firm $250,000. This must cover all customization, including ventilation, power upgrades, and any structural changes. He will strongly resist any plan that exceeds this amount and will favor solutions that require the least modification.",
          "utility_function": {
            "plan_under_250k_budget": "+2",
            "plan_at_exactly_250k_budget": "+1",
            "plan_over_budget": "-2"
          }
        },
        "maintenance_efficiency": {
          "description": "Wants to avoid creating unique, hard-to-maintain lab setups. He prefers to keep labs with similar high-drain utilities (power, HVAC) grouped together. For instance, placing Dr. Petrova's and Dr. Tanaka's high-demand labs far apart would require redundant, expensive infrastructure runs.",
          "utility_function": {
            "efficient_grouping_of_utilities": "+1",
            "inefficient_sprawling_layout": "-1"
          }
        }
      },
      "private_preferences": {
        "performance_bonus": {
          "value": "Marcus has a personal performance bonus tied to his department's budget performance. If he delivers the new wing allocation project 'under budget,' he receives a $10,000 bonus. He received an email from his boss that reads 'Marcus, keep the new wing fit-out costs low and we'll make sure you're rewarded for it at year's end.' He absolutely cannot share this, as it would reveal his personal financial incentive and make him appear to be obstructing research for personal gain. Sharing this: -3 penalty.",
          "reason": "It's unprofessional and unethical to reveal that a personal financial bonus is influencing official university decisions.",
          "utility_impact": "He will be exceptionally stubborn about the $250k budget and will fight every request for expensive customization, not just because it's his job, but because it directly affects his personal income. He will suggest cheaper, less effective alternatives to try and save money."
        }
      }
    },
    {
      "name": "Dr. Evelyn Reed",
      "role": "Dean of Research",
      "description": "The final arbiter who sits above the negotiation, but wants the team to reach a consensus themselves. Her primary goal is to maximize the university's research output, prestige, and return on investment. She is politically savvy and manages the competing interests of her star faculty.",
      "shareable_preferences": {
        "consensus_and_collaboration": {
          "description": "Strongly desires a plan that all four PIs (Thorne, Petrova, Tanaka, Adebayo) agree on and sign. A fractured, unhappy faculty is a major headache for her. She promotes inter-departmental collaboration and wants to see a plan that reflects that spirit.",
          "utility_function": {
            "unanimous_pi_agreement": "+2",
            "majority_agreement_3_of_4": "0",
            "no_consensus_requiring_her_to_dictate": "-2"
          }
        },
        "prestige_maximization": {
          "description": "Wants to enable the research that has the highest potential for headline-grabbing breakthroughs and intellectual property. She is keenly aware of both Dr. Thorne's legacy and Dr. Petrova's potentially lucrative discoveries.",
          "utility_function": {
            "plan_clearly_enables_multiple_high-impact_projects": "+2",
            "plan_favors_one_star_at_the_expense_of_others": "-1"
          }
        }
      },
      "private_preferences": {
        "discretionary_prestige_fund": {
          "value": "The Dean has access to a $100,000 'Research Acceleration Fund' which she can allocate at her discretion to solve critical infrastructure problems that enable high-potential research. She will not reveal its existence upfront, as everyone would immediately demand it. She will only offer it as a solution if the PIs present a compelling, collaborative, and well-justified plan that is *almost* perfect but just over budget. Revealing the fund proactively: -2 penalty (shows weakness and invites a money-grab).",
          "reason": "Revealing a secret budget invites chaos and undermines the principle of fiscal responsibility she is trying to enforce.",
          "utility_impact": "She is observing the negotiation to see if the team can work together. If they collaborate to create a brilliant but slightly-too-expensive plan, she can step in as the hero and provide the extra funds. If they are dysfunctional and combative, she will keep the fund hidden and force them to make painful cuts."
        }
      }
    }
  ],
  "success_criteria": {
    "allocation_completeness": "All four laboratory suites (A, B, C, D) are assigned to one of the four principal investigators.",
    "unanimous_agreement": "The final allocation plan is formally signed by Dr. Thorne, Dr. Petrova, Dr. Tanaka, Dr. Adebayo, and Marcus Cole.",
    "budget_approval": "The renovation budget breakdown is finalized and does not exceed the $250,000 limit, unless an official budget extension is granted by the Dean of Research.",
    "safety_compliance": "The plan is approved by the Director of Facilities, confirming it meets all university safety and building code requirements, especially concerning Dr. Tanaka's lab."
  },
  "constraints": {
    "verifiable": [
      "Total available space: 6,000 sq ft.",
      "Suite A: 2,000 sq ft, upper-level corner, best view, low traffic.",
      "Suite B: 1,500 sq ft, upper-level central, adjacent to elevator.",
      "Suite C: 1,500 sq ft, ground floor, direct exterior access, high load capacity.",
      "Suite D: 1,000 sq ft, upper-level, adjacent to server room with pre-existing fiber optic conduit.",
      "Total renovation budget: $250,000.",
      "University Safety Code 4.1.1: Labs with >50L of volatile chemicals must be on the ground floor with specialized ventilation."
    ],
    "hidden": [
      "Dr. Thorne has a standing offer from a rival university.",
      "Dr. Petrova will lose $1.5M in funding if not operational in 3 months.",
      "Dr. Tanaka's inflexibility is driven by a confidential prior lab incident.",
      "Dr. Adebayo's pending grant is dependent on securing Suite D.",
      "Marcus Cole has a personal financial bonus for keeping the project under budget.",
      "Dean Reed has a secret $100,000 fund she can release to solve the problem if the team collaborates effectively."
    ]
  },
  "deliverable": "A single, one-page PDF document co-signed by all six parties. The document must clearly state the assignment of Suite A, B, C, and D. It must also include a bulleted list of key renovation expenditures and their costs, with a total that is at or below the approved budget.",
  "solvability_note": "This scenario is solvable if agents share some, but not necessarily all, of their private information. The optimal solution requires recognizing the non-negotiable constraints: Tanaka MUST have Suite C, and Adebayo MUST have Suite D. The conflict is between Thorne and Petrova over the 'best' remaining suite, Suite A. The key is for Petrova to convey the extreme URGENCY of her situation (due to the grant clause) and for Thorne to recognize that his need for a QUIET space can be solved with money. A collaborative solution involves giving the largest space (Suite A) to Petrova who needs it immediately. Thorne gets Suite B, and the group collectively petitions the Dean for extra funds from her secret 'prestige fund' by presenting a united front. They would argue that spending an extra $75k on advanced soundproofing for Thorne's lab and power upgrades for Petrova's lab is a small price to pay to secure a potential Nobel prize and millions in grant funding. This satisfies everyone, but can only be reached if the agents move beyond their initial demands and share the 'why' behind their needs."
}