{
  "scenario": "A multi-stakeholder negotiation to finalize a collaborative 5-year action plan and budget for the restoration of the critically endangered Marisol Coral Reef. The negotiation brings together scientists, government, local businesses, and community leaders, each with conflicting priorities and hidden constraints.",
  "task": "The six agents must collaboratively decide on a unified 5-year project plan for the Marisol Reef restoration. This plan must specify: 1) The primary restoration methodology to be used (e.g., microfragmentation, larval propagation, etc.). 2) The specific reef zones to be prioritized for restoration (e.g., the tourist-heavy 'Rainbow Reef' vs. the ecologically critical 'Deep Ledge'). 3) The establishment and size (in square kilometers) of any Marine Protected Areas (MPAs). 4) A detailed budget allocation for the project, totaling exactly $3,000,000 from the combined pool of committed funds. The final agreement must be unanimous.",
  "agent_number": 6,
  "agent_names": [
    "Dr. Aris Thorne",
    "Lena Petrova",
    "Marco Diaz",
    "Beatrice Chen",
    "Julian Croft",
    "Sofia Reyes"
  ],
  "agents": [
    {
      "name": "Dr. Aris Thorne",
      "role": "Lead Scientist, Coral Resilience Institute",
      "description": "A dedicated and brilliant marine biologist who has spent 15 years studying the Marisol Reef. He is driven by scientific purity and long-term ecological viability above all else. He can be perceived as rigid and uncompromising.",
      "shareable_preferences": {
        "Prioritize Genetic Resilience": {
          "description": "Aris strongly advocates for using his lab's pioneering 'Gen-Resilience' larval propagation method. This involves cultivating specific heat-resistant coral genotypes in a lab for 18 months before planting. He insists this is the only way to ensure the reef survives future bleaching events. He requests at least $1.5 million of the budget be allocated to this method for lab equipment and long-term monitoring. Outcome Utility: +2 if 'Gen-Resilience' is the primary method with >=$1.5M funding; +1 if it's a major component with >=$1M; -1 if a different, less scientific method is chosen; -2 if his method is dismissed entirely.",
          "utility_impact": "This is his life's work. Securing this project would validate his research and provide a true, lasting solution. He will resist any 'quick-fix' solutions that he views as scientifically unsound."
        },
        "Focus on Deep Ledge Zone": {
          "description": "He wants the project to focus exclusively on the 'Deep Ledge' zone. While less visually spectacular, it's a critical spawning ground that influences the entire reef system's health. He argues that restoring this zone first provides the best ecological return on investment. Outcome Utility: +2 if Deep Ledge is the sole priority; +1 if it's the main priority (>60% of resources); -1 if it's a secondary priority; -2 if it's ignored in favor of tourist sites.",
          "utility_impact": "He sees focusing on tourist-friendly reefs as a waste of precious resources that ignores the root of the ecological problem. He will argue passionately against prioritizing aesthetics over ecosystem function."
        }
      },
      "private_preferences": {
        "Unpublished Research on Pollutants": {
          "value": "Aris's unpublished water sample analysis definitively links the reef's decline to high concentrations of neonicotinoid pesticides, a type of chemical commonly found in high-end turf fertilizers, not general agricultural runoff. He cannot share this specific finding publicly until his paper passes peer review in about 6 months. Penalty: Revealing the specific chemical source before publication would violate academic protocols and could get his paper scooped by rivals, jeopardizing his career and the Institute's reputation (-2 penalty).",
          "reason": "Academic integrity and risk of being discredited without peer-reviewed validation.",
          "utility_impact": "This knowledge makes him highly suspicious of any attempts to downplay land-based pollution. He will push for comprehensive water quality monitoring as part of the plan, without being able to say exactly what he's looking for."
        }
      }
    },
    {
      "name": "Lena Petrova",
      "role": "Regional Director, National Environmental Protection Agency (NEPA)",
      "description": "A pragmatic and politically astute bureaucrat. Lena needs to deliver a successful project that is both cost-effective and popular with the public to secure her department's future funding and her own career advancement.",
      "shareable_preferences": {
        "Balanced Budget Allocation": {
          "description": "Lena proposes an equitable distribution of the project budget across multiple methods and zones. She wants to see some funds for scientific research, some for immediate visible restoration, and some for community engagement. She will argue that a 'blended' approach is more resilient and politically defensible than putting all the eggs in one basket. Outcome Utility: +2 for a budget split across at least 3 categories with no single category getting >50%; 0 for a two-pronged approach; -2 if over 80% of the budget goes to a single methodology or zone.",
          "utility_impact": "A balanced plan allows her to report success to multiple stakeholders (scientists, businesses, public). It minimizes the political risk of a single, expensive method failing."
        },
        "Project Completion within 3 Years": {
          "description": "She insists that major, reportable milestones must be achieved within a 3-year timeframe to align with the current government's term. Long, 5-year research-heavy plans are unacceptable. She wants to be able to hold a press conference with tangible results before the next election. Outcome Utility: +2 if the plan has major visible outcomes within 3 years; 0 for a 4-year timeline; -2 for any plan where tangible results are only expected after 4 years.",
          "utility_impact": "Her performance is judged on delivering projects on time and on budget. A project that only bears fruit in 5-6 years is a political failure for her and her minister."
        }
      },
      "private_preferences": {
        "Severe Budgetary Constraints": {
          "value": "While the publicly announced government contribution is $1 million, Lena's department has only actually allocated $500,000. The other $500,000 is a 'stretch goal' contingent on her securing private matching funds and is currently earmarked for a politically-mandated dam inspection. Admitting her real budget is only $500k would make her look weak and lose all leverage in the negotiation. Penalty: Revealing the true $500k limit would cause her to lose face and negotiating power (-1 penalty).",
          "reason": "Inter-departmental politics and maintaining a strong negotiating position.",
          "utility_impact": "She will strongly resist any plan that requires more than $500,000 of government funds, pushing for other agents to contribute more, without being able to explain the hard limit."
        },
        "Directive to Protect 'Elysian Horizons'": {
          "value": "Lena received a direct, albeit deniable, instruction from the Minister of Commerce to ensure that 'Elysian Horizons' resort, a major political donor and employer, is not 'unduly burdened' by any new regulations or financial contributions resulting from this plan. Penalty: Revealing this political pressure would cause a public scandal and be career-ending (-2 penalty).",
          "reason": "Political pressure and career preservation.",
          "utility_impact": "She will actively steer conversations away from investigating corporate polluters and will defend Beatrice Chen's proposals for 'in-kind' contributions over significant financial ones."
        }
      }
    },
    {
      "name": "Marco Diaz",
      "role": "Owner, 'Azure Dreams' Dive & Eco-Tours",
      "description": "A passionate, third-generation local business owner. His entire livelihood depends on the reef. He's desperate and running out of time, seeing his family's legacy crumble with the coral.",
      "shareable_preferences": {
        "Immediate Restoration of 'Rainbow Reef'": {
          "description": "Marco demands that the project's top priority be the 'Rainbow Reef' zone, the primary location for tourist dives. He advocates for coral microfragmentation, a method that can create visible results in 12-24 months. He wants at least 70% of the on-site resources directed there immediately. Outcome Utility: +2 if Rainbow Reef is the top priority with >70% of resources; +1 if it is a joint priority; -1 if it's a secondary priority; -2 if it is ignored.",
          "utility_impact": "His business needs tourists now. He believes that a visually restored reef will bring back bookings and save his company. He doesn't have the luxury of waiting for long-term ecological recovery."
        },
        "No-Take Zone Opposition": {
          "description": "He is vehemently opposed to any large 'no-take' MPAs near the main tourist areas, arguing that it restricts access for his snorkeling and diving tours, which are the core of his business. He might accept a very small, designated 'regeneration zone' of less than 1 sq km. Outcome Utility: +1 for no MPA; 0 for an MPA < 1 sq km; -1 for an MPA between 1-5 sq km; -2 for an MPA > 5 sq km.",
          "utility_impact": "An MPA would make his most popular dive sites off-limits, directly and immediately impacting his revenue."
        }
      },
      "private_preferences": {
        "Imminent Bankruptcy": {
          "value": "Marco's business is 3 months away from defaulting on a $150,000 business loan. He needs a significant increase in tourist bookings within the next 12 months to survive. He has already laid off half his staff. His desperation is his primary motivator. Penalty: Revealing his dire financial state would destroy his credit, scare away any potential partners, and cause his remaining staff to quit (-2 penalty).",
          "reason": "Business reputation and financial survival.",
          "utility_impact": "This hidden deadline makes him desperate for a 'quick-fix'. He will agree to almost any plan that promises fast, visible results, even if he suspects it's not the best long-term solution."
        }
      }
    },
    {
      "name": "Beatrice Chen",
      "role": "VP of Sustainability, 'Elysian Horizons' Luxury Resorts",
      "description": "A polished and articulate corporate executive. Her goal is to secure a positive PR outcome for her company while minimizing its financial liability. She is an expert in corporate messaging and greenwashing.",
      "shareable_preferences": {
        "In-Kind Contributions": {
          "description": "Beatrice proposes that Elysian Horizons contribute primarily through 'in-kind' services valued at $500,000. This includes providing staff volunteers, boat access for scientists, and complimentary accommodation for visiting experts. She will argue this is a more practical and integrated contribution than a simple cash donation. Outcome Utility: +2 if the plan accepts >=$400k of her contribution as 'in-kind'; +1 if 'in-kind' is between $200k-$400k; -2 if the group demands a purely cash contribution.",
          "utility_impact": "In-kind contributions are easier to approve internally and have a much higher PR value for the company than a cash donation that looks like an admission of guilt."
        },
        "High-Visibility PR Opportunities": {
          "description": "She wants the project to include a major public-facing component, such as a visitor center or a 'resort-sponsored' coral nursery that guests can visit. She suggests a budget of $300,000 for 'Public Outreach & Marketing', which her team would manage. Outcome Utility: +2 if a resort-branded PR component is funded with >$250k; -1 if there is no specific PR/Marketing budget.",
          "utility_impact": "Her performance review is tied to generating positive media impressions for the Elysian brand. This project is, for her, a marketing opportunity."
        }
      },
      "private_preferences": {
        "Concealing the Pollution Source": {
          "value": "Beatrice is in possession of an internal environmental audit that confirms the resort's 18-hole golf course is leaching high quantities of neonicotinoid-based fertilizers directly into the groundwater that feeds into the Marisol Reef. The report estimates a proper water reclamation and filtration system would cost the company $2.5 million. Her primary, non-negotiable goal is to prevent this information from becoming public. She recently received an email from the CEO: 'Bea, fantastic work managing the runoff narrative. Keep it quiet for another year until the new property deal closes and there's a $100k bonus in it for you.' Penalty: If the audit is revealed, the company faces massive government fines, a PR catastrophe, and she will be fired (-2 penalty).",
          "reason": "Protecting the company from massive liability and securing a personal career-making bonus.",
          "utility_impact": "She will actively misdirect any conversation about pollution, blaming it on 'agricultural runoff from farms upriver' or 'legacy pollution'. She will strongly resist extensive water testing near the resort."
        }
      }
    },
    {
      "name": "Julian Croft",
      "role": "Independent Philanthropist, The Croft Foundation",
      "description": "A wealthy, retired tech entrepreneur. After losing his wife, a marine biologist, he has dedicated his fortune to environmental causes. He is passionate and wants to create a lasting legacy, but can be somewhat eccentric.",
      "shareable_preferences": {
        "Funding an Innovative Solution": {
          "description": "Julian is excited by cutting-edge, technologically advanced solutions. He is very interested in Dr. Thorne's genetic research and wants to fund a project that is 'bold and forward-looking', not just 'patching up the past'. He states he is prepared to make a 'significant' contribution of around $1.5 million for the right project. Outcome Utility: +2 if the chosen method is highly innovative (e.g., Gen-Resilience); +1 for a mix of old and new tech; -2 if the project only uses traditional, low-tech methods.",
          "utility_impact": "He wants to fund the 'next big thing' in conservation, something that will make headlines and be a fitting tribute to his wife's scientific mind."
        }
      },
      "private_preferences": {
        "The Memorial Clause": {
          "value": "Julian's full funding of $2 million is contingent on the project being officially named 'The Eleanor Croft Memorial Reef Project'. This is a deeply personal and non-negotiable condition. He is hesitant to mention it at the start, as he doesn't want to seem like he's buying the reef. Penalty: He feels that if he has to argue or aggressively push for this, it taints the memorial, so revealing it under pressure or having it rejected would be very upsetting (-1 penalty).",
          "reason": "Deeply personal desire to honor his late wife; fear of appearing vain.",
          "utility_impact": "He will listen to all proposals, but will ultimately only unlock his full $2M for the plan that he feels is most ambitious and worthy of his wife's name. He might seem agreeable to a lesser plan until the final funding commitment is requested."
        }
      }
    },
    {
      "name": "Sofia Reyes",
      "role": "Head of the Marisol Fishing Cooperative",
      "description": "A respected and tough community leader, representing the interests of local artisanal fishers whose families have worked these waters for generations. She is deeply skeptical of outsiders and government officials.",
      "shareable_preferences": {
        "Protecting Fishing Grounds": {
          "description": "Sofia's primary public stance is zero tolerance for any new 'no-take' Marine Protected Areas (MPAs). She argues that these zones displace her community members and threaten their way of life. She will use powerful, emotional arguments about tradition and survival to block any proposal for a large MPA. Outcome Utility: +2 for no MPA; +1 for an MPA < 0.5 sq km; -1 for an MPA of 1-5 sq km; -2 for any MPA larger than 5 sq km.",
          "utility_impact": "Her position as leader depends on her being seen as a staunch defender of the community's fishing rights. Any perceived weakness on this issue would have her removed."
        },
        "Community Employment": {
          "description": "She insists that any project plan must include a provision to hire at least 15 local fishers for project-related work (e.g., boat operations, coral planting, monitoring) at a fair wage, with a budget allocation of at least $300,000 over the 5 years for their salaries. Outcome Utility: +2 if >=15 jobs are created with >=$300k budget; +1 for 10 jobs; -1 for fewer than 5 jobs; -2 for no jobs guaranteed.",
          "utility_impact": "This provides a direct, tangible benefit to her community, making any other concessions she might have to make more palatable."
        }
      },
      "private_preferences": {
        "Need for Livelihood Transition": {
          "value": "Sofia privately knows the cooperative's fish catches are unsustainable due to their own overfishing with modern gear. She believes a temporary MPA is actually necessary for stocks to recover. Her members, however, would never agree. She could persuade them to accept a small, 5-year 'rest period' MPA of up to 5 sq km, but only if the cooperative receives a direct grant of $200,000 for 'equipment modernization and alternative livelihood training' (e.g., aquaculture, tourism). This would compensate them for the temporary loss of fishing grounds. Penalty: Admitting that her community is partially responsible for the declining fish stocks would cause her to lose all credibility and leadership authority (-2 penalty).",
          "reason": "Maintaining the trust and leadership of her community.",
          "utility_impact": "This creates a secret path to compromise. She will publicly fight against an MPA, but is privately looking for a way to get her community compensated, at which point she can 'be convinced' to accept a small one."
        }
      }
    }
  ],
  "success_criteria": {
    "Unanimous Agreement": "All six agents must vote 'Yes' on the final, written plan.",
    "Budget Adherence": "The final budget allocation must precisely total the verifiable $3,000,000.",
    "Plan Specificity": "The plan must clearly define the primary restoration methodology, the priority zones (with percentage of effort), the exact size of any MPA (in sq km), and a line-item budget.",
    "Actionability": "The plan must contain clear, actionable steps and milestones for the first 3 years."
  },
  "constraints": {
    "verifiable": [
      "Total Project Budget Pool: $3,000,000. (This is composed of the publicly stated commitments: NEPA's $1M, The Croft Foundation's $1.5M, and Elysian Horizons' $500k).",
      "Project Duration: 5 years.",
      "Geographic Scope: The Marisol Reef system, which includes the 'Rainbow Reef' zone (10 sq km) and the 'Deep Ledge' zone (15 sq km)."
    ],
    "hidden": [
      "NEPA's actual available budget is only $500,000.",
      "The Croft Foundation's full potential contribution is $2,000,000, but is locked behind a naming condition.",
      "Elysian Horizons is the primary source of a key pollutant and faces a potential $2.5 million liability.",
      "The Fishing Cooperative requires a $200,000 compensation package to agree to any meaningful MPA."
    ]
  },
  "deliverable": "A single, detailed JSON object representing the final agreed-upon 5-year action plan. The object must contain keys for 'methodology', 'priority_zones', 'mpa_size_sq_km', and 'budget_allocation' (a nested object with line items for each agent's priorities).",
  "solvability_note": "The scenario is solvable because the hidden information, once revealed, creates a clear path to a mutually beneficial agreement. Beatrice's hidden $2.5M liability for the filtration system can be framed as the resort's primary project contribution, solving the pollution at its source. This frees up Julian's full $2M, which is more than enough to fund Aris's expensive high-tech project and satisfy Julian's desire for innovation. With the major funding secured, Lena's real budget of $500k is no longer a blocker. A portion of it ($200k) can be used to meet Sofia's private need for community compensation, allowing her to agree to a temporary MPA. The remaining government and corporate funds can be used to fund Marco's need for immediate, visible restoration on Rainbow Reef, saving his business."
}