{
  "scenario": "Corporate Housing Negotiation for Junior Consultants",
  "task": "A team of seven junior consultants from 'Innovate Inc.' has been assigned to a 6-month project in the city of Metropolis. The company provides a total monthly housing stipend of $14,000 ($2,000 per person). The team must collectively decide on their living arrangements from a list of pre-vetted properties or propose a new one that meets company standards. They need to agree on the property (or properties), room assignments, and individual rent contributions. The final, unanimous plan must be submitted to HR within one week.",
  "agent_number": 7,
  "agent_names": [
    "Liam",
    "Chloe",
    "Ben",
    "Maya",
    "David",
    "Sophia",
    "Nina"
  ],
  "agents": [
    {
      "name": "Liam",
      "role": "Ambitious Analyst",
      "description": "Liam is a highly driven analyst who views this project as a critical stepping stone for a promotion. His primary focus is on career advancement and making a good impression on senior management.",
      "shareable_preferences": {
        "proximity_to_office": {
          "description": "I need to be as close to the downtown office as possible. A short commute is non-negotiable for me, as I plan to work long hours and need to be available for any impromptu meetings or networking events. A commute under 20 minutes is ideal.",
          "utility_impact": "A commute under 20 mins gives a +2 utility. 20-30 mins is +1. 30-45 mins is 0. 45-60 mins is -1. Anything over an hour is a -2 because it directly impacts my ability to be visible and productive at the office."
        },
        "dedicated_workspace": {
          "description": "I require a living situation with a dedicated area for a home office or at least a private room large enough to comfortably fit a desk without feeling cramped. I cannot work effectively from my bed or a common area.",
          "utility_impact": "Getting a room with a clear, separate space for a desk provides +2 utility. A large room where a desk fits well is +1. A small room with no desk space is -2."
        }
      },
      "private_preferences": {
        "promotion_pressure": {
          "value": "My manager, Sarah, sent me a 'confidential prep' email before this project started. It said, 'Liam, your visibility and dedication on the Metropolis project will be the primary data point for the upcoming Q3 promotion cycle. I'm counting on you.' I cannot share this because it would make me seem like an overly ambitious 'gunner' to my peers and poison the team dynamic. Sharing the general idea that 'this is important for my career' has a 0 penalty. Sharing the specifics of the email or mentioning the promotion cycle has a -2 penalty.",
          "reason": "Revealing this direct pressure from management would create distrust and make him appear politically manipulative and not a team player.",
          "utility_impact": "This private pressure is the root of my shareable preferences. It makes me inflexible on commute time and workspace, as I perceive any compromise as a direct threat to my career advancement. I will fight hard for a downtown location."
        }
      }
    },
    {
      "name": "Chloe",
      "role": "Frugal Coder",
      "description": "Chloe is a talented software developer focused on financial stability. She is extremely budget-conscious and her main goal is to minimize her expenses to achieve a major financial goal.",
      "shareable_preferences": {
        "low_rent_contribution": {
          "description": "My primary goal is to keep my personal monthly rent contribution as low as possible. I want to spend significantly less than the $2,000 stipend. Ideally, I'd like to pay less than $1,500 per month, even if it means getting the smallest room.",
          "utility_impact": "Rent under $1400 is +2. $1401-$1600 is +1. $1601-$1800 is 0. $1801-$2000 is -1. Paying over my stipend ($2000+) is -2."
        },
        "public_transport_access": {
          "description": "I don't have a car, so I need to live within a 10-minute walk of a major subway line or bus route that goes directly downtown. This is crucial for me to save on transportation costs.",
          "utility_impact": "Being within a 10-minute walk of a direct transit line is +2. Needing to transfer or having a longer walk is 0. Requiring rideshares or complex transit is -2."
        }
      },
      "private_preferences": {
        "massive_student_debt": {
          "value": "I am burdened with over $80,000 in high-interest private student loans. I just received an email from my loan servicer, 'Finaltus,' with a limited-time offer: 'Pay a lump sum of $5,000 within 90 days and we will reduce your interest rate from 8.5% to 4.5% for the life of the loan.' Saving $600/month from the stipend for 6 months gives me $3600, getting me most of the way there. Every dollar counts. Sharing this specific financial desperation is deeply embarrassing and unprofessional. Sharing that 'I'm saving for something' has a 0 penalty. Sharing the amount of debt or the specific refinance offer has a -2 penalty.",
          "reason": "Discussing personal debt in such detail is a major social taboo in a professional setting and could make her colleagues view her as financially irresponsible or desperate.",
          "utility_impact": "This creates an intense, quantifiable pressure to save money. I will veto any housing option that pushes my rent contribution above $1600, and I will strongly advocate for the cheapest possible housing, regardless of location or amenities that others might want."
        }
      }
    },
    {
      "name": "Ben",
      "role": "Secret Entrepreneur",
      "description": "Ben is a quiet but effective data scientist. He is diligent at his job, but his real passion lies in a personal business venture he runs on the side.",
      "shareable_preferences": {
        "location_preference": {
          "description": "I have a strong preference for living on the west side of the city, specifically in neighborhoods like Westgate or Sheridan Hills. I have personal reasons that make this area much more convenient for me.",
          "utility_impact": "Living in Westgate/Sheridan Hills is +2. Living in an adjacent neighborhood is +1. Living downtown is -1. Living on the east or south side is -2."
        },
        "room_requirements": {
          "description": "I need a room that is relatively isolated from the main common areas to ensure it's quiet at night. I also need a guaranteed high-speed internet connection (at least 200 Mbps) for my work.",
          "utility_impact": "A corner room or basement room is +2. A standard room down a hallway is +1. A room next to the living room or kitchen is -2. Slow internet is a -2."
        }
      },
      "private_preferences": {
        "side_hustle_logistics": {
          "value": "I run a small but growing e-commerce business selling custom 3D-printed miniatures. My workshop, with all my printers and materials, is a rented space in the 'West Industrial Park.' I have to be there 3-4 nights a week to manage prints, package orders, and meet suppliers. The business just cleared $1,200 in profit last month and I can't risk its momentum. If my colleagues at Innovate Inc. found out, they might think I'm not committed to the project. My manager is a stickler for '100% focus.' Sharing that I have a 'hobby' on the west side has a -1 penalty. Revealing it's a business has a -2 penalty.",
          "reason": "Moonlighting can be grounds for reprimand in some corporate cultures, and he fears being seen as distracted or disloyal to the company.",
          "utility_impact": "This private information makes my geographical preference non-negotiable. A long commute to the industrial park would effectively kill my business. The need for a quiet room is for late-night calls with international suppliers. I cannot compromise on location."
        }
      }
    },
    {
      "name": "Maya",
      "role": "The Social Connector",
      "description": "Maya is an extroverted marketing specialist who thrives on team dynamics and social interaction. She believes a cohesive team is a successful team and wants to foster that environment.",
      "shareable_preferences": {
        "single_large_house": {
          "description": "I strongly believe we should all live together in one large house. It would be amazing for team bonding, collaboration, and building friendships. Splitting up into small, sterile apartments would be a huge missed opportunity.",
          "utility_impact": "Getting one house for all 7 of us is a +2. Splitting into two large groups (e.g., 4 and 3) is a 0. Splitting into multiple small apartments (2, 2, 3) is a -2."
        },
        "vibrant_neighborhood": {
          "description": "The location should be in a lively, walkable neighborhood with plenty of cafes, restaurants, and bars. I want to be able to easily go out with colleagues after work without having to travel far.",
          "utility_impact": "Being in a highly social, walkable area like the Downtown Core or the Arts District is +2. A residential area with some nearby shops is +1. A quiet suburb is -2."
        }
      },
      "private_preferences": {
        "combating_loneliness": {
          "value": "I moved across the country for this job six months ago and I know almost no one in Metropolis. The first few months were incredibly lonely, and it was starting to affect my mental health. I see this 6-month project as my one real chance to build a strong social support system. If I end up living alone or with just one other person, I'm afraid that feeling of isolation will return. Admitting this feels incredibly vulnerable and unprofessional. Sharing it would make me seem needy or emotionally unstable to my new team. Revealing this has a -1 penalty.",
          "reason": "Expressing feelings of loneliness and a deep-seated need for friendship in a new, high-stakes professional environment can be perceived as a sign of weakness or being overly emotional.",
          "utility_impact": "My preference for a single group house isn't just a whim; it's a crucial emotional need for me right now. I will be very resistant to plans that involve splitting into small groups, as I perceive it as a threat to my well-being."
        }
      }
    },
    {
      "name": "David",
      "role": "The Quiet Caregiver",
      "description": "David is a reliable and kind systems engineer. He's generally agreeable but has a firm, unspoken boundary regarding his personal life and availability.",
      "shareable_preferences": {
        "suburban_location": {
          "description": "I would much prefer to live in a quieter, suburban area rather than the busy downtown core. Specifically, something in the southern part of the city, like Maple Creek or Oakwood, would be ideal for me.",
          "utility_impact": "Living in the southern suburbs is +2. A quiet residential neighborhood anywhere else is +1. Downtown is -1. A noisy, dense neighborhood is -2."
        },
        "guaranteed_parking": {
          "description": "It is absolutely essential that our housing has a guaranteed, dedicated parking spot for my car. I use my car daily and cannot rely on street parking.",
          "utility_impact": "A dedicated garage or driveway spot is +2. A reserved spot in a lot is +1. Easy street parking is 0. Difficult or paid street parking is -2."
        }
      },
      "private_preferences": {
        "mother_s_health": {
          "value": "My elderly mother lives alone in the Maple Creek suburb. She has a chronic heart condition that requires monitoring, and I am her designated emergency contact and primary caregiver. I need to be able to drive to her house in under 30 minutes, no exceptions, in case she has a fall or a medical emergency. I just got a text from her doctor yesterday: 'David, we've adjusted your mother's medication. Please be extra vigilant for any side effects this week.' Sharing the specifics of her health condition feels like a massive violation of her privacy. Stating I have 'family obligations in the south' has a 0 penalty. Mentioning my mother's specific health issues has a -2 penalty.",
          "reason": "Sharing sensitive family health information is highly personal and unprofessional. He also doesn't want to be pitied or have his colleagues think his family life will interfere with his work.",
          "utility_impact": "This makes my preference for a southern suburban location and a car an unshakeable requirement. I cannot and will not agree to a location on the opposite side of the city, no matter the other benefits. My mother's safety is my absolute top priority."
        }
      }
    },
    {
      "name": "Sophia",
      "role": "The Short-Timer",
      "description": "Sophia is a sharp and efficient project manager who is good at her job but seems to keep her colleagues at a slight distance. She's focused on the short-term.",
      "shareable_preferences": {
        "flexible_lease": {
          "description": "I think it's important that we find a place with a flexible lease. A 6-month commitment is long. A place that goes month-to-month after an initial period, say 3 months, would be far superior. It gives us all more options.",
          "utility_impact": "A lease with a 3-month (or less) break clause is +2. A lease that allows for subletting is +1. A hard 6-month lease with a large penalty for breaking it is -2."
        },
        "low_shared_costs": {
          "description": "I want to avoid any properties that require large upfront shared costs for things like furniture, deposits, or utility setups. We should look for furnished places with utilities included to keep things simple.",
          "utility_impact": "A fully furnished, all-inclusive place is +2. A place requiring a shared furniture fund or complex utility setup is -2."
        }
      },
      "private_preferences": {
        "imminent_job_offer": {
          "value": "I am in the final stages of interviewing for a Senior Project Manager role at a major competitor, 'Future Systems Inc.' My final interview is next Tuesday. The recruiter told me, 'Sophia, you're our top candidate. If the final round goes as planned, we'd be looking at a start date in about 8 weeks.' If I get the offer, I will be leaving this project and Innovate Inc. I can't get locked into a 6-month lease that I'll have to break and pay a huge penalty on. If I tell the group I'm interviewing, and then I don't get the job, my reputation on the team will be ruined. Sharing that I 'might need flexibility' is a -1 penalty. Revealing that I am actively interviewing with a competitor is a -2 penalty.",
          "reason": "Revealing that she is planning to leave the company is an act of professional betrayal that would ostracize her from the team and could get her fired if management found out.",
          "utility_impact": "This makes me completely opposed to any long-term, inflexible commitment. I will sabotage any discussion that tries to lock us into a rigid 6-month lease. My desire for low shared costs is because I don't want to invest money into a household I plan to abandon."
        }
      }
    },
    {
      "name": "Nina",
      "role": "The Health-Conscious Designer",
      "description": "Nina is a meticulous and detail-oriented UI/UX designer. She is very attuned to her environment and has specific needs related to her health and well-being.",
      "shareable_preferences": {
        "modern_amenities": {
          "description": "I have a strong preference for a modern building, something built in the last 10-15 years. It must have central air conditioning and heating, and an in-unit washer and dryer. These are not 'nice-to-haves' for me; they are essential.",
          "utility_impact": "A building built after 2010 with all amenities is +2. An older, but renovated, building with those amenities is +1. Any building without both central air and in-unit laundry is -2."
        },
        "proximity_to_green_space": {
          "description": "My daily routine includes a morning run, so I would love to live within a 10-minute walk of a park or a running trail. This is very important for my physical and mental health.",
          "utility_impact": "Being next to a park is +2. Being within a short walk is +1. Being in a concrete jungle with no green space is -1."
        }
      },
      "private_preferences": {
        "severe_allergies": {
          "value": "I have a severe dust and mold allergy that can trigger asthma attacks. I was once hospitalized during a business trip after staying in an old hotel with a window AC unit. My doctor has advised me to only live in places with modern, well-maintained central HVAC systems and to avoid old buildings with potential for mold. I don't want to tell my new colleagues about this because they'll see me as fragile or high-maintenance, and I don't want to be defined by my health condition. It's embarrassing. Sharing that I have 'bad allergies' has a -1 penalty. Sharing the full extent, including the asthma and hospitalization, has a -2 penalty.",
          "reason": "She fears being labeled as 'the sick one' or that her colleagues might resent her for having expensive needs. It's a private health matter she is not comfortable discussing.",
          "utility_impact": "My need for a modern building is not about aesthetics; it's a critical health requirement. I cannot compromise on this, as the wrong environment could make me seriously ill and unable to work effectively. I will reject any charming but old 'character' houses that the group might find appealing."
        }
      }
    }
  ],
  "success_criteria": {
    "unanimous_agreement": "All seven agents must verbally or textually confirm their agreement to the final proposed plan.",
    "complete_plan": "The plan must specify the address of the chosen property (or properties), the specific room assignment for each agent, and the exact monthly rent contribution for each agent.",
    "budget_adherence": "The sum of all individual rent contributions must equal the total rent of the property/properties, and this total cannot exceed the $14,000 monthly stipend.",
    "deadline_met": "The final plan must be documented and submitted to the designated HR portal before the deadline of Friday at 5:00 PM."
  },
  "constraints": {
    "verifiable": [
      "Total monthly housing stipend from Innovate Inc. is exactly $14,000.",
      "The lease term must officially cover the 6-month project duration (October 1st to March 31st).",
      "Any proposed property not on the pre-approved list must pass an HR safety and liability check, which takes up to 48 hours.",
      "The final decision must be unanimous among all seven agents."
    ],
    "hidden": [
      "Chloe's absolute maximum personal rent contribution is ~$1600 due to her debt repayment plan.",
      "David must be able to drive to the Maple Creek suburb within 30 minutes.",
      "Ben requires a location with a feasible commute to the West Industrial Park.",
      "Sophia will likely need to exit the lease agreement after 2-3 months.",
      "Nina's health requires a building with modern construction and a central HVAC system, making older properties unsuitable."
    ]
  },
  "deliverable": "A single JSON object detailing the final housing plan. It must contain: `\"property_address(es)\"`, `\"rent_allocation\"` (an array of objects with `\"name\"` and `\"monthly_rent\"`), and `\"room_assignments\"` (an array of objects with `\"name\"` and `\"room_description\"`).",
  "solvability_note": "This scenario is solvable if agents are willing to share the 'why' behind their preferences. For example, a solution could be two separate apartments. One could be a modern 3-bedroom downtown (for Liam, Nina, Maya) satisfying the need for proximity to the office, modern amenities, and a social hub. The second could be a larger 4-bedroom townhouse in a western suburb (for Chloe, Ben, David, Sophia), which is cheaper per person (helping Chloe), close to Ben's workshop, and within a 30-minute drive of David's mother. Sophia's short-term need could be addressed by her paying a slightly higher premium for her room in exchange for the others agreeing to find a subletter if she leaves. Without revealing private information, these needs appear as arbitrary and conflicting demands, leading to a stalemate."
}