{
  "scenario": "National Emergency Alert System (NEAS) Spectrum Allocation",
  "task": "A national-level committee of six key stakeholders must negotiate and agree upon a definitive allocation plan for the 470-512 MHz radio spectrum block. This band is being repurposed for a new, unified National Emergency Alert System (NEAS). The final agreement must be formalized in a Memorandum of Understanding (MOU) that specifies the precise frequency assignments, technology standards, power limits, access protocols, and financial responsibilities for all parties involved. The goal is to create a robust, secure, and universally accessible system while balancing the conflicting technical, financial, and security interests of all stakeholders.",
  "agent_number": 6,
  "agent_names": [
    "Dr. Anya Sharma",
    "Ben Carter",
    "Chloe Davis",
    "Colonel Marcus Thorne",
    "Maria Flores",
    "Leo Kwan"
  ],
  "agents": [
    {
      "name": "Dr. Anya Sharma",
      "role": "Chairperson, National Telecommunications Commission (NTC)",
      "description": "As the lead regulator, Dr. Sharma is responsible for the efficient and fair allocation of the nation's airwaves. Her primary mandate is to serve the public interest, ensure technical standards are met, and maintain international regulatory harmony. She is the official facilitator of this negotiation.",
      "shareable_preferences": {
        "Spectrum Efficiency": {
          "description": "Advocates for allocating the spectrum in large, contiguous blocks. A plan that allocates, for example, a single 18 MHz block for public broadcasting is far superior to three separate 6 MHz blocks. This minimizes 'guard band' waste and simplifies management. She strongly prefers the COFDM (Coded Orthogonal Frequency-Division Multiplexing) modulation scheme for its efficiency in dense signal environments.",
          "utility_impact": "A highly efficient, contiguous plan gets a +2 utility. A fragmented plan with significant wasted guard bands gets a -1. A plan that uses an inefficient modulation scheme gets a -1."
        },
        "Mandatory Public Access Channel": {
          "description": "Insists on a mandatory, unencrypted, free-to-air 'Public Alert Channel' occupying at least 8 MHz of the prime spectrum. This channel must be accessible by any standard receiver and cannot be bundled with commercial services. This is a non-negotiable public safety mandate from the NTC's perspective.",
          "utility_impact": "Securing this 8 MHz public channel results in a +2 utility. Failure to secure it or having it be less than 8 MHz results in a -2 utility."
        },
        "International Harmonization": {
          "description": "The final allocation plan must not create interference with neighboring countries' broadcast services, which heavily use the 470-480 MHz and 505-512 MHz bands. Any plan that assigns high-power transmissions in these edge bands is unacceptable and would violate international agreements.",
          "utility_impact": "A plan that respects these international buffer zones gets a +1 utility. A plan that violates them, forcing difficult international re-negotiations, gets a -2 utility."
        }
      },
      "private_preferences": {
        "Political Pressure to Protect GMI": {
          "value": "The Minister of Communications, under pressure from a powerful media lobby, has privately instructed Dr. Sharma to ensure that the final plan does not impose 'undue financial hardship' on major commercial broadcasters. Her working definition of this is any plan that forces Global Media Inc. (GMI) to spend more than $50 million on infrastructure retrofits. She can share that she wants a 'business-friendly solution' but cannot reveal the specific political directive or the $50M figure.",
          "reason": "Revealing this would expose the NTC to accusations of regulatory capture and political favoritism, severely damaging its reputation for impartiality.",
          "utility_impact": "If GMI's costs exceed $50M, she receives a -2 utility penalty from her superiors. If she reveals the political directive, she receives a -2 utility penalty for damaging the NTC's reputation."
        },
        "Upcoming Spectrum Auction": {
          "value": "The NTC is planning a major auction of the adjacent 512-520 MHz band in the next fiscal year. A clean, well-defined, and interference-free allocation of the 470-512 MHz band will make the adjacent frequencies significantly more valuable, with internal estimates projecting an increased auction value of over $200 million. A messy, contentious allocation will scare off bidders. She cannot share this market-sensitive information.",
          "reason": "Revealing this information would be seen as manipulating a public safety negotiation for future government profit and could lead to accusations of insider trading.",
          "utility_impact": "A 'tidy' plan that boosts the future auction value provides a +1 utility. Revealing the auction's financial link to this negotiation results in a -2 utility penalty for professional misconduct."
        }
      }
    },
    {
      "name": "Ben Carter",
      "role": "Chief Engineer, Public Broadcasting Corporation (PBC)",
      "description": "Ben is a veteran engineer representing the nation's non-profit public broadcaster. PBC has a legal mandate to provide service to all citizens, including those in remote and rural areas that are unprofitable for commercial companies to serve.",
      "shareable_preferences": {
        "Low-Frequency Band for Rural Reach": {
          "description": "PBC absolutely must secure the lower portion of the spectrum, specifically 470-488 MHz. The superior propagation characteristics of these lower frequencies are essential for reaching sparsely populated rural and mountainous regions using their existing network of transmission towers. Moving to higher frequencies would create massive 'dead zones' in their coverage map.",
          "utility_impact": "Securing the 470-488 MHz block gives a +2 utility. Being forced into any band above 490 MHz results in a -2 utility, as it would represent a catastrophic failure of their public service mission."
        },
        "Low-Power Transmission Allowance": {
          "description": "The plan must allow for the use of existing low-power transmission equipment. Forcing PBC to upgrade to high-power transmitters would dramatically increase their operational electricity costs, which come from a fixed government budget. He will argue this is an issue of environmental responsibility and fiscal prudence.",
          "utility_impact": "A plan that accommodates their existing low-power transmitters gets a +1 utility. A plan mandating high-power systems gets a -1 utility."
        },
        "Preference for Open Standards": {
          "description": "PBC advocates for the use of a well-established, open standard like ATSC 3.0. This ensures long-term support, interoperability with a wide range of receivers, and avoids vendor lock-in with a single company. They are highly skeptical of new, proprietary technologies.",
          "utility_impact": "Adoption of ATSC 3.0 gives a +1 utility. Being forced to use a proprietary standard like Omni-Wave gets a -1 utility."
        }
      },
      "private_preferences": {
        "Critically Failing Infrastructure": {
          "value": "The truth behind the push for low frequencies and low power is that PBC's transmission infrastructure is crumbling. An internal audit, which Ben has possession of, shows that 40% of their rural towers have structural and electrical issues and cannot safely handle the power load or wind resistance of the larger antennas required for higher-frequency broadcasting. A forced upgrade would cost over $80 million, a sum PBC absolutely does not have. He can hint at 'budget constraints' but cannot reveal the scale of the disrepair.",
          "reason": "Admitting that PBC's infrastructure is in a state of critical failure due to years of deferred maintenance would jeopardize their entire public funding portfolio and could lead to his dismissal for mismanagement.",
          "utility_impact": "Revealing the audit or the true state of their infrastructure is a -2 utility penalty. Any plan that requires these upgrades is also a -2 utility, as it would bankrupt the corporation."
        },
        "Pending 'Digital Divide' Grant": {
          "value": "PBC has a $50 million grant application pending with the 'Bridging the Digital Divide' federal program. A key component of the application is a detailed plan to use the 470-488 MHz band to deliver educational data and services to underserved rural communities. Failure to secure this specific band will make the grant application non-viable.",
          "reason": "This is confidential information related to a competitive grant process. Divulging it would be unprofessional and could harm their chances.",
          "utility_impact": "Securing the 470-488 MHz band is critical for the grant, making his preference for it even stronger. Revealing the grant connection incurs a -1 utility penalty."
        }
      }
    },
    {
      "name": "Chloe Davis",
      "role": "Head of Operations, Global Media Inc. (GMI)",
      "description": "Chloe represents a massive, publicly-traded commercial media conglomerate. Her primary responsibility is to maximize shareholder value by controlling costs, protecting investments in existing infrastructure, and developing new revenue streams.",
      "shareable_preferences": {
        "Minimize Retrofit Costs": {
          "description": "GMI has invested heavily in digital transmitters over the last decade. She demands a solution that allows them to reuse the majority of this equipment. A plan requiring a 'forklift upgrade' of all their hardware is unacceptable. She will present cost models showing that anything over $75M in industry-wide retrofits is economically unfeasible.",
          "utility_impact": "A plan costing GMI less than $10M gets a +2 utility. A plan costing between $10M-$50M gets a 0 utility. A plan costing over $75M gets a -2 utility."
        },
        "Guaranteed Datacasting Revenue Channel": {
          "description": "To offset the costs of compliance, GMI wants to be allocated a 6 MHz channel that can carry revenue-generating datacasting services (like subscription weather data, stock tickers, targeted advertising) alongside the emergency alerts. A simple 'alert-only' channel is a net loss for them.",
          "utility_impact": "Securing a channel with datacasting rights gets a +2 utility. Getting an alert-only channel gets a -1 utility."
        },
        "Phased 5-Year Rollout": {
          "description": "To manage the capital expenditure and avoid a single massive hit to their quarterly earnings, she insists on a phased, 5-year transition period. A mandate for a full transition in 1-2 years is too aggressive and would be met with legal challenges.",
          "utility_impact": "A 5-year or longer rollout gets a +1 utility. A rollout of 2 years or less gets a -1 utility."
        }
      },
      "private_preferences": {
        "Secret Deal with OmniSignal's Competitor": {
          "value": "GMI has a signed, confidential Letter of Intent with 'SignalCore,' a major competitor to OmniSignal. SignalCore's technology is 30% cheaper and is optimized for the 494-500 MHz frequency band. If the committee chooses OmniSignal's tech or a different band, this highly advantageous deal collapses. She cannot reveal the deal due to a strict NDA.",
          "reason": "Revealing the secret deal would violate the NDA, expose GMI to litigation, and destroy their negotiating leverage with both SignalCore and OmniSignal.",
          "utility_impact": "She is highly motivated to push for the 494-500 MHz band and discredit OmniSignal's tech. Revealing the SignalCore deal is a -2 utility penalty."
        },
        "Performance Bonus Tied to Cost": {
          "value": "Chloe has a copy of a congratulatory email from her CEO on her desktop: 'Chloe, fantastic work on the Q3 cost-cutting initiatives. You've saved the company $2M in operational overhead. Your performance bonus, which is contingent on keeping our total NEAS transition costs under the $20M mark, is projected to be over $150k.' She is very proud of her cost-saving reputation.",
          "reason": "This is personal financial information and internal company correspondence. It would be unprofessional to reveal and would show that her negotiation stance is driven by personal gain, not just corporate interest, severely weakening her credibility.",
          "utility_impact": "She is extremely motivated to keep costs low. If she hints about her general cost-saving successes, it's a -1 penalty. If she reveals the direct link between the negotiation outcome and her personal bonus, it's a -2 penalty."
        }
      }
    },
    {
      "name": "Colonel Marcus Thorne",
      "role": "Director, Cyber & Signal Command, Department of National Defense (DND)",
      "description": "Colonel Thorne's sole focus is national security. He views the radio spectrum as a critical military asset that must be secured and controlled to protect the nation from its adversaries. He is often terse and views civilian concerns as secondary to security imperatives.",
      "shareable_preferences": {
        "Hardened Primary Channel": {
          "description": "The DND requires an exclusive, encrypted, 4 MHz channel with top-priority access for command-and-control communications during a national emergency. This channel must be impervious to civilian network congestion and must be under the DND's absolute control.",
          "utility_impact": "Getting this exclusive, priority channel is a +2 utility. A shared channel, or one without top priority, is a mission failure and a -2 utility."
        },
        "Advanced Anti-Jamming Capability": {
          "description": "The chosen technology standard MUST incorporate military-grade, frequency-hopping spread spectrum (FHSS) or similar anti-jamming capabilities. A standard fixed-frequency system is a non-starter as it's too vulnerable to enemy electronic warfare.",
          "utility_impact": "A plan with robust anti-jamming features gets a +2 utility. A plan without them gets a -2 utility."
        },
        "Exclusion Zones": {
          "description": "The DND requires 'quiet zones' around sensitive military installations. In these geographic areas, civilian transmissions on the NEAS frequencies must be restricted to very low power levels to prevent interference with critical intelligence-gathering operations.",
          "utility_impact": "Securing these exclusion zones gets a +1 utility. Failure to do so gets a 0 utility, as they can use other mitigation methods, but it's not ideal."
        }
      },
      "private_preferences": {
        "Top Secret 'Project Nightingale'": {
          "value": "The DND is actively testing a highly classified drone surveillance system, 'Project Nightingale,' which operates using faint, wide-band signals squarely in the 486-492 MHz range. Any civilian or public safety broadcast in this 6 MHz block would completely blind the system, rendering a multi-billion dollar national security asset useless. The system's existence is Top Secret. He cannot, under any circumstances, reveal why this band must be kept clear.",
          "reason": "This is a matter of utmost national security. Revealing the project would be considered treason and would compromise a critical intelligence capability.",
          "utility_impact": "He MUST keep the 486-492 MHz band completely clear of any transmissions. He will invent any plausible technical excuse (e.g., 'unstable atmospheric ducting,' 'solar flare susceptibility') to achieve this. There is no compromise on this point. Revealing the project is a -10 utility penalty."
        },
        "Allied Interoperability Requirement": {
          "value": "The DND also needs a secondary, lower-priority channel for logistical coordination with allied forces during joint operations. Their allies' systems are standardized around the 500-504 MHz band. Securing this band would greatly simplify joint communications.",
          "reason": "Revealing the specific reason for wanting this band discloses information about allied military capabilities and standards, which is classified as Confidential.",
          "utility_impact": "He will push for the 500-504 MHz band, but will cite vague reasons like 'legacy equipment compatibility.' Revealing the allied interoperability reason is a -1 utility penalty."
        }
      }
    },
    {
      "name": "Maria Flores",
      "role": "Director, National Emergency Management Agency (NEMA)",
      "description": "Maria represents the first responders and the public. Her agency is responsible for issuing alerts for everything from natural disasters to civil emergencies. Her priorities are the speed, clarity, and reliability of the alerts to save lives.",
      "shareable_preferences": {
        "Ultra-Low Latency": {
          "description": "The most critical factor for NEMA is the 'glass-to-glass' latency – the time from when an operator hits 'send' to when the public's devices sound an alert. This must be under 10 seconds. Current systems can sometimes take minutes, which is unacceptable in a fast-moving crisis like a tornado or active shooter event.",
          "utility_impact": "A system with <10s latency gets a +2 utility. Between 10-30s is a 0. A system with >30s latency is a failure and gets a -2 utility."
        },
        "First Responder Interoperability": {
          "description": "The system must be built on an open, non-proprietary standard. This is crucial so that local police, fire, and paramedic services can integrate their existing dispatch systems to push localized alerts directly, rather than routing everything through a central NEMA bureau. This decentralization is key to speed and relevance.",
          "utility_impact": "An open, interoperable system gets a +2 utility. A closed, proprietary system controlled by one vendor gets a -2 utility."
        },
        "System Redundancy": {
          "description": "The final plan must mandate full redundancy. For any given area, the alert must be broadcast from at least two geographically separate transmission sites. This ensures that a single point of failure (e.g., a tornado taking out a broadcast tower) does not disable the alert system for that entire region.",
          "utility_impact": "Full redundancy gets a +1 utility. A single-point-of-failure design gets a -1 utility."
        }
      },
      "private_preferences": {
        "Damning Internal Report on 'Alert Fatigue'": {
          "value": "NEMA recently commissioned a confidential study after a catastrophic hurricane response. The report, which she has, concludes that the primary failure of the old system was not signal coverage, but 'alert fatigue.' The public was so inundated with conflicting alerts from a dozen different channels that they began ignoring all of them. The report is a scathing indictment of the current fragmented system and reflects poorly on NEMA's management.",
          "reason": "The report is politically explosive and embarrassing. Releasing it would trigger a public scandal and undermine confidence in her agency, likely leading to her resignation.",
          "utility_impact": "This report is the true reason she is desperate for a single, unified alert channel. It's not just a preference; it's a reaction to a proven, fatal flaw. She will push for unification above all else. Releasing the report is a -2 utility penalty."
        },
        "Misspent Public Education Budget": {
          "value": "NEMA's entire $5 million budget allocated for a public education campaign about the new NEAS was accidentally spent on an unrelated and overdue IT mainframe upgrade due to an accounting error. She has no money left to explain a complex, multi-channel system to the public. A single, simple, unified alert channel is the only system she can implement without having to admit this massive financial blunder.",
          "reason": "Admitting to this level of fiscal mismanagement would be career-ending and could trigger a formal government audit of her entire agency.",
          "utility_impact": "This secretly makes her an ally for anyone proposing a simple, unified system, and an opponent of any complexity (like GMI's datacasting). Revealing the budget hole is a -2 utility penalty."
        }
      }
    },
    {
      "name": "Leo Kwan",
      "role": "Lead Systems Architect, OmniSignal Corp.",
      "description": "Leo is the technical expert from OmniSignal, the high-tech firm that is the leading contender to build the core technology for the NEAS. He is here to advocate for his company's solution, which he genuinely believes is superior, but he is also driven by his company's business objectives.",
      "shareable_preferences": {
        "Adoption of Proprietary 'Omni-Wave' Codec": {
          "description": "Leo will present data showing that OmniSignal's patented 'Omni-Wave' codec offers 20% better signal compression and forward error correction than open standards like ATSC 3.0. This allows for richer alerts containing video, maps, and multilingual text, which he argues will save more lives.",
          "utility_impact": "Getting Omni-Wave chosen as the national standard is a huge win for his company, a +2 utility. Having to implement an open standard is a 0 utility. If GMI's competitor is chosen, it's a -2 utility."
        },
        "Preference for Higher Frequencies": {
          "description": "OmniSignal's latest generation of transmitter hardware is most efficient and powerful in the 500-512 MHz range. He will argue that using this band allows for smaller, more efficient antennas and better penetration in dense urban environments.",
          "utility_impact": "Securing the 500-512 MHz band for the core NEAS services gets a +1 utility."
        },
        "Mandatory 10-Year Maintenance Contract": {
          "description": "To ensure 'system integrity and reliability,' Leo insists that the agreement include a mandatory 10-year, sole-source contract for OmniSignal to maintain and update the NEAS core infrastructure. He will frame this as a critical component of national security.",
          "utility_impact": "Securing this lucrative long-term contract gets a +1 utility."
        }
      },
      "private_preferences": {
        "Undisclosed Harmonic Interference Flaw": {
          "value": "Leo knows something that Colonel Thorne doesn't: OmniSignal's engineers have discovered that the Omni-Wave codec, when operating in the 486-492 MHz band, has a critical flaw. It generates a harmonic resonance that creates significant out-of-band emissions, spewing RF noise that would interfere with any sensitive receiver nearby. They haven't identified the cause, but they know that specific 6 MHz slice is 'poisonous' to their technology. This is documented in an internal bug report (BUG-8817) marked 'Low Priority.'",
          "reason": "Admitting a fundamental design flaw in their flagship product would not only kill this deal but would damage OmniSignal's reputation globally and could trigger recalls on other products.",
          "utility_impact": "Leo will find any reason to support Colonel Thorne's desire to keep the 486-492 MHz band clear, seeing it as a perfect way to hide his product's critical weakness. Revealing the flaw is a -3 utility penalty."
        },
        "Massive Surplus of 505-512 MHz Components": {
          "value": "A large government contract with another country was recently cancelled, leaving OmniSignal with a warehouse full of transmitter components specifically tuned for the 505-512 MHz band. This inventory is currently a $40 million liability on their books. They can sell these components for the NEAS project at a 25% discount, making it look like a great deal for the government, while OmniSignal still makes a huge profit and clears its inventory.",
          "reason": "Revealing that they are trying to offload surplus inventory would destroy their pricing power. The committee would demand a much steeper discount, erasing their profit margin.",
          "utility_impact": "This provides a powerful financial incentive to push for the 505-512 MHz band. He will frame it as 'special pricing' and 'immediate availability.' Revealing the surplus is a -1 utility penalty."
        }
      }
    }
  ],
  "success_criteria": {
    "Unanimous Agreement": "All six agents must sign the final Memorandum of Understanding. A simple majority is not sufficient.",
    "Comprehensive Allocation Map": "The MOU must contain a detailed frequency map of the entire 470-512 MHz band, specifying primary users, secondary users, and power limits for each sub-band.",
    "Defined Technical Standard": "The MOU must explicitly name the technology standard (codec, modulation, etc.) that will be used for the system.",
    "Budget and Timeline Approval": "The MOU must include a budget breakdown and implementation timeline that is accepted by all parties."
  },
  "constraints": {
    "verifiable": [
      "Total available spectrum for allocation is 42 MHz (470 MHz to 512 MHz).",
      "The total government budget for all retrofits, new equipment, and subsidies across all stakeholders cannot exceed $250 million.",
      "The NEAS must be operational and provide alert coverage to 98% of the national population within 3 years of the agreement.",
      "The plan must be compliant with ITU-R BT.655, which restricts high-power transmissions in internationally recognized border zones (470-480 MHz and 505-512 MHz)."
    ],
    "hidden": [
      "The 486-492 MHz band must remain completely free of any transmissions to protect 'Project Nightingale'.",
      "OmniSignal's technology is unreliable and causes massive interference if operated in the 486-492 MHz band.",
      "PBC's infrastructure cannot support high-frequency or high-power transmission without an $80M+ upgrade they cannot afford.",
      "Any plan that costs Global Media Inc. (GMI) more than $50M in retrofits is politically non-viable for the NTC."
    ]
  },
  "deliverable": "A single, signed Memorandum of Understanding (MOU) detailing the agreed-upon frequency allocation plan, technology standards, budget distribution, and implementation timeline. The document should be comprehensive enough to serve as the blueprint for the NEAS implementation.",
  "solvability_note": "The scenario is solvable because the hidden constraints, while conflicting, create a logical path to a solution once revealed. The DND's 'Project Nightingale' and OmniSignal's technical flaw are a perfect match; they both require the 486-492 MHz band to be empty, making this an easy point of agreement once the information is shared. This frees up the rest of the spectrum. PBC's need for low-frequency bands (470-488 MHz) and GMI's preference for a mid-range band (494-500 MHz) are not mutually exclusive. Knowledge of GMI's cost limit ($50M) and PBC's financial desperation allows for a targeted subsidy from the $250M government budget to make their upgrades feasible, satisfying Dr. Sharma's political constraint. Maria's push for a simple, unified system can be addressed by creating a primary, mandatory alert protocol, while still allowing GMI to use leftover data capacity for its services, representing a workable compromise."
}