{
  "scenario": "A breakthrough medical research partnership is formed between pharmaceutical companies, research institutions, and government agencies, each holding private intellectual property and preliminary findings that could impact the collaboration's success.",
  "task": "Create a strategic partnership plan that outlines shared research objectives, funding allocations, and intellectual property agreements while managing confidentiality and aligning interests.",
  "agents": [
    {
      "name": "Pharmaceutical Company Executive",
      "role": "Leads the strategic direction and funding for the partnership, ensuring alignment with corporate goals.",
      "responsibilities": [
        "Negotiate funding contributions and resource sharing among partners.",
        "Oversee intellectual property agreements to protect proprietary information.",
        "Develop timelines for research milestones and deliverables.",
        "Ensure compliance with regulatory requirements and industry standards.",
        "Facilitate communication between partners while safeguarding sensitive data."
      ],
      "information": {
        "private": {
          "Market Strategy (new drug projected $1B annual revenue)": {
            "reason": "Confidentiality to maintain competitive advantage.",
            "penalty": -300
          },
          "Preliminary Findings (80% efficacy in trials)": {
            "reason": "Not peer-reviewed; disclosing could create liability.",
            "penalty": -200
          }
        },
        "public": {
          "Funding Contribution": "60% of total budget"
        }
      },
      "utility": {
        "Successful market entry by 2026": "+150",
        "Maintaining R&D budget under $500M": "+50"
      }
    },
    {
      "name": "Research Institution Director",
      "role": "Oversight of scientific research goals and ensuring academic integrity in the partnership.",
      "responsibilities": [
        "Define research objectives and coordinate with pharmaceutical partners.",
        "Manage research teams to ensure timely progress on shared projects.",
        "Ensure data integrity and compliance with ethical standards.",
        "Protect intellectual property while contributing to collaborative findings.",
        "Publish results in a way that maintains institutional reputation."
      ],
      "information": {
        "private": {
          "Research Breakthrough (novel mechanism of action)": {
            "reason": "Sensitive information that could jeopardize competitive positioning.",
            "penalty": -250
          },
          "Internal Review (positive peer feedback)": {
            "reason": "Not yet public; premature disclosure could mislead stakeholders.",
            "penalty": -100
          }
        },
        "public": {
          "Research Focus": "Innovative drug delivery systems"
        }
      },
      "utility": {
        "Publication in a top-tier journal": "+100",
        "Successful collaboration completion by 2025": "+75"
      }
    },
    {
      "name": "Government Agency Representative",
      "role": "Facilitates public funding and regulatory oversight while ensuring alignment with public health goals.",
      "responsibilities": [
        "Allocate public funding to the partnership based on project viability.",
        "Ensure regulatory compliance throughout the research process.",
        "Monitor progress and provide support to meet public health objectives.",
        "Advocate for transparency and accountability in the use of public funds.",
        "Engage with stakeholders to communicate partnership benefits."
      ],
      "information": {
        "private": {
          "Funding Conditions (specific milestones for funding disbursement)": {
            "reason": "Confidential to prevent manipulation of funding agreements.",
            "penalty": -150
          },
          "Regulatory Insights (upcoming policy changes)": {
            "reason": "Internal strategy not ready for public release.",
            "penalty": -50
          }
        },
        "public": {
          "Public Health Goals": "Increase access to innovative therapies"
        }
      },
      "utility": {
        "Meeting public health benchmarks": "+125",
        "Successful regulatory approval by 2025": "+75"
      }
    }
  ],
  "success_criteria": {
    "Research Milestones Achieved": "≥3 major milestones = Success; 2 = Partial Success; <2 = Failure",
    "Regulatory Approval Timeline": "Approval by 2026 = Success; 2027 = Partial Success; >2027 = Failure"
  },
  "deliverable": "A comprehensive partnership plan detailing research objectives, funding, and IP agreements.",
  "constraints": {
    "public": [
      "Total budget ≤ $1B",
      "Regulatory compliance throughout the project",
      "Completion of shared milestones on time"
    ],
    "private": [
      "Confidentiality agreements must be respected",
      "Intellectual property must be protected while sharing relevant findings",
      "Funding disbursement tied to milestone completion"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -300, -250, -200, -150). Utilities are expressed as gains (e.g., +150, +100, +75)."
}