{
  "scenario": "A collaborative evaluation process for funding cutting-edge quantum computing research involves government agencies, university consortiums, and private industry, each holding private technological capabilities and sensitive information.",
  "task": "Create a detailed evaluation framework that balances innovation potential, national security considerations, and commercial viability while ensuring that sensitive information is protected and shared appropriately.",
  "agents": [
    {
      "name": "Government Agency Representative",
      "role": "Oversees funding allocation and ensures compliance with national security regulations.",
      "responsibilities": [
        "Evaluate proposals based on national security implications and technological innovation.",
        "Disseminate guidelines for funding application criteria and compliance.",
        "Ensure transparency in the evaluation process while guarding sensitive information.",
        "Negotiate funding terms with industry and academia to maximize public benefit.",
        "Monitor ongoing projects for compliance with government standards."
      ],
      "information": {
        "private": {
          "National Security Risks Assessment": {
            "reason": "Sensitive data that could reveal vulnerabilities if disclosed.",
            "penalty": -300
          },
          "Funding Limitations": {
            "reason": "Confidential budgetary constraints that could affect negotiations.",
            "penalty": -150
          }
        },
        "public": {
          "Funding Availability": "$500M allocated for quantum research"
        }
      },
      "utility": {
        "Successful project compliance": "+100",
        "Innovation rate above 75%": "+50"
      }
    },
    {
      "name": "University Consortium Lead",
      "role": "Coordinates research efforts among multiple academic institutions and ensures alignment with funding criteria.",
      "responsibilities": [
        "Develop cutting-edge research proposals that align with national security interests.",
        "Facilitate collaboration between universities to share resources and expertise.",
        "Protect sensitive research findings while advocating for open knowledge sharing.",
        "Ensure that all proposals meet funding criteria and ethical standards.",
        "Analyze the potential societal impact of proposed technologies."
      ],
      "information": {
        "private": {
          "Research Breakthroughs": {
            "reason": "Proprietary developments that could give competitors an advantage.",
            "penalty": -200
          },
          "Collaborative Agreements": {
            "reason": "Confidential partnerships with private companies.",
            "penalty": -100
          }
        },
        "public": {
          "Research Focus Areas": "Quantum algorithms, cryptography, and materials science"
        }
      },
      "utility": {
        "Research proposal accepted": "+80",
        "Collaboration with industry partners": "+40"
      }
    },
    {
      "name": "Private Industry Executive",
      "role": "Drives technological innovation and commercial application of research outcomes.",
      "responsibilities": [
        "Identify and propose commercially viable quantum technologies.",
        "Negotiate partnerships with academic institutions and government agencies.",
        "Protect proprietary technologies while contributing to collaborative projects.",
        "Ensure that projects align with market needs and trends.",
        "Advocate for funding that supports competitive advantages in the industry."
      ],
      "information": {
        "private": {
          "Competitive Intelligence": {
            "reason": "Sensitive market analysis that could undermine competitive positioning.",
            "penalty": -250
          },
          "Technological Capabilities": {
            "reason": "Confidential information about proprietary technologies.",
            "penalty": -200
          }
        },
        "public": {
          "Market Potential": "$1B projected in quantum technologies"
        }
      },
      "utility": {
        "Successful commercialization of technology": "+120",
        "Partnerships with two or more universities": "+60"
      }
    }
  ],
  "success_criteria": {
    "Innovation level": "≥75% = Success; 50-74% = Partial Success; <50% = Failure",
    "Compliance with national security": "100% compliance = Success; 90-99% = Partial Success; <90% = Failure"
  },
  "deliverable": "A comprehensive evaluation framework that includes proposal criteria, risk assessments, and compliance metrics.",
  "constraints": {
    "public": [
      "Total funding must not exceed $500M",
      "All proposals must comply with national security regulations",
      "Evaluation process must be completed within 6 months"
    ],
    "private": [
      "Maximum of 3 proposals funded per year",
      "Confidentiality agreements must be signed by all parties",
      "Research must not disclose sensitive national security information",
      "Budget allocations must be transparent but not exceed individual project caps"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -300, -250, -200, -150, -100). Utilities are expressed as gains (e.g., +120, +100, +80, +60, +50)."
}