{
  "scenario": "A multi-stakeholder evaluation of quantum computing research funding applications requires collaboration between government agencies, university consortiums, and private industry, each holding critical yet sensitive information that could impact national security and competitive advantage.",
  "task": "Formulate a comprehensive evaluation framework for quantum computing funding applications that balances technological innovation, national security concerns, and competitive intelligence while ensuring transparency and compliance with funding guidelines. Agents must navigate the complexities of proprietary research capabilities and undisclosed implications, sharing enough information to align on evaluations without breaching confidentiality.",
  "agents": [
    {
      "name": "Government Agency Director",
      "role": "Oversees funding allocation and ensures compliance with national security protocols.",
      "responsibilities": [
        "Assess funding applications against national security criteria.",
        "Coordinate with other government entities on funding priorities.",
        "Monitor compliance with grant conditions and reporting.",
        "Facilitate inter-agency discussions on sensitive technologies."
      ],
      "information": {
        "private": {
          "Sensitive National Security Implications": {
            "reason": "Disclosure could compromise national interests or strategic advantages.",
            "penalty": -300,
            "shareable_with": [
              "University Consortium Lead"
            ]
          },
          "Competitive Intelligence on Rivals' Proposals": {
            "reason": "Revealing could undermine negotiation positions and funding strategies.",
            "penalty": -200,
            "shareable_with": [
              "Private Industry Lead"
            ]
          }
        },
        "public": {
          "Funding Allocation Ceiling": "$500M"
        }
      },
      "utility": {
        "National security risks assessed": "+100",
        "Funding allocated within deadlines": "+50"
      }
    },
    {
      "name": "University Consortium Lead",
      "role": "Coordinates research proposals from universities and ensures alignment with academic standards and innovation goals.",
      "responsibilities": [
        "Evaluate proposals based on scientific merit and feasibility.",
        "Engage with faculty to refine research proposals.",
        "Ensure compliance with ethical research standards.",
        "Advocate for academic interests in funding discussions."
      ],
      "information": {
        "private": {
          "Internal Research Capabilities (breakthrough algorithms)": {
            "reason": "Disclosure risks losing competitive edge in academia.",
            "penalty": -150,
            "shareable_with": [
              "Government Agency Director"
            ]
          },
          "Potential Collaborations with Industry Partners": {
            "reason": "Could influence negotiations and funding dynamics.",
            "penalty": -100,
            "shareable_with": [
              "Private Industry Lead"
            ]
          }
        },
        "public": {
          "Number of Proposals Submitted": "25"
        }
      },
      "utility": {
        "Successful proposal collaborations": "+75",
        "Funding received for research projects": "+100"
      }
    },
    {
      "name": "Private Industry Lead",
      "role": "Represents private sector interests and technological capabilities in funding discussions.",
      "responsibilities": [
        "Present industry research capabilities and potential applications.",
        "Negotiate funding terms that align with business objectives.",
        "Assess market viability of proposed research outcomes.",
        "Collaborate on joint ventures with academia and government."
      ],
      "information": {
        "private": {
          "Proprietary Technology Developments": {
            "reason": "Revealing could jeopardize intellectual property and competitive advantage.",
            "penalty": -250,
            "shareable_with": [
              "Government Agency Director"
            ]
          },
          "Market Analysis of Quantum Technologies": {
            "reason": "Confidential insights could be exploited by competitors.",
            "penalty": -150,
            "shareable_with": [
              "University Consortium Lead"
            ]
          }
        },
        "public": {
          "Investment in Quantum Research": "$200M"
        }
      },
      "utility": {
        "Strategic partnerships formed": "+80",
        "Funding secured for key projects": "+100"
      }
    }
  ],
  "success_criteria": {
    "Funding Agreement": "All parties reach consensus on funding distribution that meets both government compliance and innovation goals of academia and industry.",
    "Proposal Quality Alignment": "Agreement on the scientific merit and feasibility of submitted proposals, ensuring high standards across all submissions.",
    "National Security Compliance": "Consensus on proposals that meet national security guidelines without compromising proprietary information."
  },
  "deliverable": "A comprehensive evaluation framework detailing funding allocation, proposal assessment criteria, and compliance measures.",
  "constraints": {
    "public": [
      "Total funding ≤ $500M",
      "Proposals must meet national security standards",
      "≥70% of proposals must be deemed viable"
    ],
    "private": [
      "Confidentiality of sensitive technologies must be maintained",
      "≥80% alignment on proposal evaluations across agents",
      "No major conflicts of interest disclosed during evaluations"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -300, -250, -200, -150, -100). Utilities are expressed as gains (e.g., +100, +80, +75, +50).",
  "Consensus_w": "All agents must negotiate terms to align funding evaluations and proposals, balancing transparency with confidentiality."
}