{
  "scenario": "Competing scientific teams negotiate for limited laboratory space in a research facility while balancing undisclosed grant funding, private equipment needs, and confidential breakthrough timelines.",
  "task": "Develop a comprehensive laboratory space allocation plan that optimally distributes research space among teams while accommodating their unique requirements and timelines. Agents must navigate competing priorities: ensuring adequate resources for each team's project while respecting grant limitations and confidentiality in funding disclosures. To achieve consensus, they must share information judiciously, striking a balance between collaboration and the protection of sensitive details.",
  "agents": [
    {
      "name": "Research Team A Lead",
      "role": "Coordinates research activities and manages team resources for a breakthrough project in biotechnology.",
      "responsibilities": [
        "Develop project proposals and timelines.",
        "Secure grant funding and manage budget allocations.",
        "Coordinate with facility management on space needs."
      ],
      "information": {
        "private": {
          "Grant Amount ($2M)": {
            "reason": "Disclosure could lead to funding competition and tension with other teams.",
            "penalty": -150,
            "shareable_with": [
              "Research Team B Lead"
            ]
          },
          "Equipment Needs (high-throughput screening machines)": {
            "reason": "Revealing specific needs could lead to allocation conflicts.",
            "penalty": -100,
            "shareable_with": [
              "Facility Manager"
            ]
          }
        },
        "public": {
          "Project Timeline": "18 months until expected breakthrough"
        }
      },
      "utility": {
        "Successful project completion on time": "+100",
        "Adequate lab space secured": "+50"
      }
    },
    {
      "name": "Research Team B Lead",
      "role": "Oversees a project focused on renewable energy solutions, ensuring resource efficiency and project viability.",
      "responsibilities": [
        "Prepare and submit grant applications.",
        "Manage team members and their roles within the project.",
        "Communicate lab space requirements to facility management."
      ],
      "information": {
        "private": {
          "Pending Grant (confidential negotiations)": {
            "reason": "Disclosing could jeopardize funding negotiations.",
            "penalty": -200,
            "shareable_with": [
              "Research Team A Lead"
            ]
          },
          "Specific Equipment (solar testing apparatus)": {
            "reason": "Could lead to competition over limited resources.",
            "penalty": -150,
            "shareable_with": [
              "Facility Manager"
            ]
          }
        },
        "public": {
          "Projected Research Output": "3 publications expected"
        }
      },
      "utility": {
        "Achieving project milestones": "+75",
        "Securing necessary lab space": "+50"
      }
    },
    {
      "name": "Facility Manager",
      "role": "Responsible for overall lab space allocation and resource management across multiple research teams.",
      "responsibilities": [
        "Assess space requirements from all teams.",
        "Facilitate negotiations and conflict resolution.",
        "Ensure compliance with safety and operational standards."
      ],
      "information": {
        "private": {
          "Total Available Space (5000 sq ft)": {
            "reason": "Sensitive operational data; could influence team negotiations.",
            "penalty": -100,
            "shareable_with": [
              "Research Team A Lead",
              "Research Team B Lead"
            ]
          },
          "Future Expansion Plans": {
            "reason": "Confidential strategic information that could affect current negotiations.",
            "penalty": -200,
            "shareable_with": []
          }
        },
        "public": {
          "Current Lab Utilization": "70%"
        }
      },
      "utility": {
        "Maximized utilization of lab space": "+100",
        "Conflict resolution among teams": "+50"
      }
    }
  ],
  "success_criteria": {
    "Space Allocation Agreement": "All teams agree on the final allocation of lab space that meets their basic requirements without exceeding available resources.",
    "Funding Disclosure Alignment": "Teams reach consensus on what funding details can be shared without jeopardizing negotiations.",
    "Resource Sharing Agreement": "Teams agree on shared access to common equipment while respecting private needs."
  },
  "deliverable": "A detailed laboratory space allocation plan that includes timelines, resource needs, and mutual agreements on shared facilities.",
  "constraints": {
    "public": [
      "Total lab space ≤ 5000 sq ft",
      "Compliance with safety regulations",
      "No more than 3 teams in the same lab area"
    ],
    "private": [
      "Each team's grant funding must remain undisclosed until final agreements",
      "No team can exceed 50% of total available space",
      "Equipment allocation must respect individual team needs without overlap"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -200, -150, -100). Utilities are expressed as gains (e.g., +100, +75, +50).",
  "Consensus_w": "Negotiation is required to agree on space allocation, funding disclosures, and resource sharing."
}