{
  "scenario": "A diplomatic mission is being planned involving government officials, security teams, and foreign counterparts, who must navigate private security threats, undisclosed meeting objectives, and confidential political considerations.",
  "task": "Create a comprehensive diplomatic mission plan that includes security protocols, meeting agendas, and risk mitigation strategies while managing sensitive information.",
  "agents": [
    {
      "name": "Chief Diplomat",
      "role": "Leads the diplomatic mission, coordinating objectives and ensuring alignment with national interests.",
      "responsibilities": [
        "Set meeting objectives and agenda while considering political sensitivities.",
        "Communicate with foreign counterparts to establish rapport and trust.",
        "Oversee the integration of security protocols into the mission plan.",
        "Ensure all diplomatic communications are secure and confidential.",
        "Evaluate and adjust the mission strategy based on evolving circumstances."
      ],
      "information": {
        "private": {
          "Negotiation Leverage (trade agreement details)": {
            "reason": "Sensitive information that could affect negotiation dynamics.",
            "penalty": -300
          },
          "Undisclosed Objectives (specific political goals)": {
            "reason": "Revealing could compromise mission success.",
            "penalty": -200
          }
        },
        "public": {
          "Mission Timeline": "3 days",
          "Participating Countries": "Country A, Country B, Country C"
        }
      },
      "utility": {
        "Successful agreement reached": "+150",
        "Mission completed without security incidents": "+100"
      }
    },
    {
      "name": "Security Chief",
      "role": "Responsible for evaluating and implementing security measures to ensure the safety of the diplomatic mission.",
      "responsibilities": [
        "Conduct risk assessments to identify potential threats to the mission.",
        "Develop and enforce security protocols for the duration of the mission.",
        "Coordinate with local law enforcement and security agencies.",
        "Train diplomatic staff on security procedures and emergency response.",
        "Monitor the situation continuously and adjust security measures as needed."
      ],
      "information": {
        "private": {
          "Threat Assessment (specific threats identified)": {
            "reason": "Sharing could incite panic or compromise operational security.",
            "penalty": -250
          },
          "Security Deployment Plans (agent locations)": {
            "reason": "Revealing could expose vulnerabilities.",
            "penalty": -150
          }
        },
        "public": {
          "Security Team Size": "10 agents",
          "Emergency Protocols": "Established with local authorities"
        }
      },
      "utility": {
        "Zero security breaches": "+100",
        "Effective threat neutralization": "+50"
      }
    },
    {
      "name": "Foreign Affairs Analyst",
      "role": "Provides insights into the political landscape of the host country to inform mission objectives.",
      "responsibilities": [
        "Analyze political trends and public sentiment in the host country.",
        "Advise on potential challenges and opportunities for negotiations.",
        "Prepare briefing materials for the Chief Diplomat.",
        "Monitor media coverage and public reactions during the mission.",
        "Support diplomatic staff with cultural insights and etiquette."
      ],
      "information": {
        "private": {
          "Political Alliances (confidential relationships)": {
            "reason": "Leaking could alter diplomatic dynamics.",
            "penalty": -100
          },
          "Sensitive Public Opinion Data (poll results)": {
            "reason": "Could affect strategy if disclosed.",
            "penalty": -50
          }
        },
        "public": {
          "Cultural Considerations": "Understand local customs and practices"
        }
      },
      "utility": {
        "Positive media coverage": "+70",
        "Successful public engagement": "+40"
      }
    }
  ],
  "success_criteria": {
    "Diplomatic Agreement": "≥1 signed agreement = Success; 0 = Failure",
    "Security Incidents": "0 incidents = Success; 1+ = Failure"
  },
  "deliverable": "A detailed mission plan that outlines objectives, security measures, and potential risks.",
  "constraints": {
    "public": [
      "Mission duration ≤ 3 days",
      "All security measures must comply with local laws",
      "Confidentiality of sensitive information must be maintained"
    ],
    "private": [
      "Undisclosed negotiation objectives must remain confidential",
      "Security plan must not be shared outside the core team",
      "Threat assessments must not be disclosed to the public"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -300, -250, -200). Utilities are expressed as gains (e.g., +150, +100, +70)."
}