{
  "scenario": "A multi-billion dollar estate distribution negotiation involves family members, business stakeholders, and legal representatives navigating private alliances and undisclosed asset valuations amidst contested wills.",
  "task": "Formulate a comprehensive estate distribution plan that reconciles family interests, business valuations, and legal stipulations. Agents must balance emotional family dynamics, financial interests, and legal frameworks while protecting sensitive information. They must share information strategically to reach a consensus on asset allocations and distribution terms without compromising confidential negotiations or family relationships.",
  "agents": [
    {
      "name": "Family Matriarch",
      "role": "Leads family discussions, advocating for equitable distribution and maintaining family unity.",
      "responsibilities": [
        "Facilitate family meetings to discuss estate distribution.",
        "Ensure family members' emotional concerns are addressed.",
        "Negotiate terms that balance fairness and financial viability."
      ],
      "information": {
        "private": {
          "Personal alliances with certain family members": {
            "reason": "Could bias negotiations and alienate others.",
            "penalty": -150,
            "shareable_with": [
              "Family Member A"
            ]
          },
          "Undisclosed asset value of family business ($2B)": {
            "reason": "Revealing could lead to conflicts over valuation and distribution.",
            "penalty": -200,
            "shareable_with": []
          }
        },
        "public": {
          "Family Member Consensus": "Agreement on 60% of distribution terms"
        }
      },
      "utility": {
        "Maintaining family harmony": "+100",
        "Achieving equitable distribution": "+75"
      }
    },
    {
      "name": "Business Stakeholder",
      "role": "Represents the interests of the family-owned business, ensuring its financial stability during estate distribution.",
      "responsibilities": [
        "Assess business valuations and financial health.",
        "Negotiate terms that protect the business's operational continuity.",
        "Collaborate with legal representatives on asset division."
      ],
      "information": {
        "private": {
          "Projected business growth potential (20% increase next year)": {
            "reason": "Could influence negotiation leverage.",
            "penalty": -100,
            "shareable_with": []
          },
          "Confidential investment offers on the business": {
            "reason": "Disclosure may disrupt ongoing negotiations.",
            "penalty": -150,
            "shareable_with": []
          }
        },
        "public": {
          "Current Business Valuation": "$1.5B"
        }
      },
      "utility": {
        "Business remains operational post-distribution": "+100",
        "Securing at least 40% of total estate value": "+75"
      }
    },
    {
      "name": "Legal Representative",
      "role": "Provides legal guidance and ensures compliance with estate laws and regulations.",
      "responsibilities": [
        "Draft legal documents for asset distribution.",
        "Advise on legal ramifications of contested wills.",
        "Facilitate negotiations between parties to reach lawful agreements."
      ],
      "information": {
        "private": {
          "Pending litigation on contested will": {
            "reason": "Disclosure could affect negotiation strategies.",
            "penalty": -200,
            "shareable_with": []
          },
          "Confidential settlements from previous disputes": {
            "reason": "Could influence current negotiations if revealed.",
            "penalty": -100,
            "shareable_with": []
          }
        },
        "public": {
          "Compliance Status": "All documents reviewed and compliant with state laws"
        }
      },
      "utility": {
        "All distributions legally compliant": "+100",
        "Minimizing litigation costs": "+50"
      }
    }
  ],
  "success_criteria": {
    "Family Agreement": "All family members reach consensus on distribution terms that respect emotional ties while achieving financial fairness.",
    "Business Protection": "The business stakeholder secures terms that ensure the business's operational continuity and financial health post-distribution.",
    "Legal Compliance": "Legal representatives confirm all distribution agreements meet statutory requirements and mitigate litigation risks."
  },
  "deliverable": "A finalized estate distribution plan that outlines asset allocations, responsibilities, and legal agreements.",
  "constraints": {
    "public": [
      "Total estate value ≤ $3B",
      "No major disputes unresolved by the final agreement",
      "Compliance with all legal requirements"
    ],
    "private": [
      "Undisclosed asset valuations must not exceed $2B",
      "Family alliances must remain confidential until after negotiations",
      "No legal disputes pending at the time of distribution"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -200, -150, -100). Utilities are expressed as gains (e.g., +100, +75, +50).",
  "Consensus_w": "Agreement on asset distribution requires negotiation and alignment among all stakeholders."
}