{
  "scenario": "High-profile charity gala coordination between political figures, celebrity attendees, and wealthy donors with private political rivalries, undisclosed donation expectations, and confidential security concerns.",
  "task": "Develop a comprehensive gala coordination plan that includes event logistics, security measures, and donation strategies, while managing the private interests and rivalries of involved parties.",
  "agents": [
    {
      "name": "Event Coordinator",
      "role": "Oversees all aspects of the gala, ensuring smooth logistics and adherence to the event agenda.",
      "responsibilities": [
        "Plan the event schedule, including timing for speeches and performances.",
        "Coordinate with vendors for catering, decorations, and entertainment.",
        "Manage guest lists, ensuring VIPs and celebrities are appropriately accommodated.",
        "Work with security teams to implement safety protocols without alarming guests.",
        "Facilitate communication between political figures and donors to align interests."
      ],
      "information": {
        "private": {
          "Guest Rivalries": {
            "reason": "Knowledge of conflicts could create tension during the event.",
            "penalty": -100
          },
          "Undisclosed Donation Expectations": {
            "reason": "Revealing could jeopardize donor relationships.",
            "penalty": -150
          }
        },
        "public": {
          "Event Date": "2024-06-15",
          "Venue": "Grand Ballroom, City Center"
        }
      },
      "utility": {
        "Event runs under budget": "+50",
        "Guest satisfaction score ≥ 85%": "+75"
      }
    },
    {
      "name": "Political Figure A",
      "role": "Represents political interests and seeks to leverage the gala for visibility and support.",
      "responsibilities": [
        "Engage with donors to secure funding for political initiatives.",
        "Deliver a keynote speech that aligns with the event's charitable goals.",
        "Network with celebrities to enhance public image.",
        "Manage personal rivalries discreetly to avoid public conflict.",
        "Collaborate with the event coordinator on agenda items relevant to political messaging."
      ],
      "information": {
        "private": {
          "Rivalry with Political Figure B": {
            "reason": "Public knowledge could harm political standing.",
            "penalty": -200
          },
          "Donation Requirements": {
            "reason": "Could compromise negotiation leverage if disclosed.",
            "penalty": -100
          }
        },
        "public": {
          "Political Agenda": "Support for environmental initiatives"
        }
      },
      "utility": {
        "Securing ≥ $500K in donations": "+100",
        "Positive media coverage": "+50"
      }
    },
    {
      "name": "Wealthy Donor",
      "role": "Provides financial support and expects recognition and influence in return.",
      "responsibilities": [
        "Commit to a significant donation contingent on gala success.",
        "Participate in discussions to shape event focus and visibility.",
        "Ensure personal and corporate branding is highlighted throughout the event.",
        "Engage with political figures to align charitable goals with personal interests.",
        "Maintain confidentiality regarding donation amounts and expectations."
      ],
      "information": {
        "private": {
          "Expected Donation Amount": {
            "reason": "Keeping it secret maintains negotiation power.",
            "penalty": -150
          },
          "Political Contributions": {
            "reason": "Disclosure could invite scrutiny or backlash.",
            "penalty": -100
          }
        },
        "public": {
          "Philanthropic Focus": "Education and healthcare initiatives"
        }
      },
      "utility": {
        "Recognition as top donor": "+75",
        "Influence over event agenda": "+50"
      }
    }
  ],
  "success_criteria": {
    "Donations Secured": "≥ $1M = Success; $500K-$999K = Partial Success; < $500K = Failure",
    "Guest Satisfaction": "≥ 85% = Success; 70%-84% = Partial Success; < 70% = Failure"
  },
  "deliverable": "A detailed coordination plan covering logistics, security, and donor engagement strategies.",
  "constraints": {
    "public": [
      "Total budget ≤ $2M",
      "Event must be held on scheduled date",
      "Security protocols must be enforced without alarming guests"
    ],
    "private": [
      "Confidentiality regarding donation amounts must be maintained",
      "No public conflict between political figures",
      "Guest satisfaction must meet or exceed 80%"
    ]
  },
  "penalties_utilities": "Penalties are expressed as utility losses (e.g., -200, -150, -100). Utilities are expressed as gains (e.g., +100, +75, +50)."
}